
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ВладелецФайла) Тогда
		ВладелецФайла = Параметры.ВладелецФайла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ВидДокумента) Тогда
		ВидДокумента = Параметры.ВидДокумента;
	КонецЕсли;
	
	ВыбранныеФайлы.Загрузить(РегистрацияОрганизацииВызовСервера.ТаблицаОтсканированныхСтраницДокумента(
		ВладелецФайла,
		ВидДокумента));
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не ЗавершениеРаботы И Модифицированность Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект);
		ТекстСообщения = НСтр("ru = 'Данные были изменены. Записать изменения?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстСообщения, РежимДиалогаВопрос.ДаНет);
		
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	КоличествоФайлов = 0;
	Для Каждого ТекущийФайл Из ВыбранныеФайлы Цикл
		Если ЗначениеЗаполнено(ТекущийФайл.Ссылка) Тогда
			КоличествоФайлов = КоличествоФайлов + 1;
		КонецЕсли;
	КонецЦикла;
	
	ОповеститьОВыборе(КоличествоФайлов);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ДопустимыеРасширения = ДопустимыеРасширенияФайлов();
	ТекстСообщения = СтрШаблон(НСтр("ru = 'Выбран некорректный файл.
		|Сканы документов должны быть в формате: %1.'"), СтрСоединить(ДопустимыеРасширения, ", "));
	
	Для Каждого ТекущийФайл Из ВыбранныеФайлы Цикл
		
		Если Не ЗначениеЗаполнено(ТекущийФайл.Ссылка)
			И ДопустимыеРасширения.Найти(НРег(ТекущийФайл.РасширениеФайла)) = Неопределено Тогда
			
			ИмяПоля = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ВыбранныеФайлы", ТекущийФайл.НомерСтроки, "ИмяФайла");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , ИмяПоля, , Отказ);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВыбранныеФайлы

&НаКлиенте
Процедура ВыбранныеФайлыПриИзменении(Элемент)
	
	ОбновитьНумерациюСтрок();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеФайлыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбранныеФайлыДобавлениеЗавершение", ЭтотОбъект);
	
	ДопустимыеРасширения = СтрСоединить(ДопустимыеРасширенияФайлов(), ";*.");
	
	Фильтр = СтрШаблон(НСтр("ru = 'Картинка (*.%1)|*%1'"), ДопустимыеРасширения);
	
	ПараметрыЗагрузки = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
	ПараметрыЗагрузки.ИдентификаторФормы = УникальныйИдентификатор;
	ПараметрыЗагрузки.Диалог.Фильтр = Фильтр;
	ПараметрыЗагрузки.Диалог.МножественныйВыбор = Истина;
	
	ФайловаяСистемаКлиент.ЗагрузитьФайлы(ОписаниеОповещения, ПараметрыЗагрузки);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеФайлыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ВыбранныеФайлы.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Ссылка) Тогда
		
		ДанныеФайла = РегистрацияОрганизацииВызовСервера.ДанныеФайлаДляОткрытия(
			ТекущиеДанные.Ссылка,
			УникальныйИдентификатор);
		РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла);
		
	ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.ПутьКФайлу) Тогда
		
		ФайловаяСистемаКлиент.ОткрытьФайл(ТекущиеДанные.ПутьКФайлу);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеФайлыПередУдалением(Элемент, Отказ)
	
	ФайлыКУдалению = Новый Массив;
	
	ВыбранныеСтроки = Элементы.ВыбранныеФайлы.ВыделенныеСтроки;
	Для Каждого ТекущаяСтрока Из ВыбранныеСтроки Цикл
		
		Если Элементы.ВыбранныеФайлы.ПроверитьСтроку(ТекущаяСтрока) Тогда
			ДанныеСтроки = Элементы.ВыбранныеФайлы.ДанныеСтроки(ТекущаяСтрока);
			Если ЗначениеЗаполнено(ДанныеСтроки.Ссылка) Тогда
				ФайлыКУдалению.Добавить(ДанныеСтроки.Ссылка);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ПометитьНаУдалениеПрикрепленныеФайлы(ФайлыКУдалению);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДействиеОК(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		
		Если Модифицированность Тогда
			ЗаписатьПрикрепленныеФайлы();
			Модифицированность = Ложь;
		КонецЕсли;
		
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыбранныеФайлыДобавлениеЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(РезультатВыбора) Тогда
		Возврат;
	КонецЕсли;
	
	ДопустимыеРасширения = ДопустимыеРасширенияФайлов();
	
	Для Каждого ТекущийФайл Из РезультатВыбора Цикл
		
		СтрокиРазделения = СтрРазделить(ТекущийФайл.ИмяФайла, ".");
		РасширениеФайла = СтрокиРазделения[СтрокиРазделения.Количество() - 1];
		Если ДопустимыеРасширения.Найти(НРег(РасширениеФайла)) = Неопределено Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Неверный формат файла: %1.
				|Допустимые расширения файлов: %2'"),
				ТекущийФайл.ИмяФайла,
				СтрСоединить(ДопустимыеРасширения, ", "));
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ВыбранныеФайлы.Добавить();
		НоваяСтрока.НомерСтроки = ВыбранныеФайлы.Количество();
		НоваяСтрока.АдресФайла = ТекущийФайл.Хранение;
		НоваяСтрока.ИмяФайла = ТекущийФайл.ИмяФайла;
		НоваяСтрока.РасширениеФайла = РасширениеФайла;
		НоваяСтрока.ПутьКФайлу = ТекущийФайл.ПолноеИмя;
		
	КонецЦикла;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПрикрепленныеФайлы()
	
	УказательСтраницы = РегистрацияОрганизацииКлиентСервер.ИдентификаторСтраницыПрикрепленногоФайлаДокумента();
	
	Автор = Пользователи.ТекущийПользователь();
	
	Для Каждого ТекущийФайл Из ВыбранныеФайлы Цикл
		
		ОписаниеФайла = СтрШаблон(Нстр("ru = '%1, %2%3'"),
			ВидДокумента,
			УказательСтраницы,
			Формат(ТекущийФайл.НомерСтроки, "ЧДЦ=0; ЧГ=0"));
		
		Если ТекущийФайл.Ссылка.Пустая() Тогда
			
			СведенияОФайле = РаботаСФайлами.ПараметрыДобавленияФайла();
			СведенияОФайле.ВладелецФайлов = ВладелецФайла;
			СведенияОФайле.Автор = Автор;
			СведенияОФайле.ИмяБезРасширения = ТекущийФайл.ИмяФайла;
			СведенияОФайле.РасширениеБезТочки = ТекущийФайл.РасширениеФайла;
			
			ТекущийФайл.Ссылка = РаботаСФайлами.ДобавитьФайл(СведенияОФайле, ТекущийФайл.АдресФайла, , ОписаниеФайла);
			
		Иначе
			СпрОбъект = ТекущийФайл.Ссылка.ПолучитьОбъект();
			СпрОбъект.Описание = ОписаниеФайла;
			СпрОбъект.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНумерациюСтрок()
	
	КоличествоСтрок = ВыбранныеФайлы.Количество() - 1;
	Для ИндексСтроки = 0 По КоличествоСтрок Цикл
		ВыбранныеФайлы[ИндексСтроки].НомерСтроки = ИндексСтроки + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПометитьНаУдалениеПрикрепленныеФайлы(ФайлыКУдалению)
	
	Для Каждого ТекущийФайл Из ФайлыКУдалению Цикл
		СпрОбъект = ТекущийФайл.ПолучитьОбъект();
		СпрОбъект.УстановитьПометкуУдаления(Истина);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть();
		Возврат;
	КонецЕсли;
	
	Если ПроверитьЗаполнение() Тогда
		Модифицированность = Ложь;
		ЗаписатьПрикрепленныеФайлы();
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ДопустимыеРасширенияФайлов()
	
	Результат = Новый Массив;
	Результат.Добавить("png");
	Результат.Добавить("jpg");
	Результат.Добавить("jpeg");
	Результат.Добавить("bmp");
	Результат.Добавить("tiff");
	Результат.Добавить("tif");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти