#Область ПрограммныйИнтерфейс

Функция ДатаНачалаЭксперимента() Экспорт
	
	Возврат Дата(2019, 1, 1);
	
КонецФункции

// Возвращает ставки налога на профессиональный доход, указанные в законе.
//
// Параметры:
//   Период - Дата - дата, на которую необходимо получить значения ставок.
//
// Возвращаемое значение:
//  Структура - ставки налогов.
//    * ДоходыОтФизЛиц - Число.
//    * ДоходыОтЮрЛицИП - Число.
//
Функция НалоговыеСтавки(Период) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ДоходыОтФизЛиц", 4);
	Результат.Вставить("ДоходыОтЮрЛицИП", 6);
	
	Возврат Результат;
	
КонецФункции

// Возвращает предел доходов налогоплательщика, ограничивающий его право на применение спецрежима "Налог на профессиональный доход"
//
// Возвращаемое значение:
//  Число - Число - Граница доходов, ограничивающая право применения НПД
//
Функция ПределДоходов(Период) Экспорт
	
	// Лимит доходов налогоплательщика, ограничивающий его право на применение НПД
	Возврат 2400000;
	
КонецФункции

// Возвращает ставки налогового вычета и максимальную сумму вычета, указанные в законе.
//
// Параметры:
//   Период - Дата - дата, на которую необходимо получить ставки вычета и предел.
//
// Возвращаемое значение:
//   Структура - структура с ключами:
//      * СтавкаДоходыОтФизЛиц - Число.
//      * СтавкаДоходыОтЮрЛицИП - Число.
//      * Предел - Число.
//
Функция ПараметрыНалоговогоВычета(Период) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("СтавкаДоходыОтФизЛиц", 1);
	Результат.Вставить("СтавкаДоходыОтЮрЛицИП", 2);
	Результат.Вставить("Предел", 10000);
	
	Возврат Результат;
	
КонецФункции

// Возвращает способы подачи уведомления о переходе на УСН с НПД в связи с утратой права
//
// Возвращаемое значение:
//   Структура
//
Функция СпособыПодачиЗаявленияОбУтратеПраваНПД() Экспорт
	
	СтруктураНавигации = Новый Структура;
	СтруктураНавигации.Вставить("ИФНСлично", "ИФНСлично");
	СтруктураНавигации.Вставить("ИФНСпредставитель", "ИФНСпредставитель");
	
	Возврат СтруктураНавигации;
	
КонецФункции

// Возвращает вид уведомления о переходе на УСН при утрате права применения НПД
//
// Возвращаемое значение:
//   ПеречислениеСсылка.ВидыУведомленийОСпецрежимахНалогообложения
//
Функция ВидУведомленияПереходНПДУСН() Экспорт
	
	Возврат ПредопределенноеЗначение("Перечисление.ВидыУведомленийОСпецрежимахНалогообложения.УведомлениеПереходНПДУСН");
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает заголовок помощника для перехода на другой режим с НПД
//
// Возвращаемое значение:
//   Строка
//
Функция ЗаголовокПомощникаУтратыНПД() Экспорт
	
	Возврат НСтр("ru = 'Утрата права применения налога на профессиональный доход'");
	
КонецФункции

Функция НавигационнаяСсылкаШага(НавигацияПараметрФормы) Экспорт
	
	СтруктураШагов = СтруктураШаговПомощникаУтратыПраваНПД();
	
	Для Каждого ТекущийШаг Из СтруктураШагов Цикл
		Если ТекущийШаг.Значение = НавигацияПараметрФормы Тогда
			Возврат ТекущийШаг.Ключ;
		КонецЕсли;
	КонецЦикла;
	
	Возврат "Шаг1";
	
КонецФункции

Функция НовыеДанныеПредставителя() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Представитель", "");
	Результат.Вставить("ДокументПредставителя", "");
	
	Возврат Результат;
	
КонецФункции

Функция СтруктураШаговПомощникаУтратыПраваНПД() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Шаг1", "Налоги");
	Результат.Вставить("Шаг2", "Заявление");
	Результат.Вставить("Шаг3", "Документы");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти