#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяДата = ОбщегоНазначения.ТекущаяДатаПользователя();
	
	ДанныеВыбора = Новый СписокЗначений;
	// п.1.2 ст.430 НК РФ
	ДанныеВыбора.Добавить(Перечисления.ИПТарифыФиксированныхВзносов.Единый);
	
	Если УчетСтраховыхВзносовИПКлиентСервер.ДоступенТарифДляВоенныхПенсионеров(ТекущаяДата) Тогда
		// п.1.4 ст.430 НК РФ
		ДанныеВыбора.Добавить(Перечисления.ИПТарифыФиксированныхВзносов.ВоенныйПенсионер);
	КонецЕсли;
	
	Если УчетСтраховыхВзносовИПКлиентСервер.ПрименяетсяТарифУчастникСЭЗ(ТекущаяДата)
		И ИнтеграцияСБанкамиПовтИсп.ИнтеграцияВИнформационнойБазеВключена() Тогда
		// п.1.3 ст.430 НК РФ
		ДанныеВыбора.Добавить(Перечисления.ИПТарифыФиксированныхВзносов.УчастникСЭЗнаНТ);
		// п.1.4 ст.430 НК РФ
		ДанныеВыбора.Добавить(Перечисления.ИПТарифыФиксированныхВзносов.ВоенныйПенсионерСЭЗ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли