#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ПериодыПерехода.Загрузить(Параметры.ПериодыПерехода.Выгрузить());
	Для каждого Период Из Объект.ПериодыПерехода Цикл
		Период.ПериодПерехода = НачалоГода(ДобавитьМесяц(Период.ПериодПерехода, 1));
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыПериодыПерехода

&НаКлиенте
Процедура ПериодыПереходаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОповеститьОВыборе(Объект.ПериодыПерехода[ВыбраннаяСтрока]);
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	ОповеститьОВыборе(Элементы.ПериодыПерехода.ТекущиеДанные);
КонецПроцедуры

#КонецОбласти