#Область СлужебныйПрограммныйИнтерфейс

// Возвращает имя действия для открытия журнала регистрации
//
// Возвращаемое значение:
//  Строка
//
Функция ИмяДействияОткрытьЖурналРегистрации() Экспорт
	
	Возврат "ЖурналРегистрации";
	
КонецФункции

Функция ИмяДействияОбращениеВТехподдержку1С() Экспорт
	
	Возврат "ОбращениеВПоддержку1С";
	
КонецФункции

// Возвращает имя ключа настроек, содержащих дату обращения в техническую поддержку,
// по ошибке обмена с сервисом АУСН
//
// Возвращаемое значение:
//  Строка
//
Функция ИмяКлючаНастроекДатаОбращенияВТехподдержку1С() Экспорт
	
	Возврат "АУСН_ДатаОбращения";
	
КонецФункции

Функция ИмяДействияЛичныйКабинетБанка() Экспорт
	
	Возврат "ЛКБанка";
	
КонецФункции

Функция ИмяДействияИнформацияОбОшибкеАУСН() Экспорт
	
	Возврат "ИнформацияОбОшибкеАУСН";
	
КонецФункции

Функция ИмяДействияИнформацияОбОтклоненнойОперацииАУСН() Экспорт
	
	Возврат "ИнформацияОбОтклоненнойОперацииАУСН";
	
КонецФункции

Функция ИмяДействияИсправитьОшибкиОтправкиАУСН() Экспорт
	
	Возврат "ОшибкиОтправкиАУСН";
	
КонецФункции

#КонецОбласти