#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ПередЗагрузкойНастроекВКомпоновщик(Контекст, КлючСхемы, КлючВарианта, НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД) Экспорт
	
	БухгалтерскиеОтчетыВызовСервера.ПередЗагрузкойНастроекВКомпоновщик(
		ЭтотОбъект, Контекст, КлючСхемы, КлючВарианта, НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД);
	
КонецПроцедуры

Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	Настройки.События.ПриСозданииНаСервере = Истина;
	Настройки.События.ПередЗагрузкойНастроекВКомпоновщик = Истина;	
КонецПроцедуры

// Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
// 
// Параметры:
//  ЭтаФорма             - ФормаКлиентскогоПриложения - Форма отчета.
//  Отказ                - Булево - Передается из параметров обработчика.
//  СтандартнаяОбработка - Булево - Передается из параметров обработчика.
//
Процедура ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка) Экспорт
	
	Параметры = ЭтаФорма.Параметры;
	
	ЭтаФорма.ФормаПараметры.Отбор.Вставить("НачалоПериода", Параметры.НачалоПериода);
	ЭтаФорма.ФормаПараметры.Отбор.Вставить("КонецПериода", Параметры.КонецПериода);
	
	ЭтаФорма.ФормаПараметры.Отбор.Вставить("Организация", Параметры.Организация);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли