
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыОткрытия = ОбщегоНазначенияБПКлиентСервер.ПараметрыОткрытияФормыСОжиданием(ПараметрыВыполненияКоманды);
	ПараметрыОткрытия.Заголовок    = НСтр("ru = 'Признание в НУ арендных платежей'");
	ПараметрыОткрытия.ИмяФормы     = "Документ.РегламентнаяОперация.ФормаСписка";
	ПараметрыОткрытия.Уникальность = "ФормаСписка_ПризнаниеВНУАрендныхПлатежей";

	Отбор = Новый Структура("ВидОперации",
		ПредопределенноеЗначение("Перечисление.ВидыРегламентныхОпераций.ПризнаниеВНУАрендныхПлатежей"));
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	
	ОбщегоНазначенияБПКлиент.ОткрытьФормуСОжиданием(ПараметрыОткрытия, ПараметрыФормы);

КонецПроцедуры
