#Область ПрограммныйИнтерфейс

// Возвращает структуру с информацией о сервисе по открытие счета.
//
// Параметры:
//	СервисОбменаСБанками - ПеречислениеСсылка.СервисыОбменаСБанками - Сервис.
// 
// Возвращаемое значение:
//	Структура - см. УниверсальныйОбменСБанками.СведенияОСервисе().
//
Функция СведенияОСервисе(СервисОбменаСБанками) Экспорт

	Возврат УниверсальныйОбменСБанками.СведенияОСервисе(СервисОбменаСБанками);

КонецФункции

// Получает массив непрочитанных сообщений от банков по заявкам на открытие счета текущего пользователя
//
// Параметры:
//  ПовторятьЗапрос - Булево - определяет, нужно ли позже вызвать функцию еще раз 
// 
// Возвращаемое значение:
//   - Массив - массив структур, содержащих описание нового состояния заявки на открытие счета
//
Функция НовыеСообщенияОтБанков(ПовторятьЗапрос) Экспорт

	Возврат РегистрыСведений.СостояниеЗаявокНаОткрытиеСчета.НовыеСообщенияОтБанков(ПовторятьЗапрос);

КонецФункции

// Получает массив непрочитанных сообщений от банков по заявкам на открытие счета текущего пользователя
// по типу Счет открыт
// Параметры:
//  ПовторятьЗапрос - Булево - определяет, нужно ли позже вызвать функцию еще раз 
// 
// Возвращаемое значение:
//   - Массив - массив структур, содержащих описание нового состояния заявки на открытие счета
//
Функция НовыеСообщенияОтБанковОбОткрытии(ПовторятьЗапрос) Экспорт

	Возврат РегистрыСведений.СостояниеЗаявокНаОткрытиеСчета.НовыеСообщенияОтБанковОбОткрытии(ПовторятьЗапрос);

КонецФункции

// Возвращает ключ записи регистра сведений СостояниеЗаявокНаОткрытиеСчета
//
// Параметры:
//  ЗначенияКлюча - Структура - структура со свойствами:
//									- ЗаявкаНаОткрытиеСчета
//									- Организация
//									- Банк
// 
// Возвращаемое значение:
//   - РегистрСведенийКлючЗаписи.СостояниеЗаявокНаОткрытиеСчета
//
Функция КлючЗаписиСостоянияЗаявки(ЗначенияКлюча) Экспорт

	Возврат РегистрыСведений.СостояниеЗаявокНаОткрытиеСчета.СоздатьКлючЗаписи(ЗначенияКлюча);

КонецФункции

// Создает новые банковские счета по непрочитанным сообщениям от банков 
// по заявкам на открытие счета текущего пользователя по типу Счет открыт
// 
// Возвращаемое значение:
//   - Булево - Истина - создан счет
//
Функция СозданыСчетаПоНовымСообщениямОбОткрытии(МассивСообщений) Экспорт

	Возврат РегистрыСведений.СостояниеЗаявокНаОткрытиеСчета.СозданыСчетаПоНовымСообщениямОбОткрытии(МассивСообщений);

КонецФункции

// Устанавливает ресурс Новое регистра сведений СостояниеЗаявокНаОткрытиеСчета  
// по заявкам на открытие счета текущего пользователя по типу Счет открыт
// 
// Возвращаемое значение:
//   - Булево - Истина - успешно установлено значение ресурса Новое = Ложь
//
Функция ПрочитаныНовыеСообщенияОбОткрытии() Экспорт

	Возврат РегистрыСведений.СостояниеЗаявокНаОткрытиеСчета.ПрочитаныНовыеСообщенияОбОткрытии();

КонецФункции

// Возвращает текст пути к интерфейсу
//
// Возвращаемое значение:    
// - Строка - текст к пути в интерфейсе
//
Функция ПутьВИнтерфейсеКСпискуЗаявок() Экспорт

	Если ПолучитьФункциональнуюОпцию("ИнтерфейсТаксиПростой") Тогда
		Возврат НСтр("ru = '""Деньги - Финансы - 1С:Открытие счета""'");
	Иначе	
		Возврат НСтр("ru = '""Банк и касса - Финансы - 1С:Открытие счета""'");
	КонецЕсли;

КонецФункции

#КонецОбласти
