#Область СлужебныйПрограммныйИнтерфейс

Функция ГрупповаяЕдиницаВозможна(ГруппаОС) Экспорт
	
	Исключения = Новый Массив;
	Исключения.Добавить(ПредопределенноеЗначение("Перечисление.ГруппыОС.Здания"));
	Исключения.Добавить(ПредопределенноеЗначение("Перечисление.ГруппыОС.Сооружения"));
	Исключения.Добавить(ПредопределенноеЗначение("Перечисление.ГруппыОС.ТранспортныеСредства"));
	Исключения.Добавить(ПредопределенноеЗначение("Перечисление.ГруппыОС.ЗемельныеУчастки"));
	Исключения.Добавить(ПредопределенноеЗначение("Перечисление.ГруппыОС.ОбъектыПриродопользования"));
	
	Возврат Исключения.Найти(ГруппаОС) = Неопределено;
	
КонецФункции

#КонецОбласти