Функция Существует(Организация, Период, ВыводитьСообщениеОбОтсутствииУчетнойПолитики = Ложь, ДокументСсылка = Неопределено) Экспорт

	Возврат Истина;

КонецФункции

Функция ПлательщикНалогаНаПрибыль(Организация, Период) Экспорт

	Результат = ПолучитьФункциональнуюОпцию("ПлательщикНалогаНаПрибыль", 
		Новый Структура("Организация, Период", Организация, НачалоМесяца(Период)));
	
	Возврат Результат;

КонецФункции 

Функция ПоддержкаПБУ18(Организация, Период) Экспорт

	Результат = ПолучитьФункциональнуюОпцию("ПоддержкаПБУ18", 
		Новый Структура("Организация, Период", Организация, НачалоМесяца(Период)));
	
	Возврат Результат;

КонецФункции 

Функция МетодНачисленияАмортизацииНУ(Организация, Период) Экспорт
	
	Возврат Перечисления.МетодыНачисленияАмортизации.Линейный;
	
КонецФункции

// Параметры учетной политики по НДС

Функция ПлательщикНДС(Организация, Период) Экспорт

	Возврат Истина;

КонецФункции 

Функция ПрименяетсяОсвобождениеОтУплатыНДС(Организация, Период) Экспорт

	Возврат Ложь;

КонецФункции

Функция Учитывать5ПроцентныйПорог(Организация, Период) Экспорт

	Возврат Ложь;

КонецФункции

// Параметры учетной политики по ЕНВД

Функция ПлательщикЕНВД(Организация, Период) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	УчетнаяПолитикаОрганизации.ПлательщикЕНВД КАК ПлательщикЕНВД
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(&Период, Организация = &Организация) КАК УчетнаяПолитикаОрганизации");
	
	Запрос.УстановитьПараметр("Период",      Период);
	Запрос.УстановитьПараметр("Организация", Организация);

	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Возврат РезультатЗапроса.Выгрузить()[0].ПлательщикЕНВД;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции 

// Определяет, являлась ли организация плательщиком единого налога на вмененный доход (ЕНВД) в течении указанного периода.
//
// Параметры:
//	Организация - СправочникСсылка.Организация - организация, для которой определяется применение ЕНВД;
//	НачалоПериода - Дата - начало периода, для которого определяется применение организацией ЕНВД;
//	КонецПериода - Дата - конец периода, для которого определяется применение организацией ЕНВД.
//
// Возвращаемое значение:
//	Булево - Истина, если организация в течении указанного периода являлась плательщиком ЕНВД (хотя бы раз). В противном случае - ложь.
//
Функция ПлательщикЕНВДЗаПериод(Организация, НачалоПериода, КонецПериода) Экспорт

	МассивЗначений = ЗначенияРесурсаУчетнойПолитикиЗаПериод(
		"ПлательщикЕНВД", Организация, НачалоПериода, КонецПериода);
	
	Результат = Ложь;
	Для Каждого Значение Из МассивЗначений Цикл
		Результат = Результат ИЛИ Значение;
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

// Параметры учетной политики по УСН

Функция ПрименяетсяУСНДоходыМинусРасходы(Организация, Период) Экспорт

	Возврат Ложь; // На текущий момент поддерживается только УСН (доходы)
	
КонецФункции 

Функция ПрименяетсяУСНДоходы(Организация, Период) Экспорт

	Если ПрименяетсяУСН(Организация, Период) Тогда
		Возврат Истина; // По умолчанию УСН (доходы)
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции 

Функция ПрименяетсяУСН(Организация, Период) Экспорт

	Возврат Ложь;

КонецФункции 

Функция СтавкаНалогаУСН(Организация, Период) Экспорт

	Если ПрименяетсяУСН(Организация, Период) Тогда
		Возврат 6; // по умолчанию УСН (доходы)
	Иначе
		Возврат 0;
	КонецЕсли;

КонецФункции

// Возвращает объект налогообложения который используется для организации на упрощенной системе налогообложения.
// Параметры:
//	Организация - СправочникСсылка.Организация - организация, из учетной политики которой берется требуемое значение;
//	Период - Дата - дата, на которую анализируется учетная политика организации.
//
// Возвращаемое значение:
//	ПеречислениеСсылка.ОбъектыНалогообложенияПоУСН - объект налогообложения, указанный для учетной политики организации на переданную дату.
//
Функция ОбъектНалогообложенияУСН(Организация, Период) Экспорт

	Если ПрименяетсяУСНДоходыМинусРасходы(Организация, Период) Тогда
		Возврат Перечисления.ОбъектыНалогообложенияПоУСН.ДоходыМинусРасходы;
	Иначе
		Возврат Перечисления.ОбъектыНалогообложенияПоУСН.Доходы;
	КонецЕсли;

КонецФункции 

// Прочие параметры учетной политики

Функция СистемаНалогообложения(Организация, Период) Экспорт

	Возврат Перечисления.СистемыНалогообложения.Общая;

КонецФункции 

Функция БазаРаспределенияКосвенныхРасходовПоВидамДеятельности(Организация, Период) Экспорт
	
	// В БРУ не используется.
	Возврат Неопределено;
	
КонецФункции

// Параметры учетной политики по резервам по сомнительным долгам

Функция ФормироватьРезервыПоСомнительнымДолгамБУ(Организация, Период) Экспорт

	Возврат Ложь;

КонецФункции 

Функция ФормироватьРезервыПоСомнительнымДолгамНУ(Организация, Период) Экспорт

	Возврат Ложь;

КонецФункции 

// Параметры учетной политики по торговому сбору

Функция ПлательщикТорговогоСбора(Организация, Период) Экспорт

	Возврат ТорговыйСбор.ИспользуютсяТорговыеТочки(Организация, Период);

КонецФункции

Функция ПлательщикТорговогоСбораЗаПериод(Организация, НачалоПериода, КонецПериода) Экспорт

	Возврат ТорговыйСбор.ИспользуютсяТорговыеТочкиЗаПериод(Организация, НачалоПериода, КонецПериода);

КонецФункции

Функция ТекстЗапросаУчетнойПолитикиПоПериодам()Экспорт
	
	Возврат "ВЫБРАТЬ
	|	УчетнаяПолитикаОрганизаций.Организация,
	|	УчетнаяПолитикаОрганизаций.Период КАК Период
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизаций
	|ГДЕ
	|	УчетнаяПолитикаОрганизаций.Организация = &Организация
	|	И УчетнаяПолитикаОрганизаций.Период < &КонецПериода";
	
КонецФункции

// Определяет, применялся ли для организации признак, указанный в первом параметре, в течении указанного периода.
//
// Параметры:
//	ИмяРесурса - Строка - имя ресурса регистра сведений "УчетныеПолитикиОрганизаций" с типом "Булево";
//	Организация - СправочникСсылка.Организация - организация, для которой определяется значение ресурса;
//	НачалоПериода - Дата - начало периода, для которого определяется значение ресурса;
//	КонецПериода - Дата - конец периода, для которого определяется значение ресурса.
//
// Возвращаемое значение:
//	Булево - Истина, если для организации в течении указанного периода, значение ресурса хотя бы раз принимало значение "Истина". В противном случае - ложь.
//
Функция ЗначенияРесурсаУчетнойПолитикиЗаПериод(ИмяРесурса, Организация, НачалоПериода, ОкончаниеПериода) Экспорт
	
	СледующийМесяц = НачалоМесяца(ДобавитьМесяц(НачалоПериода, 1));
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",      Организация);
	Запрос.УстановитьПараметр("НачалоПериода",    НачалоМесяца(НачалоПериода));
	Запрос.УстановитьПараметр("СледующийМесяц",   СледующийМесяц);
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецМесяца(ОкончаниеПериода));
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	УчетнаяПолитикаОрганизацийСрезПоследних.СистемаНалогообложения КАК Значение
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(&НачалоПериода, Организация = &Организация) КАК УчетнаяПолитикаОрганизацийСрезПоследних";
	
	Если СледующийМесяц < КонецМесяца(ОкончаниеПериода) Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|"+
		"ВЫБРАТЬ
		|	УчетнаяПолитикаОрганизаций.СистемаНалогообложения
		|ИЗ
		|	РегистрСведений.УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизаций
		|ГДЕ
		|	УчетнаяПолитикаОрганизаций.Организация = &Организация
		|	И УчетнаяПолитикаОрганизаций.Период МЕЖДУ &СледующийМесяц И &ОкончаниеПериода";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СистемаНалогообложения", ИмяРесурса);
	
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Значение");
	
	Возврат Результат;
	
КонецФункции
