#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Значение И Не ТарификацияБП.РазрешеноЮридическоеЛицо() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Значение Тогда 
		Справочники.СтатьиДвиженияДенежныхСредств.СоздатьУстановитьПредопределенныеЭлементыРасчетыСУчредителями();
	КонецЕсли;
	
	УставныйКапитал.УстановитьВидимостьКомандУставногоКапитала(Значение);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли