
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает основные реквизиты юридического лица по данным ЕГРЮЛ.по ИНН
//
// Параметры:
//  ИННОбъекта - Строка - строка содержит ИНН контрагента
//  ЭтоЮрЛицо  - Булево - признак того, что контрагент является юридическим лицом
//
// Возвращаемое значение:
//  Структура:
//    * АдресРеквизитовКонтрагента - Строка - содержит адрес временного хранилища с регистрационными даннми контрагента.
//    * НаименованиеКонтрагента    - Строка - содержит наименование контрагента.
//    * ОписаниеОшибки - Строка - содержит текст ошибки, возникшей при получении данных.
//    * ЮридическоеФизическоеЛицо - ПеречислениеСсылка.ЮридическоеФизическоеЛицо - вид контрагента.
//
Функция ДанныеЕдиныхГосРеестровПоИНН(ИННОбъекта, ЭтоЮрЛицо) Экспорт
	
	Возврат КонтрагентыФормы.ДанныеЕдиныхГосРеестровПоИНН(ИННОбъекта, ЭтоЮрЛицо);
	
КонецФункции

// Возвращает результат проверки на дубли контрагента
//
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты - ссылка на проверяемого контрагента
//
// Возвращаемое значение:
//  Булево
//
Функция ПроверитьДубли(Знач Контрагент) Экспорт
	
	Возврат КонтрагентыФормы.ПроверитьДубли(Контрагент);
	
КонецФункции

// Возвращает результат блокировки для редактирования банковского счета
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма.
//
// Возвращаемое значение:
//  Булево
//
Функция ЗаблокироватьБанковскийСчетПриРедактированииНаСервере(Ссылка, ВерсияДанных, УникальныйИдентификатор) Экспорт
	
	Попытка
		ЗаблокироватьДанныеДляРедактирования(Ссылка, ВерсияДанных, УникальныйИдентификатор);
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

#КонецОбласти