#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВремяДокументаПоУмолчанию() Экспорт
	
	Возврат Новый Структура("Часы, Минуты", 19, 0);
	
КонецФункции

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция ТекстЗапросаСчетФактураВыданныйНалоговыйАгентРасшифровкаПлатежа(НомераТаблиц) Экспорт
	
	НомераТаблиц.Вставить("ВТ_РасшифровкаПлатежа", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДебиторскаяЗадолженность.Ссылка.Организация КАК Организация,
	|	ДебиторскаяЗадолженность.Ссылка.КонтрагентКредитор КАК Контрагент,
	|	ДебиторскаяЗадолженность.КорДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДебиторскаяЗадолженность.КорДоговорКонтрагента.НаименованиеДляСчетаФактурыНаАванс КАК Номенклатура,
	|	ДебиторскаяЗадолженность.Ссылка.Дата КАК Дата,
	|	ДебиторскаяЗадолженность.Ссылка КАК ДокументОснование,
	|	ДебиторскаяЗадолженность.КорСчетУчетаРасчетов КАК СчетАвансов,
	|	СУММА(ДебиторскаяЗадолженность.СуммаВзаиморасчетов) КАК СуммаБезНДС
	|ПОМЕСТИТЬ РасшифровкаПлатежа
	|ИЗ
	|	Документ.КорректировкаДолга.ДебиторскаяЗадолженность КАК ДебиторскаяЗадолженность
	|ГДЕ
	|	ДебиторскаяЗадолженность.Ссылка = &ДокументОснование
	|	И ДебиторскаяЗадолженность.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.ПереносЗадолженности)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДебиторскаяЗадолженность.Ссылка.Организация,
	|	ДебиторскаяЗадолженность.Ссылка.КонтрагентКредитор,
	|	ДебиторскаяЗадолженность.КорДоговорКонтрагента,
	|	ДебиторскаяЗадолженность.Ссылка.Дата,
	|	ДебиторскаяЗадолженность.Ссылка,
	|	ДебиторскаяЗадолженность.КорСчетУчетаРасчетов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДебиторскаяЗадолженность.Ссылка.Организация,
	|	ВЫБОР
	|		КОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт1 ССЫЛКА Справочник.Контрагенты
	|			ТОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт1
	|		КОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт2 ССЫЛКА Справочник.Контрагенты
	|			ТОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт2
	|		КОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт3 ССЫЛКА Справочник.Контрагенты
	|			ТОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт1 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт1
	|		КОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт2 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт2
	|		КОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт3 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт1 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт1.НаименованиеДляСчетаФактурыНаАванс
	|		КОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт2 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт2.НаименованиеДляСчетаФактурыНаАванс
	|		КОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт3 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт3.НаименованиеДляСчетаФактурыНаАванс
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ,
	|	ДебиторскаяЗадолженность.Ссылка.Дата,
	|	ДебиторскаяЗадолженность.Ссылка,
	|	ДебиторскаяЗадолженность.Ссылка.СчетДт,
	|	СУММА(ДебиторскаяЗадолженность.СуммаВзаиморасчетов)
	|ИЗ
	|	Документ.КорректировкаДолга.ДебиторскаяЗадолженность КАК ДебиторскаяЗадолженность
	|ГДЕ
	|	ДебиторскаяЗадолженность.Ссылка = &ДокументОснование
	|	И ДебиторскаяЗадолженность.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|	И ВЫБОР
	|			КОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт1 ССЫЛКА Справочник.Контрагенты
	|				ТОГДА ИСТИНА
	|			КОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт2 ССЫЛКА Справочник.Контрагенты
	|				ТОГДА ИСТИНА
	|			КОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт3 ССЫЛКА Справочник.Контрагенты
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт1 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|				ТОГДА ИСТИНА
	|			КОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт2 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|				ТОГДА ИСТИНА
	|			КОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт3 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ДебиторскаяЗадолженность.Ссылка.Организация,
	|	ДебиторскаяЗадолженность.Ссылка.КонтрагентКредитор,
	|	ДебиторскаяЗадолженность.КорДоговорКонтрагента,
	|	ДебиторскаяЗадолженность.Ссылка.Дата,
	|	ДебиторскаяЗадолженность.Ссылка,
	|	ДебиторскаяЗадолженность.КорСчетУчетаРасчетов,
	|	ДебиторскаяЗадолженность.Ссылка.СчетДт,
	|	ВЫБОР
	|		КОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт1 ССЫЛКА Справочник.Контрагенты
	|			ТОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт1
	|		КОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт2 ССЫЛКА Справочник.Контрагенты
	|			ТОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт2
	|		КОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт3 ССЫЛКА Справочник.Контрагенты
	|			ТОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт1 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт1
	|		КОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт2 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт2
	|		КОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт3 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт1 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт1.НаименованиеДляСчетаФактурыНаАванс
	|		КОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт2 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт2.НаименованиеДляСчетаФактурыНаАванс
	|		КОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт3 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт3.НаименованиеДляСчетаФактурыНаАванс
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаСчетФактураВыданныйНаАвансРасшифровкаПлатежа(НомераТаблиц) Экспорт
	
	НомераТаблиц.Вставить("ВТ_РасшифровкаПлатежа", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	&РасчетнаяСтавкаНДСПоУмолчанию КАК СтавкаНДС,
	|	КредиторскаяЗадолженность.КорДоговорКонтрагента КАК ДоговорКонтрагента,
	|	"""" КАК ИдентификаторГосКонтракта,
	|	КредиторскаяЗадолженность.КорДоговорКонтрагента.НаименованиеДляСчетаФактурыНаАванс КАК Номенклатура,
	|	СУММА(КредиторскаяЗадолженность.СуммаВзаиморасчетов) КАК Сумма,
	|	КредиторскаяЗадолженность.Ссылка.КонтрагентКредитор КАК Контрагент,
	|	КредиторскаяЗадолженность.Ссылка.Дата КАК Дата,
	|	КредиторскаяЗадолженность.Ссылка.Организация КАК Организация,
	|	КредиторскаяЗадолженность.Ссылка КАК ДокументОснование,
	|	КредиторскаяЗадолженность.КорСчетУчетаРасчетов КАК СчетАвансов,
	|	ЗНАЧЕНИЕ(Документ.СчетНаОплатуПокупателю.ПустаяСсылка) КАК СчетНаОплату,
	|	ЗНАЧЕНИЕ(Перечисление.СпособыПогашенияЗадолженности.ПустаяСсылка) КАК СпособПогашенияЗадолженности
	|ПОМЕСТИТЬ РасшифровкаПлатежа
	|ИЗ
	|	Документ.КорректировкаДолга.КредиторскаяЗадолженность КАК КредиторскаяЗадолженность
	|ГДЕ
	|	КредиторскаяЗадолженность.Ссылка = &ДокументОснование
	|	И КредиторскаяЗадолженность.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.ПереносЗадолженности)
	|
	|СГРУППИРОВАТЬ ПО
	|	КредиторскаяЗадолженность.КорДоговорКонтрагента,
	|	КредиторскаяЗадолженность.Ссылка.КонтрагентКредитор,
	|	КредиторскаяЗадолженность.Ссылка.Дата,
	|	КредиторскаяЗадолженность.Ссылка.Организация,
	|	КредиторскаяЗадолженность.Ссылка,
	|	КредиторскаяЗадолженность.КорСчетУчетаРасчетов,
	|	КредиторскаяЗадолженность.КорДоговорКонтрагента.НаименованиеДляСчетаФактурыНаАванс
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&РасчетнаяСтавкаНДСПоУмолчанию,
	|	ВЫБОР
	|		КОГДА КредиторскаяЗадолженность.Ссылка.СубконтоКт1 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА КредиторскаяЗадолженность.Ссылка.СубконтоКт1
	|		КОГДА КредиторскаяЗадолженность.Ссылка.СубконтоКт2 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА КредиторскаяЗадолженность.Ссылка.СубконтоКт2
	|		КОГДА КредиторскаяЗадолженность.Ссылка.СубконтоКт3 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА КредиторскаяЗадолженность.Ссылка.СубконтоКт3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ,
	|	"""",
	|	ВЫБОР
	|		КОГДА КредиторскаяЗадолженность.Ссылка.СубконтоКт1 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА КредиторскаяЗадолженность.Ссылка.СубконтоКт1.НаименованиеДляСчетаФактурыНаАванс
	|		КОГДА КредиторскаяЗадолженность.Ссылка.СубконтоКт2 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА КредиторскаяЗадолженность.Ссылка.СубконтоКт2.НаименованиеДляСчетаФактурыНаАванс
	|		КОГДА КредиторскаяЗадолженность.Ссылка.СубконтоКт3 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА КредиторскаяЗадолженность.Ссылка.СубконтоКт3.НаименованиеДляСчетаФактурыНаАванс
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ,
	|	СУММА(КредиторскаяЗадолженность.СуммаВзаиморасчетов),
	|	ВЫБОР
	|		КОГДА КредиторскаяЗадолженность.Ссылка.СубконтоКт1 ССЫЛКА Справочник.Контрагенты
	|			ТОГДА КредиторскаяЗадолженность.Ссылка.СубконтоКт1
	|		КОГДА КредиторскаяЗадолженность.Ссылка.СубконтоКт2 ССЫЛКА Справочник.Контрагенты
	|			ТОГДА КредиторскаяЗадолженность.Ссылка.СубконтоКт2
	|		КОГДА КредиторскаяЗадолженность.Ссылка.СубконтоКт3 ССЫЛКА Справочник.Контрагенты
	|			ТОГДА КредиторскаяЗадолженность.Ссылка.СубконтоКт3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ,
	|	КредиторскаяЗадолженность.Ссылка.Дата,
	|	КредиторскаяЗадолженность.Ссылка.Организация,
	|	КредиторскаяЗадолженность.Ссылка,
	|	КредиторскаяЗадолженность.Ссылка.СчетКт,
	|	ЗНАЧЕНИЕ(Документ.СчетНаОплатуПокупателю.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Перечисление.СпособыПогашенияЗадолженности.ПустаяСсылка)
	|ИЗ
	|	Документ.КорректировкаДолга.КредиторскаяЗадолженность КАК КредиторскаяЗадолженность
	|ГДЕ
	|	КредиторскаяЗадолженность.Ссылка = &ДокументОснование
	|	И КредиторскаяЗадолженность.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|	И ВЫБОР
	|			КОГДА КредиторскаяЗадолженность.Ссылка.СубконтоКт1 ССЫЛКА Справочник.Контрагенты
	|				ТОГДА ИСТИНА
	|			КОГДА КредиторскаяЗадолженность.Ссылка.СубконтоКт2 ССЫЛКА Справочник.Контрагенты
	|				ТОГДА ИСТИНА
	|			КОГДА КредиторскаяЗадолженность.Ссылка.СубконтоКт3 ССЫЛКА Справочник.Контрагенты
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА КредиторскаяЗадолженность.Ссылка.СубконтоКт1 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|				ТОГДА ИСТИНА
	|			КОГДА КредиторскаяЗадолженность.Ссылка.СубконтоКт2 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|				ТОГДА ИСТИНА
	|			КОГДА КредиторскаяЗадолженность.Ссылка.СубконтоКт3 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА КредиторскаяЗадолженность.Ссылка.СубконтоКт1 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА КредиторскаяЗадолженность.Ссылка.СубконтоКт1
	|		КОГДА КредиторскаяЗадолженность.Ссылка.СубконтоКт2 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА КредиторскаяЗадолженность.Ссылка.СубконтоКт2
	|		КОГДА КредиторскаяЗадолженность.Ссылка.СубконтоКт3 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА КредиторскаяЗадолженность.Ссылка.СубконтоКт3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КредиторскаяЗадолженность.Ссылка.СубконтоКт1 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА КредиторскаяЗадолженность.Ссылка.СубконтоКт1.НаименованиеДляСчетаФактурыНаАванс
	|		КОГДА КредиторскаяЗадолженность.Ссылка.СубконтоКт2 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА КредиторскаяЗадолженность.Ссылка.СубконтоКт2.НаименованиеДляСчетаФактурыНаАванс
	|		КОГДА КредиторскаяЗадолженность.Ссылка.СубконтоКт3 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА КредиторскаяЗадолженность.Ссылка.СубконтоКт3.НаименованиеДляСчетаФактурыНаАванс
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КредиторскаяЗадолженность.Ссылка.СубконтоКт1 ССЫЛКА Справочник.Контрагенты
	|			ТОГДА КредиторскаяЗадолженность.Ссылка.СубконтоКт1
	|		КОГДА КредиторскаяЗадолженность.Ссылка.СубконтоКт2 ССЫЛКА Справочник.Контрагенты
	|			ТОГДА КредиторскаяЗадолженность.Ссылка.СубконтоКт2
	|		КОГДА КредиторскаяЗадолженность.Ссылка.СубконтоКт3 ССЫЛКА Справочник.Контрагенты
	|			ТОГДА КредиторскаяЗадолженность.Ссылка.СубконтоКт3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ,
	|	КредиторскаяЗадолженность.Ссылка.Дата,
	|	КредиторскаяЗадолженность.Ссылка.Организация,
	|	КредиторскаяЗадолженность.Ссылка,
	|	КредиторскаяЗадолженность.Ссылка.СчетКт";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаСчетФактураПолученныйНаАвансРасшифровкаПлатежа(НомераТаблиц) Экспорт
	
	НомераТаблиц.Вставить("ВТ_РасшифровкаПлатежа", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	&РасчетнаяСтавкаНДСПоУмолчанию КАК СтавкаНДС,
	|	ДебиторскаяЗадолженность.КорДоговорКонтрагента КАК ДоговорКонтрагента,
	|	СУММА(ДебиторскаяЗадолженность.СуммаВзаиморасчетов) КАК Сумма,
	|	СУММА(ДебиторскаяЗадолженность.СуммаВзаиморасчетов * &ЗначениеСтавкиНДС / (100 + &ЗначениеСтавкиНДС)) КАК СуммаНДС,
	|	ДебиторскаяЗадолженность.Ссылка.КонтрагентКредитор КАК Контрагент,
	|	ДебиторскаяЗадолженность.Ссылка.Дата КАК Дата,
	|	ДебиторскаяЗадолженность.Ссылка.Организация КАК Организация,
	|	ДебиторскаяЗадолженность.Ссылка КАК ДокументОснование,
	|	ДебиторскаяЗадолженность.КорСчетУчетаРасчетов КАК СчетАвансов
	|ПОМЕСТИТЬ РасшифровкаПлатежа
	|ИЗ
	|	Документ.КорректировкаДолга.ДебиторскаяЗадолженность КАК ДебиторскаяЗадолженность
	|ГДЕ
	|	ДебиторскаяЗадолженность.Ссылка = &ДокументОснование
	|	И ДебиторскаяЗадолженность.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.ПереносЗадолженности)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДебиторскаяЗадолженность.КорДоговорКонтрагента,
	|	ДебиторскаяЗадолженность.Ссылка.КонтрагентКредитор,
	|	ДебиторскаяЗадолженность.Ссылка.Дата,
	|	ДебиторскаяЗадолженность.Ссылка.Организация,
	|	ДебиторскаяЗадолженность.Ссылка,
	|	ДебиторскаяЗадолженность.КорСчетУчетаРасчетов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&РасчетнаяСтавкаНДСПоУмолчанию,
	|	ВЫБОР
	|		КОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт1 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт1
	|		КОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт2 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт2
	|		КОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт3 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ,
	|	СУММА(ДебиторскаяЗадолженность.СуммаВзаиморасчетов),
	|	СУММА(ДебиторскаяЗадолженность.СуммаВзаиморасчетов * &ЗначениеСтавкиНДС / (100 + &ЗначениеСтавкиНДС)),
	|	ВЫБОР
	|		КОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт1 ССЫЛКА Справочник.Контрагенты
	|			ТОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт1
	|		КОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт2 ССЫЛКА Справочник.Контрагенты
	|			ТОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт2
	|		КОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт3 ССЫЛКА Справочник.Контрагенты
	|			ТОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ,
	|	ДебиторскаяЗадолженность.Ссылка.Дата,
	|	ДебиторскаяЗадолженность.Ссылка.Организация,
	|	ДебиторскаяЗадолженность.Ссылка,
	|	ДебиторскаяЗадолженность.Ссылка.СчетКт
	|ИЗ
	|	Документ.КорректировкаДолга.ДебиторскаяЗадолженность КАК ДебиторскаяЗадолженность
	|ГДЕ
	|	ДебиторскаяЗадолженность.Ссылка = &ДокументОснование
	|	И ДебиторскаяЗадолженность.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|	И ВЫБОР
	|			КОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт1 ССЫЛКА Справочник.Контрагенты
	|				ТОГДА ИСТИНА
	|			КОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт2 ССЫЛКА Справочник.Контрагенты
	|				ТОГДА ИСТИНА
	|			КОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт3 ССЫЛКА Справочник.Контрагенты
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт1 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|				ТОГДА ИСТИНА
	|			КОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт2 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|				ТОГДА ИСТИНА
	|			КОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт3 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт1 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт1
	|		КОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт2 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт2
	|		КОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт3 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт1 ССЫЛКА Справочник.Контрагенты
	|			ТОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт1
	|		КОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт2 ССЫЛКА Справочник.Контрагенты
	|			ТОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт2
	|		КОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт3 ССЫЛКА Справочник.Контрагенты
	|			ТОГДА ДебиторскаяЗадолженность.Ссылка.СубконтоДт3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ,
	|	ДебиторскаяЗадолженность.Ссылка.Дата,
	|	ДебиторскаяЗадолженность.Ссылка.Организация,
	|	ДебиторскаяЗадолженность.Ссылка,
	|	ДебиторскаяЗадолженность.Ссылка.СчетКт";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

//Процедуры обновления документов "Корректировка долга". В зависимости от выбранных 
//в табличных частях видов договор, заполненности табличных частей и реквизита ИспользоватьВспомогательныйСчет
//устанавливаются реквизиты ВидОперации, ВидАвансаЗадолженност, ТипАвансаЗадолженности и прочие,
//связанные с ними реквизиты таким образом, чтобы результат перепроведения документа остался прежним,
//т.е. таким, каким был до обновления.
Процедура КонвертацияДокументаКорректировкаДолгаПоМоделиМетаданныхРелиза3020ИСтарше(Объект) Экспорт
	
	ВидДоговораСПокупателем = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
	ВидДоговораСПоставщиком = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком;
	ВидДоговораПрочее       = Перечисления.ВидыДоговоровКонтрагентов.Прочее;
	
	СтруктураНовыхРеквизитовДокумента = Новый Структура;
	
	КоличествоДебиторки  = Объект.ДебиторскаяЗадолженность.Количество();
	КоличествоКредиторки = Объект.КредиторскаяЗадолженность.Количество();
	
	Если ЗначениеЗаполнено(Объект.УдалитьДоговорКонтрагента) Тогда
		СтруктураНовыхРеквизитовДокумента.Вставить("УдалитьДоговорКонтрагента", Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
	КонецЕсли;
	
	СтруктураНовыхРеквизитовДокумента.Вставить("ИспользоватьВспомогательныйСчет", Ложь);
		
	Если Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.УдалитьПроведениеВзаимозачета Тогда
		
		Если Объект.ИспользоватьВспомогательныйСчет Тогда
			
			СтруктураНовыхРеквизитовДокумента.Вставить("ВидОперации", Перечисления.ВидыОперацийКорректировкаДолга.Прочее);
			
			СтруктураНовыхРеквизитовДокумента.Вставить("СчетКт",      Объект.СчетДт);
			СтруктураНовыхРеквизитовДокумента.Вставить("СубконтоКт1", Объект.СубконтоДт1);
			СтруктураНовыхРеквизитовДокумента.Вставить("СубконтоКт2", Объект.СубконтоДт2);
			СтруктураНовыхРеквизитовДокумента.Вставить("СубконтоКт3", Объект.СубконтоДт3);
			
		Иначе
			
			ПризнакВидаОперацииПрочее = Ложь;
			
			ВидДоговораДебиторки = Неопределено;
			ВидДоговораКредиторки = Неопределено;
			
			МаксимальноеКоличество = Макс(КоличествоДебиторки, КоличествоКредиторки) - 1;
			
			Для Сч = 0 по МаксимальноеКоличество Цикл
				
				Если Сч <= (КоличествоДебиторки - 1) Тогда
					
					СтрокаДебиторки = Объект.ДебиторскаяЗадолженность[Сч];
					
					ВидДоговораДебиторкиТекущий = СтрокаДебиторки.ДоговорКонтрагента.ВидДоговора;
					
					Если ВидДоговораДебиторкиТекущий = ВидДоговораПрочее Тогда
						
						ПризнакВидаОперацииПрочее = Истина;
						Прервать;
						
					КонецЕсли;	
					
					Если ВидДоговораДебиторкиТекущий = ВидДоговораСПокупателем 
						или ВидДоговораДебиторкиТекущий = ВидДоговораСПоставщиком Тогда
						
						Если ВидДоговораДебиторки = Неопределено Тогда
							ВидДоговораДебиторки = ВидДоговораДебиторкиТекущий;
						Иначе
							
							Если ВидДоговораДебиторки <> ВидДоговораДебиторкиТекущий Тогда
								
								ПризнакВидаОперацииПрочее = Истина;
								Прервать;
								
							КонецЕсли;	
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
				Если Сч <= (КоличествоКредиторки - 1) Тогда
					
					СтрокаКредиторки = Объект.КредиторскаяЗадолженность[Сч];
					
					ВидДоговораКредиторкиТекущий = СтрокаКредиторки.ДоговорКонтрагента.ВидДоговора;
					
					Если ВидДоговораКредиторкиТекущий = ВидДоговораПрочее Тогда
						
						ПризнакВидаОперацииПрочее = Истина;
						Прервать;
						
					КонецЕсли;	
					
					Если ВидДоговораКредиторкиТекущий = ВидДоговораСПокупателем 
						или ВидДоговораКредиторкиТекущий = ВидДоговораСПоставщиком Тогда
						
						Если ВидДоговораКредиторки = Неопределено Тогда
							ВидДоговораКредиторки = ВидДоговораКредиторкиТекущий;
						Иначе
							
							Если ВидДоговораКредиторки <> ВидДоговораКредиторкиТекущий Тогда
								
								ПризнакВидаОперацииПрочее = Истина;
								Прервать;
								
							КонецЕсли;	
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если ПризнакВидаОперацииПрочее Тогда
				СтруктураНовыхРеквизитовДокумента.Вставить("ВидОперации", Перечисления.ВидыОперацийКорректировкаДолга.Прочее);
			Иначе
				
				Если НЕ ВидДоговораКредиторки = Неопределено и НЕ ВидДоговораДебиторки = Неопределено Тогда
					
					Если ВидДоговораКредиторки = ВидДоговораДебиторки Тогда
						
						Если ВидДоговораКредиторки = ВидДоговораСПокупателем Тогда
							
							СтруктураНовыхРеквизитовДокумента.Вставить("ВидОперации", Перечисления.ВидыОперацийКорректировкаДолга.ЗачетАвансов);
							СтруктураНовыхРеквизитовДокумента.Вставить("ВидАвансаЗадолженности", Перечисления.ВидыАвансаЗадолженности.АвансыПокупателя);
							
						Иначе
							
							СтруктураНовыхРеквизитовДокумента.Вставить("ВидОперации", Перечисления.ВидыОперацийКорректировкаДолга.ЗачетАвансов);
							СтруктураНовыхРеквизитовДокумента.Вставить("ВидАвансаЗадолженности", Перечисления.ВидыАвансаЗадолженности.АвансыПоставщику);
							
						КонецЕсли;	
						
						Если Объект.КонтрагентДебитор = Объект.КонтрагентКредитор Тогда
							СтруктураНовыхРеквизитовДокумента.Вставить("ТипАвансаЗадолженности", Перечисления.ТипыЗадолженности.СамогоКонтрагента);
						Иначе
							СтруктураНовыхРеквизитовДокумента.Вставить("ТипАвансаЗадолженности", Перечисления.ТипыЗадолженности.ТретьегоЛица);
						КонецЕсли;
						
					Иначе
						
						Если ВидДоговораКредиторки = ВидДоговораСПокупателем 
							и ВидДоговораДебиторки = ВидДоговораСПоставщиком Тогда
							СтруктураНовыхРеквизитовДокумента.Вставить("ВидОперации", Перечисления.ВидыОперацийКорректировкаДолга.Прочее);
						Иначе
							
							СтруктураНовыхРеквизитовДокумента.Вставить("ВидОперации", Перечисления.ВидыОперацийКорректировкаДолга.ЗачетЗадолженности);
							СтруктураНовыхРеквизитовДокумента.Вставить("ВидАвансаЗадолженности", Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПокупателя);
							
							Если Объект.КонтрагентДебитор = Объект.КонтрагентКредитор Тогда
								СтруктураНовыхРеквизитовДокумента.Вставить("ТипАвансаЗадолженности", Перечисления.ТипыЗадолженности.СамогоКонтрагента);
							Иначе
								СтруктураНовыхРеквизитовДокумента.Вставить("ТипАвансаЗадолженности", Перечисления.ТипыЗадолженности.ТретьегоЛица);
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
					
				Иначе
					
					Если НЕ ВидДоговораКредиторки = Неопределено 
						и ВидДоговораДебиторки = Неопределено Тогда
						
						Если ВидДоговораКредиторки = ВидДоговораСПокупателем Тогда
							
							СтруктураНовыхРеквизитовДокумента.Вставить("ВидОперации", Перечисления.ВидыОперацийКорректировкаДолга.ЗачетАвансов);
							СтруктураНовыхРеквизитовДокумента.Вставить("ВидАвансаЗадолженности", Перечисления.ВидыАвансаЗадолженности.АвансыПокупателя);
							
						Иначе
							
							СтруктураНовыхРеквизитовДокумента.Вставить("ВидОперации", Перечисления.ВидыОперацийКорректировкаДолга.ЗачетЗадолженности);
							СтруктураНовыхРеквизитовДокумента.Вставить("ВидАвансаЗадолженности", Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПоставщику);
							
						КонецЕсли;
						
						Если Объект.КонтрагентДебитор = Объект.КонтрагентКредитор Тогда
							СтруктураНовыхРеквизитовДокумента.Вставить("ТипАвансаЗадолженности", Перечисления.ТипыЗадолженности.СамогоКонтрагента);
						Иначе
							СтруктураНовыхРеквизитовДокумента.Вставить("ТипАвансаЗадолженности", Перечисления.ТипыЗадолженности.ТретьегоЛица);
						КонецЕсли;
						
					ИначеЕсли ВидДоговораКредиторки = Неопределено 
						и НЕ ВидДоговораДебиторки = Неопределено Тогда
						
						Если ВидДоговораДебиторки = ВидДоговораСПокупателем Тогда
							
							СтруктураНовыхРеквизитовДокумента.Вставить("ВидОперации", Перечисления.ВидыОперацийКорректировкаДолга.ЗачетЗадолженности);
							СтруктураНовыхРеквизитовДокумента.Вставить("ВидАвансаЗадолженности", Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПокупателя);
							
						Иначе
							
							СтруктураНовыхРеквизитовДокумента.Вставить("ВидОперации", Перечисления.ВидыОперацийКорректировкаДолга.ЗачетАвансов);
							СтруктураНовыхРеквизитовДокумента.Вставить("ВидАвансаЗадолженности", Перечисления.ВидыАвансаЗадолженности.АвансыПоставщику);
							
						КонецЕсли;
						
						Если Объект.КонтрагентДебитор = Объект.КонтрагентКредитор Тогда
							СтруктураНовыхРеквизитовДокумента.Вставить("ТипАвансаЗадолженности", Перечисления.ТипыЗадолженности.СамогоКонтрагента);
						Иначе
							СтруктураНовыхРеквизитовДокумента.Вставить("ТипАвансаЗадолженности", Перечисления.ТипыЗадолженности.ТретьегоЛица);
						КонецЕсли;
						
					Иначе
						
						СтруктураНовыхРеквизитовДокумента.Вставить("ВидОперации", Перечисления.ВидыОперацийКорректировкаДолга.ЗачетЗадолженности);
						СтруктураНовыхРеквизитовДокумента.Вставить("ВидАвансаЗадолженности", Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПокупателя);
						
						Если Объект.КонтрагентДебитор = Объект.КонтрагентКредитор Тогда
							СтруктураНовыхРеквизитовДокумента.Вставить("ТипАвансаЗадолженности", Перечисления.ТипыЗадолженности.СамогоКонтрагента);
						Иначе
							СтруктураНовыхРеквизитовДокумента.Вставить("ТипАвансаЗадолженности", Перечисления.ТипыЗадолженности.ТретьегоЛица);
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности Тогда
		
		ВидДоговораШапки = Объект.УдалитьДоговорКонтрагента.ВидДоговора;
		
		ВалютаДоговораШапки = Объект.УдалитьДоговорКонтрагента.ВалютаВзаиморасчетов;
		
		Если ВидДоговораШапки = ВидДоговораПрочее 
			или (ВалютаДоговораШапки <> Объект.ВалютаДокумента и НЕ Объект.УдалитьДоговорКонтрагента.РасчетыВУсловныхЕдиницах) Тогда
			
			СтруктураНовыхРеквизитовДокумента.Вставить("ВидОперации", Перечисления.ВидыОперацийКорректировкаДолга.Прочее);
			
			Если КоличествоДебиторки > 0 Тогда
				
				КоллекцияСубконтоСчета = Объект.СчетДт.ВидыСубконто;
				
				КоличествоСубконтоСчета = КоллекцияСубконтоСчета.Количество() - 1;
				
				Для Сч = 0 по КоличествоСубконтоСчета Цикл
					
					Если КоллекцияСубконтоСчета[Сч].ВидСубконто.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Контрагенты")) Тогда
						СтруктураНовыхРеквизитовДокумента.Вставить("СубконтоДт"+(Сч + 1), Объект.КонтрагентКредитор);
					ИначеЕсли КоллекцияСубконтоСчета[Сч].ВидСубконто.ТипЗначения.СодержитТип(Тип("СправочникСсылка.ДоговорыКонтрагентов")) Тогда
						СтруктураНовыхРеквизитовДокумента.Вставить("СубконтоДт"+(Сч + 1), Объект.УдалитьДоговорКонтрагента);
					КонецЕсли;
					
				КонецЦикла;
				
			Иначе
				
				СтруктураНовыхРеквизитовДокумента.Вставить("КонтрагентДебитор", Справочники.Контрагенты.ПустаяСсылка());
				СтруктураНовыхРеквизитовДокумента.Вставить("СчетДт", ПланыСчетов.Хозрасчетный.ПустаяСсылка());
				
			КонецЕсли;
			
			Если КоличествоКредиторки > 0 Тогда
				
				СтруктураНовыхРеквизитовДокумента.Вставить("КонтрагентКредитор", Объект.КонтрагентДебитор);
				
				КоллекцияСубконтоСчета = Объект.СчетКт.ВидыСубконто;
				
				КоличествоСубконтоСчета = КоллекцияСубконтоСчета.Количество() - 1;
				
				Для Сч = 0 по КоличествоСубконтоСчета Цикл
					
					Если КоллекцияСубконтоСчета[Сч].ВидСубконто.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Контрагенты")) Тогда
						СтруктураНовыхРеквизитовДокумента.Вставить("СубконтоКт"+(Сч + 1), Объект.КонтрагентКредитор);
					ИначеЕсли КоллекцияСубконтоСчета[Сч].ВидСубконто.ТипЗначения.СодержитТип(Тип("СправочникСсылка.ДоговорыКонтрагентов")) Тогда
						СтруктураНовыхРеквизитовДокумента.Вставить("СубконтоКт"+(Сч + 1), Объект.УдалитьДоговорКонтрагента);
					КонецЕсли;
					
				КонецЦикла;
				
			Иначе
				
				СтруктураНовыхРеквизитовДокумента.Вставить("КонтрагентКредитор", Справочники.Контрагенты.ПустаяСсылка());
				СтруктураНовыхРеквизитовДокумента.Вставить("СчетКт", ПланыСчетов.Хозрасчетный.ПустаяСсылка());
				
			КонецЕсли;
			
		Иначе	
			
			Если НЕ ВидДоговораШапки = ВидДоговораСПокупателем и НЕ ВидДоговораШапки = ВидДоговораСПоставщиком Тогда
				ВидДоговораШапки = Неопределено;
			КонецЕсли;	
			
			Если КоличествоКредиторки > 0 
				и КоличествоДебиторки > 0 Тогда
				
				СтруктураНовыхРеквизитовДокумента.Вставить("ВидОперации", Перечисления.ВидыОперацийКорректировкаДолга.Прочее);
				СтруктураНовыхРеквизитовДокумента.Вставить("КонтрагентКредитор", Объект.КонтрагентДебитор);
				
				КоллекцияСубконтоСчета = Объект.СчетДт.ВидыСубконто;
				
				КоличествоСубконтоСчета = КоллекцияСубконтоСчета.Количество() - 1;
				
				Для Сч = 0 по КоличествоСубконтоСчета Цикл
					
					Если КоллекцияСубконтоСчета[Сч].ВидСубконто.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Контрагенты")) Тогда
						СтруктураНовыхРеквизитовДокумента.Вставить("СубконтоДт"+(Сч + 1), Объект.КонтрагентКредитор);
					ИначеЕсли КоллекцияСубконтоСчета[Сч].ВидСубконто.ТипЗначения.СодержитТип(Тип("СправочникСсылка.ДоговорыКонтрагентов")) Тогда
						СтруктураНовыхРеквизитовДокумента.Вставить("СубконтоДт"+(Сч + 1), Объект.УдалитьДоговорКонтрагента);
					КонецЕсли;
					
				КонецЦикла;
				
				КоллекцияСубконтоСчета = Объект.СчетКт.ВидыСубконто;
				
				КоличествоСубконтоСчета = КоллекцияСубконтоСчета.Количество() - 1;
				
				Для Сч = 0 по КоличествоСубконтоСчета Цикл
					
					Если КоллекцияСубконтоСчета[Сч].ВидСубконто.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Контрагенты")) Тогда
						СтруктураНовыхРеквизитовДокумента.Вставить("СубконтоКт"+(Сч + 1), Объект.КонтрагентКредитор);
					ИначеЕсли КоллекцияСубконтоСчета[Сч].ВидСубконто.ТипЗначения.СодержитТип(Тип("СправочникСсылка.ДоговорыКонтрагентов")) Тогда
						СтруктураНовыхРеквизитовДокумента.Вставить("СубконтоКт"+(Сч + 1), Объект.УдалитьДоговорКонтрагента);
					КонецЕсли;
					
				КонецЦикла;
				
			Иначе 
				
				Если КоличествоКредиторки > 0 Тогда
					
					ПризнакВидаОперацииПрочее = Ложь;
					
					ВидДоговора    = Неопределено;
					
					МаксимальноеКоличество = КоличествоКредиторки - 1;
					
					Для Сч = 0 по МаксимальноеКоличество Цикл
						
						СтрокаТабличнойЧасти = Объект.КредиторскаяЗадолженность[Сч];
						
						ВидДоговораТекущий = СтрокаТабличнойЧасти.ДоговорКонтрагента.ВидДоговора;
						
						Если ВидДоговораТекущий = ВидДоговораПрочее Тогда
							
							ПризнакВидаОперацииПрочее = Истина;
							Прервать;
							
						КонецЕсли;	
						
						Если ВидДоговораТекущий = ВидДоговораСПокупателем 
							или ВидДоговораТекущий = ВидДоговораСПоставщиком Тогда
							
							Если ВидДоговора = Неопределено Тогда
								ВидДоговора = ВидДоговораТекущий;
							Иначе
								
								Если ВидДоговора <> ВидДоговораТекущий Тогда
									
									ПризнакВидаОперацииПрочее = Истина;
									Прервать;
									
								КонецЕсли;	
								
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЦикла;
					
					Если ПризнакВидаОперацииПрочее Тогда
						
						СтруктураНовыхРеквизитовДокумента.Вставить("ВидОперации", Перечисления.ВидыОперацийКорректировкаДолга.Прочее);
						СтруктураНовыхРеквизитовДокумента.Вставить("КонтрагентКредитор", Объект.КонтрагентДебитор);
						СтруктураНовыхРеквизитовДокумента.Вставить("СчетДт", ПланыСчетов.Хозрасчетный.ПустаяСсылка());
						СтруктураНовыхРеквизитовДокумента.Вставить("КонтрагентДебитор", Справочники.Контрагенты.ПустаяСсылка());
						
						КоллекцияСубконтоСчета = Объект.СчетКт.ВидыСубконто;
						
						КоличествоСубконтоСчета = КоллекцияСубконтоСчета.Количество() - 1;
						
						Для Сч = 0 по КоличествоСубконтоСчета Цикл
							
							Если КоллекцияСубконтоСчета[Сч].ВидСубконто.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Контрагенты")) Тогда
								СтруктураНовыхРеквизитовДокумента.Вставить("СубконтоКт"+(Сч + 1), Объект.КонтрагентКредитор);
							ИначеЕсли КоллекцияСубконтоСчета[Сч].ВидСубконто.ТипЗначения.СодержитТип(Тип("СправочникСсылка.ДоговорыКонтрагентов")) Тогда
								СтруктураНовыхРеквизитовДокумента.Вставить("СубконтоКт"+(Сч + 1), Объект.УдалитьДоговорКонтрагента);
							КонецЕсли;
							
						КонецЦикла;
						
					Иначе
						
						Если ВидДоговора <> ВидДоговораШапки  и НЕ ВидДоговораШапки = Неопределено Тогда
							
							СтруктураНовыхРеквизитовДокумента.Вставить("ВидОперации", Перечисления.ВидыОперацийКорректировкаДолга.Прочее);
							СтруктураНовыхРеквизитовДокумента.Вставить("КонтрагентКредитор", Объект.КонтрагентДебитор);
							СтруктураНовыхРеквизитовДокумента.Вставить("СчетДт", ПланыСчетов.Хозрасчетный.ПустаяСсылка());
							СтруктураНовыхРеквизитовДокумента.Вставить("КонтрагентДебитор", Справочники.Контрагенты.ПустаяСсылка());
							
							КоллекцияСубконтоСчета = Объект.СчетКт.ВидыСубконто;
							
							КоличествоСубконтоСчета = КоллекцияСубконтоСчета.Количество() - 1;
							
							Для Сч = 0 по КоличествоСубконтоСчета Цикл
								
								Если КоллекцияСубконтоСчета[Сч].ВидСубконто.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Контрагенты")) Тогда
									СтруктураНовыхРеквизитовДокумента.Вставить("СубконтоКт"+(Сч + 1), Объект.КонтрагентКредитор);
								ИначеЕсли КоллекцияСубконтоСчета[Сч].ВидСубконто.ТипЗначения.СодержитТип(Тип("СправочникСсылка.ДоговорыКонтрагентов")) Тогда
									СтруктураНовыхРеквизитовДокумента.Вставить("СубконтоКт"+(Сч + 1), Объект.УдалитьДоговорКонтрагента);
								КонецЕсли;
								
							КонецЦикла;
							
						Иначе	
							
							Если ВидДоговора = ВидДоговораСПокупателем Тогда
								
								СтруктураНовыхРеквизитовДокумента.Вставить("ВидАвансаЗадолженности", Перечисления.ВидыАвансаЗадолженности.АвансыПокупателя);
								
								СтруктураТабличнойЧасти = Новый Структура;
								
								СтруктураТабличнойЧасти.Вставить("КорДоговорКонтрагента", Объект.УдалитьДоговорКонтрагента);
								СтруктураТабличнойЧасти.Вставить("КорСчетУчетаРасчетов", Объект.СчетКт);
								
								СтруктураНовыхРеквизитовДокумента.Вставить("КредиторскаяЗадолженность", СтруктураТабличнойЧасти);
								
							ИначеЕсли ВидДоговора = ВидДоговораСПоставщиком Тогда
								
								СтруктураНовыхРеквизитовДокумента.Вставить("ВидАвансаЗадолженности", Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПоставщику);
								
								СтруктураТабличнойЧасти = Новый Структура;
								
								СтруктураТабличнойЧасти.Вставить("КорДоговорКонтрагента", Объект.УдалитьДоговорКонтрагента);
								СтруктураТабличнойЧасти.Вставить("КорСчетУчетаРасчетов", Объект.СчетКт);
								
								СтруктураНовыхРеквизитовДокумента.Вставить("КредиторскаяЗадолженность", СтруктураТабличнойЧасти);
								
							Иначе
								
								СтруктураНовыхРеквизитовДокумента.Вставить("ВидАвансаЗадолженности", Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПоставщику);
								
								СтруктураТабличнойЧасти = Новый Структура;
								
								СтруктураТабличнойЧасти.Вставить("КорДоговорКонтрагента", Объект.УдалитьДоговорКонтрагента);
								СтруктураТабличнойЧасти.Вставить("КорСчетУчетаРасчетов", Объект.СчетКт);
								
								СтруктураНовыхРеквизитовДокумента.Вставить("КредиторскаяЗадолженность", СтруктураТабличнойЧасти);
								
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
					
				Иначе
					
					ПризнакВидаОперацииПрочее = Ложь;
					
					ВидДоговора    = Неопределено;
					
					МаксимальноеКоличество = КоличествоДебиторки - 1;
					
					Для Сч = 0 по МаксимальноеКоличество Цикл
						
						СтрокаТабличнойЧасти = Объект.ДебиторскаяЗадолженность[Сч];
						
						ВидДоговораТекущий = СтрокаТабличнойЧасти.ДоговорКонтрагента.ВидДоговора;
						
						Если ВидДоговораТекущий = ВидДоговораПрочее Тогда
							
							ПризнакВидаОперацииПрочее = Истина;
							Прервать;
							
						КонецЕсли;	
						
						Если ВидДоговораТекущий = ВидДоговораСПокупателем 
							или ВидДоговораТекущий = ВидДоговораСПоставщиком Тогда
							
							Если ВидДоговора = Неопределено Тогда
								ВидДоговора = ВидДоговораТекущий;
							Иначе
								
								Если ВидДоговора <> ВидДоговораТекущий Тогда
									
									ПризнакВидаОперацииПрочее = Истина;
									Прервать;
									
								КонецЕсли;	
								
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЦикла;
					
					Если ПризнакВидаОперацииПрочее Тогда
						
						СтруктураНовыхРеквизитовДокумента.Вставить("ВидОперации", Перечисления.ВидыОперацийКорректировкаДолга.Прочее);
						СтруктураНовыхРеквизитовДокумента.Вставить("КонтрагентКредитор", Справочники.Контрагенты.ПустаяСсылка());
						СтруктураНовыхРеквизитовДокумента.Вставить("СчетКт", ПланыСчетов.Хозрасчетный.ПустаяСсылка());
						
						КоллекцияСубконтоСчета = Объект.СчетДт.ВидыСубконто;
						
						КоличествоСубконтоСчета = КоллекцияСубконтоСчета.Количество() - 1;
						
						Для Сч = 0 по КоличествоСубконтоСчета Цикл
							
							Если КоллекцияСубконтоСчета[Сч].ВидСубконто.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Контрагенты")) Тогда
								СтруктураНовыхРеквизитовДокумента.Вставить("СубконтоДт"+(Сч + 1), Объект.КонтрагентКредитор);
							ИначеЕсли КоллекцияСубконтоСчета[Сч].ВидСубконто.ТипЗначения.СодержитТип(Тип("СправочникСсылка.ДоговорыКонтрагентов")) Тогда
								СтруктураНовыхРеквизитовДокумента.Вставить("СубконтоДт"+(Сч + 1), Объект.УдалитьДоговорКонтрагента);
							КонецЕсли;
							
						КонецЦикла;
						
					Иначе
						
						Если ВидДоговора <> ВидДоговораШапки  и НЕ ВидДоговораШапки = Неопределено Тогда
							
							СтруктураНовыхРеквизитовДокумента.Вставить("ВидОперации", Перечисления.ВидыОперацийКорректировкаДолга.Прочее);
							СтруктураНовыхРеквизитовДокумента.Вставить("КонтрагентКредитор", Справочники.Контрагенты.ПустаяСсылка());
							СтруктураНовыхРеквизитовДокумента.Вставить("СчетКт", ПланыСчетов.Хозрасчетный.ПустаяСсылка());
							
							КоллекцияСубконтоСчета = Объект.СчетДт.ВидыСубконто;
							
							КоличествоСубконтоСчета = КоллекцияСубконтоСчета.Количество() - 1;
							
							Для Сч = 0 по КоличествоСубконтоСчета Цикл
								
								Если КоллекцияСубконтоСчета[Сч].ВидСубконто.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Контрагенты")) Тогда
									СтруктураНовыхРеквизитовДокумента.Вставить("СубконтоДт"+(Сч + 1), Объект.КонтрагентКредитор);
								ИначеЕсли КоллекцияСубконтоСчета[Сч].ВидСубконто.ТипЗначения.СодержитТип(Тип("СправочникСсылка.ДоговорыКонтрагентов")) Тогда
									СтруктураНовыхРеквизитовДокумента.Вставить("СубконтоДт"+(Сч + 1), Объект.УдалитьДоговорКонтрагента);
								КонецЕсли;
								
							КонецЦикла;
							
						Иначе	
							
							Если ВидДоговора = ВидДоговораСПокупателем Тогда
								
								СтруктураНовыхРеквизитовДокумента.Вставить("ВидАвансаЗадолженности", Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПокупателя);
								
								СтруктураТабличнойЧасти = Новый Структура;
								
								СтруктураТабличнойЧасти.Вставить("КорДоговорКонтрагента", Объект.УдалитьДоговорКонтрагента);
								СтруктураТабличнойЧасти.Вставить("КорСчетУчетаРасчетов", Объект.СчетДт);
								
								СтруктураНовыхРеквизитовДокумента.Вставить("ДебиторскаяЗадолженность", СтруктураТабличнойЧасти);
								
							ИначеЕсли ВидДоговора = ВидДоговораСПоставщиком Тогда
								
								СтруктураНовыхРеквизитовДокумента.Вставить("ВидАвансаЗадолженности", Перечисления.ВидыАвансаЗадолженности.АвансыПоставщику);
								
								СтруктураТабличнойЧасти = Новый Структура;
								
								СтруктураТабличнойЧасти.Вставить("КорДоговорКонтрагента", Объект.УдалитьДоговорКонтрагента);
								СтруктураТабличнойЧасти.Вставить("КорСчетУчетаРасчетов", Объект.СчетДт);
								
								СтруктураНовыхРеквизитовДокумента.Вставить("ДебиторскаяЗадолженность", СтруктураТабличнойЧасти);
								
							Иначе
								
								СтруктураНовыхРеквизитовДокумента.Вставить("ВидАвансаЗадолженности", Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПокупателя);
								
								СтруктураТабличнойЧасти = Новый Структура;
								
								СтруктураТабличнойЧасти.Вставить("КорДоговорКонтрагента", Объект.УдалитьДоговорКонтрагента);
								СтруктураТабличнойЧасти.Вставить("КорСчетУчетаРасчетов", Объект.СчетДт);
								
								СтруктураНовыхРеквизитовДокумента.Вставить("ДебиторскаяЗадолженность", СтруктураТабличнойЧасти);
								
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		Если КоличествоКредиторки > 0 
			и КоличествоДебиторки > 0 Тогда
			
			СтруктураНовыхРеквизитовДокумента.Вставить("ВидОперации", Перечисления.ВидыОперацийКорректировкаДолга.Прочее);
			СтруктураНовыхРеквизитовДокумента.Вставить("КонтрагентКредитор", Объект.КонтрагентДебитор);
			
		Иначе
			
			Если КоличествоДебиторки > 0 Тогда
				
				ПризнакВидаОперацииПрочее = Ложь;
				
				ВидДоговора    = Неопределено;
				
				МаксимальноеКоличество = КоличествоДебиторки - 1;
				
				Для Сч = 0 по МаксимальноеКоличество Цикл
					
					СтрокаТабличнойЧасти = Объект.ДебиторскаяЗадолженность[Сч];
					
					ВидДоговораТекущий = СтрокаТабличнойЧасти.ДоговорКонтрагента.ВидДоговора;
					
					Если ВидДоговораТекущий = ВидДоговораПрочее Тогда
						
						ПризнакВидаОперацииПрочее = Истина;
						Прервать;
						
					КонецЕсли;	
					
					Если ВидДоговораТекущий = ВидДоговораСПокупателем 
						или ВидДоговораТекущий = ВидДоговораСПоставщиком Тогда
						
						Если ВидДоговора = Неопределено Тогда
							ВидДоговора = ВидДоговораТекущий;
						Иначе
							
							Если ВидДоговора <> ВидДоговораТекущий Тогда
								
								ПризнакВидаОперацииПрочее = Истина;
								Прервать;
								
							КонецЕсли;	
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
				Если ПризнакВидаОперацииПрочее Тогда
					
					СтруктураНовыхРеквизитовДокумента.Вставить("ВидОперации", Перечисления.ВидыОперацийКорректировкаДолга.Прочее);
					СтруктураНовыхРеквизитовДокумента.Вставить("КонтрагентКредитор", Справочники.Контрагенты.ПустаяСсылка());
					СтруктураНовыхРеквизитовДокумента.Вставить("СчетКт", ПланыСчетов.Хозрасчетный.ПустаяСсылка());
					
				Иначе
					
					Если ВидДоговора = ВидДоговораСПокупателем Тогда
						СтруктураНовыхРеквизитовДокумента.Вставить("ВидАвансаЗадолженности", Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПокупателя);
					ИначеЕсли ВидДоговора = ВидДоговораСПоставщиком Тогда
						СтруктураНовыхРеквизитовДокумента.Вставить("ВидАвансаЗадолженности", Перечисления.ВидыАвансаЗадолженности.АвансыПоставщику);
					Иначе
						СтруктураНовыхРеквизитовДокумента.Вставить("ВидАвансаЗадолженности", Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПокупателя);
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				
				ПризнакВидаОперацииПрочее = Ложь;
				
				ВидДоговора    = Неопределено;
				
				МаксимальноеКоличество = КоличествоКредиторки - 1;
				
				Для Сч = 0 по МаксимальноеКоличество Цикл
					
					СтрокаТабличнойЧасти = Объект.КредиторскаяЗадолженность[Сч];
					
					ВидДоговораТекущий = СтрокаТабличнойЧасти.ДоговорКонтрагента.ВидДоговора;
					
					Если ВидДоговораТекущий = ВидДоговораПрочее Тогда
						
						ПризнакВидаОперацииПрочее = Истина;
						Прервать;
						
					КонецЕсли;	
					
					Если ВидДоговораТекущий = ВидДоговораСПокупателем 
						или ВидДоговораТекущий = ВидДоговораСПоставщиком Тогда
						
						Если ВидДоговора = Неопределено Тогда
							ВидДоговора = ВидДоговораТекущий;
						Иначе
							
							Если ВидДоговора <> ВидДоговораТекущий Тогда
								
								ПризнакВидаОперацииПрочее = Истина;
								Прервать;
								
							КонецЕсли;	
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
				Если ПризнакВидаОперацииПрочее Тогда
					
					СтруктураНовыхРеквизитовДокумента.Вставить("ВидОперации", Перечисления.ВидыОперацийКорректировкаДолга.Прочее);
					СтруктураНовыхРеквизитовДокумента.Вставить("КонтрагентКредитор", Объект.КонтрагентДебитор);
					СтруктураНовыхРеквизитовДокумента.Вставить("КонтрагентДебитор", Справочники.Контрагенты.ПустаяСсылка());
					СтруктураНовыхРеквизитовДокумента.Вставить("СчетДт", ПланыСчетов.Хозрасчетный.ПустаяСсылка());
					
				Иначе
					
					Если ВидДоговора = ВидДоговораСПокупателем Тогда
						СтруктураНовыхРеквизитовДокумента.Вставить("ВидАвансаЗадолженности", Перечисления.ВидыАвансаЗадолженности.АвансыПокупателя);
					ИначеЕсли ВидДоговора = ВидДоговораСПоставщиком Тогда
						СтруктураНовыхРеквизитовДокумента.Вставить("ВидАвансаЗадолженности", Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПоставщику);
					Иначе
						СтруктураНовыхРеквизитовДокумента.Вставить("ВидАвансаЗадолженности", Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПоставщику);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;	
		
	КонецЕсли;
	
	Если СтруктураНовыхРеквизитовДокумента.Количество() > 0 Тогда
		
		Для Каждого ЭлементСтруктуры Из СтруктураНовыхРеквизитовДокумента Цикл
			
			Если ТипЗнч(ЭлементСтруктуры.Значение) = Тип("Структура") Тогда
				
				ТабличнаяЧасть = Объект[ЭлементСтруктуры.Ключ];
				
				Для Каждого СтрокаТабличнойЧасти Из ТабличнаяЧасть Цикл
					
					Для Каждого ЭлементСтруктурыВложенной Из ЭлементСтруктуры.Значение Цикл
						СтрокаТабличнойЧасти[ЭлементСтруктурыВложенной.Ключ] = ЭлементСтруктурыВложенной.Значение;
					КонецЦикла;
					
				КонецЦикла;
				
			Иначе
				Объект[ЭлементСтруктуры.Ключ] = ЭлементСтруктуры.Значение;
			КонецЕсли;
			
		КонецЦикла;
		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект,,,РежимЗаписиДокумента.Запись);
		
	КонецЕсли;
		
КонецПроцедуры		

// Возвращает курс аванса, рассчитанный как частное от деления
// рублевого остатка по договору на валютный.
//
Функция ПолучитьКурсВалютыАванса(Договор, Организация, ДатаКурса, КурсДокумента = 1) Экспорт
	
	ПорядокСубконто = Новый Массив;
	ПорядокСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	ПорядокСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаКурса", ДатаКурса);
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("Контрагент", Договор.Владелец);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПорядокСубконто", ПорядокСубконто);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Счет
	|ПОМЕСТИТЬ ВТ_СчетаУчетаРасчетов
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчикамиВал), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПрочимиПокупателямиИЗаказчикамиВал))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОстатки.СуммаОстаток,
	|	ХозрасчетныйОстатки.ВалютнаяСуммаОстаток
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&ДатаКурса,
	|			Счет В
	|				(ВЫБРАТЬ
	|					ВТ_СчетаУчетаРасчетов.Счет
	|				ИЗ
	|					ВТ_СчетаУчетаРасчетов),
	|			&ПорядокСубконто,
	|			Субконто1 = &Контрагент
	|				И Субконто2 = &Договор
	|				И Организация = &Организация) КАК ХозрасчетныйОстатки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат КурсДокумента;
		
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Возврат ?(Выборка.ВалютнаяСуммаОстаток = 0, КурсДокумента, Окр(Выборка.СуммаОстаток / Выборка.ВалютнаяСуммаОстаток, 4));
		
	КонецЕсли;
	
КонецФункции

// Получает остатки взаиморасчетов по контрагенту. Выполняется в фоновом задании.
//
Процедура ЗаполнитьОстаткамиВзаиморасчетов(СтруктураПараметров, АдресХранилища) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	СтруктураДанныхЗаполнения = Новый Структура();
	СтруктураДанныхЗаполнения.Вставить("Успешно",            Истина);
	СтруктураДанныхЗаполнения.Вставить("ЗаполненныеТаблицы", Новый Соответствие);
	
	Если НЕ ПроверитьОтложенныеРасчеты(СтруктураПараметров) Тогда
		СтруктураДанныхЗаполнения.Успешно = Ложь;
		ПоместитьВоВременноеХранилище(СтруктураДанныхЗаполнения, АдресХранилища);
		Возврат;
	КонецЕсли;
	
	Для каждого ЗаполняемаяТаблица Из СтруктураПараметров.ЗаполняемыеТаблицы Цикл
		
		ТаблицаЗадолженности = ПолучитьОстаткиВзаиморасчетовПоВидуЗадолженности(СтруктураПараметров, ЗаполняемаяТаблица);
		СтруктураДанныхЗаполнения.ЗаполненныеТаблицы.Вставить(ЗаполняемаяТаблица.ВидЗадолженности, ТаблицаЗадолженности);
		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(СтруктураДанныхЗаполнения, АдресХранилища);
	
КонецПроцедуры

Функция ПроверитьОтложенныеРасчеты(СтруктураПараметров)

	ДатаОкончания = ?(СтруктураПараметров.ЭтоНовый, КонецДня(СтруктураПараметров.Дата), СтруктураПараметров.Дата);
	
	ПараметрыРасчета = УчетВзаиморасчетовОтложенноеПроведение.НовыеПараметрыРасчета();
	ПараметрыРасчета.Организация 	         = СтруктураПараметров.Организация;
	ПараметрыРасчета.ДатаОкончания 	         = ДатаОкончания;
	ПараметрыРасчета.АдресХранилищаСОшибками = СтруктураПараметров.АдресХранилищаСОшибками;
	
	ЕстьДоговорыСОшибками = Ложь;
	Для каждого ЗаполняемаяТаблица Из СтруктураПараметров.ЗаполняемыеТаблицы Цикл
		
		ПараметрыРасчета.Контрагент = ЗаполняемаяТаблица.ПоКонтрагенту;
		Результат = УчетВзаиморасчетовОтложенноеПроведение.ВыполнитьОтложенныеРасчеты(ПараметрыРасчета);
		ЕстьДоговорыСОшибками = (Результат.КоличествоДоговоровСОшибками <> 0);
		
		Если ЕстьДоговорыСОшибками Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Не ЕстьДоговорыСОшибками;

КонецФункции

// Получает остатки взаиморасчетов по контрагенту для одного из видов задолженности.
//
Функция ПолучитьОстаткиВзаиморасчетовПоВидуЗадолженности(СтруктураПараметров, ЗаполняемаяТаблица)

	СчетаРасчетов = Новый Массив();
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками);
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками);
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоКраткосрочнымКредитамИЗаймам);
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоДолгосрочнымКредитамИЗаймам);
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСРазнымиДебиторамиИКредиторами);

	СчетаИсключаемые = Новый Массив();
	СчетаИсключаемые.Добавить(ПланыСчетов.Хозрасчетный.ВекселяВыданные);
	СчетаИсключаемые.Добавить(ПланыСчетов.Хозрасчетный.ВекселяПолученные);
	СчетаИсключаемые.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоИмущественномуЛичномуИДобровольномуСтрахованию);
	СчетаИсключаемые.Добавить(ПланыСчетов.Хозрасчетный.НДСпоАвансамИПредоплатам);
	СчетаИсключаемые.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоНДСотложенномуДляУплатыВБюджет);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ХозрасчетныйВидыСубконто.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ХозрасчетныйВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ЕстьКонтрагенты,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ХозрасчетныйВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ЕстьДоговоры,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ХозрасчетныйВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ЕстьДокументыРасчетов
	|ПОМЕСТИТЬ НаличиеНужныхСубконто
	|ИЗ
	|	ПланСчетов.Хозрасчетный.ВидыСубконто КАК ХозрасчетныйВидыСубконто
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйВидыСубконто.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НаличиеНужныхСубконто.ЕстьДокументыРасчетов
	|			ТОГДА Хозрасчетный.Ссылка
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СчетаПоДокументам,
	|	ВЫБОР
	|		КОГДА НЕ НаличиеНужныхСубконто.ЕстьДокументыРасчетов
	|			ТОГДА Хозрасчетный.Ссылка
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СчетаБезДокументов,
	|	НаличиеНужныхСубконто.ЕстьДокументыРасчетов
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НаличиеНужныхСубконто КАК НаличиеНужныхСубконто
	|		ПО Хозрасчетный.Ссылка = НаличиеНужныхСубконто.Ссылка
	|ГДЕ
	|	НаличиеНужныхСубконто.ЕстьКонтрагенты
	|	И НаличиеНужныхСубконто.ЕстьДоговоры
	|	И НЕ Хозрасчетный.ЗапретитьИспользоватьВПроводках
	|	И Хозрасчетный.Ссылка В ИЕРАРХИИ(&СчетаРасчетов)
	|	И НЕ Хозрасчетный.Ссылка В ИЕРАРХИИ (&СчетаИсключаемые)";

	Запрос.УстановитьПараметр("СчетаРасчетов", СчетаРасчетов);
	Запрос.УстановитьПараметр("СчетаИсключаемые", СчетаИсключаемые);
	СчетаУчетаРасчетов = Запрос.Выполнить().Выгрузить();

	СчетаРасчетовБезАналитикиПоДокументам = ОбщегоНазначенияБПВызовСервера.УдалитьПовторяющиесяЭлементыМассива(СчетаУчетаРасчетов.ВыгрузитьКолонку("СчетаБезДокументов"), Истина);
	СчетаРасчетовСАналитикойПоДокументам = ОбщегоНазначенияБПВызовСервера.УдалитьПовторяющиесяЭлементыМассива(СчетаУчетаРасчетов.ВыгрузитьКолонку("СчетаПоДокументам"), Истина);

	Запрос = Новый Запрос;
	
	Если СчетаРасчетовБезАналитикиПоДокументам.Количество() <> 0 Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ХозрасчетныйОстатки.Счет,
		|	ХозрасчетныйОстатки.Субконто1 КАК Контрагент,
		|	ХозрасчетныйОстатки.Субконто2 КАК Договор,
		|	НЕОПРЕДЕЛЕНО КАК ДокументРасчетов,
		|	ХозрасчетныйОстатки.СуммаОстаток,
		|	ХозрасчетныйОстатки.ВалютнаяСуммаОстаток,
		|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
		|	ДоговорыКонтрагентов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
		|	ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
		|			&Период,
		|			Счет В (&СчетаРасчетовБезАналитикиПоДокументам),
		|			&ВидыСубконтоБезДокументов,
		|			Организация = &Организация
		|				И Субконто1 = &Контрагент) КАК ХозрасчетныйОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО ХозрасчетныйОстатки.Субконто2 = ДоговорыКонтрагентов.Ссылка
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ВалютаДокумента В (&ВалютаРегУчета)
		|				ТОГДА ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах
		|						ИЛИ ДоговорыКонтрагентов.ВалютаВзаиморасчетов В (&ВалютаРегУчета)
		|			ИНАЧЕ НЕ ДоговорыКонтрагентов.ВалютаВзаиморасчетов В (&ВалютаРегУчета)
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах
		|					ИЛИ ДоговорыКонтрагентов.ВалютаВзаиморасчетов В (&ВалютаРегУчета)
		|				ТОГДА ВЫБОР
		|						КОГДА &ВидЗадолженности = &ВидЗадолженностиДебиторская
		|							ТОГДА ХозрасчетныйОстатки.СуммаОстаток > 0
		|						ИНАЧЕ ХозрасчетныйОстатки.СуммаОстаток < 0
		|					КОНЕЦ
		|			ИНАЧЕ ВЫБОР
		|					КОГДА &ВидЗадолженности = &ВидЗадолженностиДебиторская
		|						ТОГДА ХозрасчетныйОстатки.ВалютнаяСуммаОстаток > 0
		|					ИНАЧЕ ХозрасчетныйОстатки.ВалютнаяСуммаОстаток < 0
		|				КОНЕЦ
		|		КОНЕЦ";
		
		Если НЕ ЗаполняемаяТаблица.МассивВидовДоговоров = Неопределено Тогда
			
			Запрос.Текст = Запрос.Текст + "
			|	И ДоговорыКонтрагентов.ВидДоговора В (&МассивВидовДоговоров)";
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если СчетаРасчетовСАналитикойПоДокументам.Количество() <> 0 Тогда
	
		Запрос.Текст = ?(ПустаяСтрока(Запрос.Текст), "", Запрос.Текст + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС)+
		"ВЫБРАТЬ
		|	ХозрасчетныйОстатки.Счет,
		|	ХозрасчетныйОстатки.Субконто1 КАК Контрагент,
		|	ХозрасчетныйОстатки.Субконто2 КАК Договор,
		|	ХозрасчетныйОстатки.Субконто3 КАК ДокументРасчетов,
		|	ХозрасчетныйОстатки.СуммаОстаток,
		|	ХозрасчетныйОстатки.ВалютнаяСуммаОстаток,
		|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
		|	ДоговорыКонтрагентов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
		|	ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
		|			&Период,
		|			Счет В (&СчетаРасчетовСАналитикойПоДокументам),
		|			&ВидыСубконтоСДокументами,
		|			Организация = &Организация
		|				И Субконто1 = &Контрагент) КАК ХозрасчетныйОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО ХозрасчетныйОстатки.Субконто2 = ДоговорыКонтрагентов.Ссылка
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ВалютаДокумента В (&ВалютаРегУчета)
		|				ТОГДА ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах
		|						ИЛИ ДоговорыКонтрагентов.ВалютаВзаиморасчетов В (&ВалютаРегУчета)
		|			ИНАЧЕ НЕ ДоговорыКонтрагентов.ВалютаВзаиморасчетов В (&ВалютаРегУчета)
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах
		|					ИЛИ ДоговорыКонтрагентов.ВалютаВзаиморасчетов В (&ВалютаРегУчета)
		|				ТОГДА ВЫБОР
		|						КОГДА &ВидЗадолженности = &ВидЗадолженностиДебиторская
		|							ТОГДА ХозрасчетныйОстатки.СуммаОстаток > 0
		|						ИНАЧЕ ХозрасчетныйОстатки.СуммаОстаток < 0
		|					КОНЕЦ
		|			ИНАЧЕ ВЫБОР
		|					КОГДА &ВидЗадолженности = &ВидЗадолженностиДебиторская
		|						ТОГДА ХозрасчетныйОстатки.ВалютнаяСуммаОстаток > 0
		|					ИНАЧЕ ХозрасчетныйОстатки.ВалютнаяСуммаОстаток < 0
		|				КОНЕЦ
		|		КОНЕЦ";
		
		Если НЕ ЗаполняемаяТаблица.МассивВидовДоговоров = Неопределено Тогда
			
			Запрос.Текст = Запрос.Текст + "
			|	И ДоговорыКонтрагентов.ВидДоговора В (&МассивВидовДоговоров)";
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	
	ВидЗадолженности = ЗаполняемаяТаблица.ВидЗадолженности;
	ВалютаРеглУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Если СтруктураПараметров.ЭтоНовый Тогда
		Запрос.УстановитьПараметр("Период", Новый МоментВремени(КонецДня(СтруктураПараметров.Дата), СтруктураПараметров.Ссылка));
	Иначе
		Запрос.УстановитьПараметр("Период", Новый МоментВремени(СтруктураПараметров.Дата, СтруктураПараметров.Ссылка));
	КонецЕсли;
	Запрос.УстановитьПараметр("Организация",				  СтруктураПараметров.Организация);
	Запрос.УстановитьПараметр("Контрагент", 				  ЗаполняемаяТаблица.ПоКонтрагенту);
	Запрос.УстановитьПараметр("ВидЗадолженности", 			  ВидЗадолженности);
	Запрос.УстановитьПараметр("ВидЗадолженностиДебиторская",  Перечисления.ВидыЗадолженности.Дебиторская);
	Запрос.УстановитьПараметр("МассивВидовДоговоров",         ЗаполняемаяТаблица.МассивВидовДоговоров);
	
	СписокВалютыРеглУчета = Новый СписокЗначений;
	СписокВалютыРеглУчета.Добавить(ВалютаРеглУчета);
	СписокВалютыРеглУчета.Добавить(Справочники.Валюты.ПустаяСсылка());
	Запрос.УстановитьПараметр("ВалютаРегУчета",  СписокВалютыРеглУчета);
	Запрос.УстановитьПараметр("ВалютаДокумента", СтруктураПараметров.ВалютаДокумента);

	Если СписокВалютыРеглУчета.НайтиПоЗначению(СтруктураПараметров.ВалютаДокумента) = Неопределено Тогда
		//Документ в иностранной валюте. Установим отбор только по договорам в нужной валюте
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
							"Организация = &Организация",
							"Организация = &Организация
			|				И Валюта = &ВалютаДокумента");
	КонецЕсли;

	Запрос.УстановитьПараметр("СчетаРасчетовБезАналитикиПоДокументам", СчетаРасчетовБезАналитикиПоДокументам);
	Запрос.УстановитьПараметр("СчетаРасчетовСАналитикойПоДокументам",  СчетаРасчетовСАналитикойПоДокументам);

	ВидыСубконтоБезДокументов = Новый Массив();
	ВидыСубконтоБезДокументов.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	ВидыСубконтоБезДокументов.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	Запрос.УстановитьПараметр("ВидыСубконтоБезДокументов",ВидыСубконтоБезДокументов);

	ВидыСубконтоСДокументами = Новый Массив();
	ВидыСубконтоСДокументами.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	ВидыСубконтоСДокументами.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	ВидыСубконтоСДокументами.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами);
	Запрос.УстановитьПараметр("ВидыСубконтоСДокументами", ВидыСубконтоСДокументами);
	
	Если ВидЗадолженности = Перечисления.ВидыЗадолженности.Дебиторская Тогда
		Множитель = 1;
		ИмяТаблицыЗадолженности = "ДебиторскаяЗадолженность";
	Иначе		
		Множитель = -1;
		ИмяТаблицыЗадолженности = "КредиторскаяЗадолженность";
	КонецЕсли;
	ТаблицаЗадолженности = Документы.КорректировкаДолга.ПустаяСсылка()[ИмяТаблицыЗадолженности].ВыгрузитьКолонки();
	
	ВыборкаОстатков = Запрос.Выполнить().Выбрать();
	Пока ВыборкаОстатков.Следующий() Цикл
		
		НоваяСтрока = ТаблицаЗадолженности.Добавить();
		НоваяСтрока.ДоговорКонтрагента = ВыборкаОстатков.Договор;
		НоваяСтрока.Сделка             = ВыборкаОстатков.ДокументРасчетов;
		НоваяСтрока.СчетУчетаРасчетов  = ВыборкаОстатков.Счет;
		
		НоваяСтрока.СуммаВзаиморасчетов = Множитель * ВыборкаОстатков.ВалютнаяСуммаОстаток;
		
		ДокументВВалюте          = СписокВалютыРеглУчета.НайтиПоЗначению(СтруктураПараметров.ВалютаДокумента) = Неопределено;
		ДокументВРубляхРасчетыУЕ = СписокВалютыРеглУчета.НайтиПоЗначению(ВыборкаОстатков.ВалютаВзаиморасчетов) = Неопределено;
		
		Если ДокументВВалюте Или ДокументВРубляхРасчетыУЕ Тогда
		
			Если ВидЗадолженности = Перечисления.ВидыЗадолженности.Дебиторская Тогда
				ЭтоАванс = ВыборкаОстатков.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком 
					ИЛИ (ВыборкаОстатков.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом
						ИЛИ ВыборкаОстатков.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку
						ИЛИ ВыборкаОстатков.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером
						ИЛИ ВыборкаОстатков.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку)
				  	  И (БухгалтерскийУчетПовтИсп.СчетВИерархии(ВыборкаОстатков.Счет, ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками)
						ИЛИ БухгалтерскийУчетПовтИсп.СчетВИерархии(ВыборкаОстатков.Счет, ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчикамиВал));
			Иначе
				ЭтоАванс = ВыборкаОстатков.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем
					ИЛИ (ВыборкаОстатков.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом
						ИЛИ ВыборкаОстатков.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку
						ИЛИ ВыборкаОстатков.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером
						ИЛИ ВыборкаОстатков.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку)
					  И (БухгалтерскийУчетПовтИсп.СчетВИерархии(ВыборкаОстатков.Счет, ПланыСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками)
						ИЛИ БухгалтерскийУчетПовтИсп.СчетВИерархии(ВыборкаОстатков.Счет, ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПокупателямиИЗаказчикамиВал));
			КонецЕсли;
			
			Если ЭтоАванс Тогда
				
				НоваяСтрока.КурсВзаиморасчетов = ?(ВыборкаОстатков.ВалютнаяСуммаОстаток = 0,
					НоваяСтрока.КурсВзаиморасчетов,
					Окр(ВыборкаОстатков.СуммаОстаток / ВыборкаОстатков.ВалютнаяСуммаОстаток, 4));
				НоваяСтрока.КратностьВзаиморасчетов = 1;
				
			Иначе
				
				Если СписокВалютыРеглУчета.НайтиПоЗначению(СтруктураПараметров.ВалютаДокумента) = Неопределено Тогда
				
					НоваяСтрока.КурсВзаиморасчетов = СтруктураПараметров.КурсДокумента;
					НоваяСтрока.КратностьВзаиморасчетов = СтруктураПараметров.КратностьДокумента;
					
				Иначе
					
					КурсИКратность = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВыборкаОстатков.ВалютаВзаиморасчетов, СтруктураПараметров.Дата);
					
					НоваяСтрока.КурсВзаиморасчетов = КурсИКратность.Курс;
					НоваяСтрока.КратностьВзаиморасчетов = КурсИКратность.Кратность;
					
				КонецЕсли;	
				
			КонецЕсли;
			
			Если ВыборкаОстатков.РасчетыВУсловныхЕдиницах Тогда
				
				Если ЭтоАванс Тогда
					НоваяСтрока.Сумма = Множитель * ВыборкаОстатков.СуммаОстаток;
				Иначе	
					
					НоваяСтрока.Сумма = РаботаСКурсамиВалютБПКлиентСервер.ПересчитатьИзВалютыВВалюту(НоваяСтрока.СуммаВзаиморасчетов,
						ВыборкаОстатков.ВалютаВзаиморасчетов, ВалютаРеглУчета,
						НоваяСтрока.КурсВзаиморасчетов, 1,
						НоваяСтрока.КратностьВзаиморасчетов, 1);
					
				КонецЕсли;	
				
			Иначе
				НоваяСтрока.Сумма = НоваяСтрока.СуммаВзаиморасчетов;
			КонецЕсли;

		Иначе
			
			НоваяСтрока.СуммаВзаиморасчетов 	= Множитель * ВыборкаОстатков.СуммаОстаток;
			НоваяСтрока.КурсВзаиморасчетов 		= 1;
			НоваяСтрока.КратностьВзаиморасчетов = 1;
			
			НоваяСтрока.Сумма = Множитель * ВыборкаОстатков.СуммаОстаток;
			
		КонецЕсли;
		
		Если СтруктураПараметров.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности
			ИЛИ СтруктураПараметров.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.Прочее Тогда
			НоваяСтрока.СуммаНУ = НоваяСтрока.Сумма;
		КонецЕсли;

	КонецЦикла;
	
	Возврат ТаблицаЗадолженности;

КонецФункции

Функция РеквизитыНеРедактируемыеВГрупповойОбработке() Экспорт
	
	МассивРеквизитов = Новый Массив();
	МассивРеквизитов.Добавить("УдалитьДоговорКонтрагента");
	
	Возврат МассивРеквизитов;
	
КонецФункции

Функция ПодготовитьСтруктуруДляСуммовыхРазниц(СтруктураТаблиц, Отказ) Экспорт;
	
	Если СтруктураТаблиц = Неопределено Тогда
		Возврат СтруктураТаблиц;
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура;
	
	Для Каждого ЭлементСтруктуры Из СтруктураТаблиц Цикл
		
		КлючИсходнойТаблицы = ЭлементСтруктуры.Ключ;
		
		ИсходнаяТаблица = ЭлементСтруктуры.Значение;
		
		ТаблицаДляСуммовыхРазниц = УчетВзаиморасчетов.ПустаяТаблицаВзаимозачет();
		
		Для Каждого СтрокаТаблицы Из ИсходнаяТаблица Цикл
			
			Если СтрокаТаблицы.Разница <> 0 Тогда
				
				НоваяСтрока = ТаблицаДляСуммовыхРазниц.Добавить();
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
				
			КонецЕсли;
			
			Если СтрокаТаблицы.КорРазница <> 0 Тогда
				
				НоваяСтрока = ТаблицаДляСуммовыхРазниц.Добавить();
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
				
				НоваяСтрока.Контрагент           = НоваяСтрока.КорСубконто1;
				НоваяСтрока.ДоговорКонтрагента   = НоваяСтрока.КорСубконто2;
				НоваяСтрока.ДокументРасчетов     = НоваяСтрока.КорСубконто3;
				НоваяСтрока.СчетРасчетов         = НоваяСтрока.СчетРасчетов;
				НоваяСтрока.Разница              = НоваяСтрока.КорРазница;
				НоваяСтрока.Подразделение        = НоваяСтрока.КорПодразделение;
				НоваяСтрока.ВалютаВзаиморасчетов = НоваяСтрока.КорВалютаВзаиморасчетов;
				
			КонецЕсли;
			
		КонецЦикла;
		
		СтруктураВозврата.Вставить(КлючИсходнойТаблицы, ИсходнаяТаблица);
		СтруктураВозврата.Вставить(КлючИсходнойТаблицы+"СуммовыеРазницы", ТаблицаДляСуммовыхРазниц);
		
	КонецЦикла;
	
	Возврат СтруктураВозврата;
	
КонецФункции	

////////////////////////////////////////////////////////////////////////////////
// ПОДГОТОВКА ПАРАМЕТРОВ ПРОВЕДЕНИЯ ДОКУМЕНТА

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ, ДоговорДляОтложенногоПроведения = Неопределено) Экспорт

	ПараметрыПроведения = Новый Структура;

	ЭтоОтложенноеПроведение = ЗначениеЗаполнено(ДоговорДляОтложенногоПроведения);
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ЭтоОтложенноеПроведение", ЭтоОтложенноеПроведение);
	Запрос.УстановитьПараметр("ДоговорДляОтложенногоПроведения", ДоговорДляОтложенногоПроведения);
	
	ТекстЗапроса =
	
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Счет
	|ПОМЕСТИТЬ ВТ_СчетаУчетаРасчетовСПоставщиками
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчикамиВал))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Счет
	|ПОМЕСТИТЬ ВТ_СчетаУчетаРасчетовСПокупателями
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПрочимиПокупателямиИЗаказчикамиВал))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ЗадолженностьКратко.ЕстьДебиторскаяЗадолженностьВозвратАванса) КАК ЕстьДебиторскаяЗадолженностьВозвратАванса,
	|	МАКСИМУМ(ЗадолженностьКратко.ЕстьДебиторскаяЗадолженность) КАК ЕстьДебиторскаяЗадолженность,
	|	МАКСИМУМ(ЗадолженностьКратко.ЕстьКредиторскаяЗадолженностьВозвратАванса) КАК ЕстьКредиторскаяЗадолженностьВозвратАванса,
	|	МАКСИМУМ(ЗадолженностьКратко.ЕстьКредиторскаяЗадолженность) КАК ЕстьКредиторскаяЗадолженность
	|ПОМЕСТИТЬ ВТ_ЗадолженностьКратко
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА &УсловиеДебиторскаяЗадолженностьВозвратАванса
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК ЕстьДебиторскаяЗадолженностьВозвратАванса,
	|		ВЫБОР
	|			КОГДА НЕ &УсловиеДебиторскаяЗадолженностьВозвратАванса
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК ЕстьДебиторскаяЗадолженность,
	|		ЛОЖЬ КАК ЕстьКредиторскаяЗадолженностьВозвратАванса,
	|		ЛОЖЬ КАК ЕстьКредиторскаяЗадолженность
	|	ИЗ
	|		Документ.КорректировкаДолга.ДебиторскаяЗадолженность КАК ТаблицаДебиторскаяЗадолженность
	|	ГДЕ
	|		ТаблицаДебиторскаяЗадолженность.Ссылка = &Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЛОЖЬ,
	|		ЛОЖЬ,
	|		ВЫБОР
	|			КОГДА &УсловиеКредиторскаяЗадолженностьВозвратАванса
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА НЕ &УсловиеКредиторскаяЗадолженностьВозвратАванса
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	ИЗ
	|		Документ.КорректировкаДолга.КредиторскаяЗадолженность КАК ТаблицаКредиторскаяЗадолженность
	|	ГДЕ
	|		ТаблицаКредиторскаяЗадолженность.Ссылка = &Ссылка) КАК ЗадолженностьКратко
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.ВидОперации КАК ВидОперации,
	|	Реквизиты.СчетДт КАК СчетДт,
	|	Реквизиты.СубконтоДт1 КАК СубконтоДт1,
	|	Реквизиты.СубконтоДт2 КАК СубконтоДт2,
	|	Реквизиты.СубконтоДт3 КАК СубконтоДт3,
	|	Реквизиты.СчетКт КАК СчетКт,
	|	Реквизиты.СубконтоКт1 КАК СубконтоКт1,
	|	Реквизиты.СубконтоКт2 КАК СубконтоКт2,
	|	Реквизиты.СубконтоКт3 КАК СубконтоКт3,
	|	Реквизиты.СуммаКтЗадолженности КАК СуммаКтЗадолженности,
	|	Реквизиты.СуммаДтЗадолженности КАК СуммаДтЗадолженности,
	|	&ЭтоОтложенноеПроведение КАК ЭтоОтложенноеПроведение,
	|	Реквизиты.ВидАвансаЗадолженности КАК ВидАвансаЗадолженности,
	|	ЕСТЬNULL(ВТ_ЗадолженностьКратко.ЕстьДебиторскаяЗадолженность, ЛОЖЬ) КАК ЕстьДебиторскаяЗадолженность,
	|	ЕСТЬNULL(ВТ_ЗадолженностьКратко.ЕстьДебиторскаяЗадолженностьВозвратАванса, ЛОЖЬ) КАК ЕстьДебиторскаяЗадолженностьВозвратАванса,
	|	ЕСТЬNULL(ВТ_ЗадолженностьКратко.ЕстьКредиторскаяЗадолженность, ЛОЖЬ) КАК ЕстьКредиторскаяЗадолженность,
	|	ЕСТЬNULL(ВТ_ЗадолженностьКратко.ЕстьКредиторскаяЗадолженностьВозвратАванса, ЛОЖЬ) КАК ЕстьКредиторскаяЗадолженностьВозвратАванса
	|ИЗ
	|	Документ.КорректировкаДолга КАК Реквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗадолженностьКратко КАК ВТ_ЗадолженностьКратко
	|		ПО (ИСТИНА)
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеДебиторскаяЗадолженностьВозвратАванса", ТекстУсловияДебиторскаяЗадолженностьВозвратАванса());
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеКредиторскаяЗадолженностьВозвратАванса", ТекстУсловияКредиторскаяЗадолженностьВозвратАванса());
	
	Запрос.Текст = ТекстЗапроса;
	
	РеквизитыДокумента = Запрос.Выполнить().Выбрать();
	РеквизитыДокумента.Следующий();
									
	Если НЕ УчетнаяПолитика.Существует(РеквизитыДокумента.Организация, РеквизитыДокумента.Период, Истина, ДокументСсылка) Тогда
		Отказ = Истина;
		Возврат ПараметрыПроведения;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВалютаРеглУчета", Константы.ВалютаРегламентированногоУчета.Получить());
	Запрос.УстановитьПараметр("ОрганизацияПрименяетУСН",
		УчетнаяПолитика.ПрименяетсяУСН(РеквизитыДокумента.Организация, РеквизитыДокумента.Период));
	Запрос.УстановитьПараметр("ОрганизацияПрименяетУСНПатент",
		УчетнаяПолитика.ПрименяетсяУСНПатент(РеквизитыДокумента.Организация, РеквизитыДокумента.Период));
	Запрос.УстановитьПараметр("ДебиторскаяЗадолженностьСделкаПустыеЗначения", 
		ОбщегоНазначенияБПВызовСервера.ПолучитьМассивПустыхЗначенийПоОписаниюТипов(
		ДокументСсылка.Метаданные().ТабличныеЧасти.ДебиторскаяЗадолженность.Реквизиты.Сделка.Тип));
	Запрос.УстановитьПараметр("КредиторскаяЗадолженностьСделкаПустыеЗначения", 
		ОбщегоНазначенияБПВызовСервера.ПолучитьМассивПустыхЗначенийПоОписаниюТипов(
		ДокументСсылка.Метаданные().ТабличныеЧасти.КредиторскаяЗадолженность.Реквизиты.Сделка.Тип));
	Запрос.УстановитьПараметр("СодержаниеПроводкиПроведениеВзаимозачета", "Взаимозачет");
	Запрос.УстановитьПараметр("СодержаниеПроводкиПереносЗадолженности", "Переуступка долга");
	Запрос.УстановитьПараметр("СодержаниеПроводкиСписаниеЗадолженности", "Списание задолженности");
	Запрос.УстановитьПараметр("Дата", РеквизитыДокумента.Период);
	
	НомераТаблиц = Новый Структура;
	
	ТекстЗапроса = ТекстЗапросаВременныеТаблицы(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
		+ ТекстЗапросаРеквизиты(НомераТаблиц)
		+ ТекстЗапросаРеквизитыПроведениеВзаимозачетаДебиторскаяЗадолженность(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
		+ ТекстЗапросаРеквизитыПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
		+ ТекстЗапросаРеквизитыПроведениеВзаимозачетаКредиторскаяЗадолженность(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
		+ ТекстЗапросаРеквизитыПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
		+ ТекстЗапросаТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
		+ ТекстЗапросаТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
		+ ТекстЗапросаТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
		+ ТекстЗапросаТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
		+ ТекстЗапросаРеквизитыПереносЗадолженностиДебиторскаяЗадолженность(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
		+ ТекстЗапросаРеквизитыПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
		+ ТекстЗапросаРеквизитыПереносЗадолженностиКредиторскаяЗадолженность(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
		+ ТекстЗапросаРеквизитыПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
		+ ТекстЗапросаТаблицаПереносЗадолженностиДебиторскаяЗадолженность(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
		+ ТекстЗапросаТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
		+ ТекстЗапросаТаблицаПереносЗадолженностиКредиторскаяЗадолженность(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
		+ ТекстЗапросаТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
		+ ТекстЗапросаРеквизитыСписаниеЗадолженностиДебиторскаяЗадолженность(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
		+ ТекстЗапросаРеквизитыСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
		+ ТекстЗапросаРеквизитыСписаниеЗадолженностиКредиторскаяЗадолженность(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
		+ ТекстЗапросаРеквизитыСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
		+ ТекстЗапросаТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
		+ ТекстЗапросаТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
		+ ТекстЗапросаТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
		+ ТекстЗапросаТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
		+ ТекстЗапросаРегистрацияОтложенныхРасчетовСКонтрагентами(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента);
		
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"&УсловиеДебиторскаяЗадолженностьВозвратАванса",
		ТекстУсловияДебиторскаяЗадолженностьВозвратАванса());
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"&УсловиеКредиторскаяЗадолженностьВозвратАванса",
		ТекстУсловияКредиторскаяЗадолженностьВозвратАванса());
	
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.ВыполнитьПакет();
	
	Для каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
	
	Если НЕ УчетнаяПолитика.ПлательщикНДФЛ(РеквизитыДокумента.Организация, РеквизитыДокумента.Период) Тогда
		
		ПараметрыПроведения.Вставить("РеквизитыПроведениеВзаимозачетаДебиторскаяЗадолженностьИП", Неопределено);
		ПараметрыПроведения.Вставить("РеквизитыПроведениеВзаимозачетаКредиторскаяЗадолженностьИП", Неопределено);
		
	Иначе

		Если ПараметрыПроведения.РеквизитыПроведениеВзаимозачетаДебиторскаяЗадолженность = Неопределено Тогда
			РеквизитыПроведениеВзаимозачетаДебиторскаяЗадолженностьИП = Неопределено;
		Иначе
			РеквизитыПроведениеВзаимозачетаДебиторскаяЗадолженностьИП = 
				ПараметрыПроведения.РеквизитыПроведениеВзаимозачетаДебиторскаяЗадолженность.Скопировать();
		КонецЕсли;
		
		Если ПараметрыПроведения.РеквизитыПроведениеВзаимозачетаКредиторскаяЗадолженность = Неопределено Тогда
			РеквизитыПроведениеВзаимозачетаКредиторскаяЗадолженностьИП = Неопределено;
		Иначе
			РеквизитыПроведениеВзаимозачетаКредиторскаяЗадолженностьИП = 
				ПараметрыПроведения.РеквизитыПроведениеВзаимозачетаКредиторскаяЗадолженность.Скопировать();
		КонецЕсли;
		
		Если НЕ РеквизитыДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ЗачетАвансов
			И НЕ РеквизитыДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ЗачетЗадолженности Тогда
		
			Если НЕ (РеквизитыДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.Прочее
				И РеквизитыДокумента.СчетДт = РеквизитыДокумента.СчетКт
				И РеквизитыДокумента.СубконтоДт1 = РеквизитыДокумента.СубконтоКт1
				И РеквизитыДокумента.СубконтоДт2 = РеквизитыДокумента.СубконтоКт2
				И РеквизитыДокумента.СубконтоДт3 = РеквизитыДокумента.СубконтоКт3
				И РеквизитыДокумента.СуммаКтЗадолженности = РеквизитыДокумента.СуммаДтЗадолженности) Тогда
				
				ПараметрыПроведения.Вставить("РеквизитыПроведениеВзаимозачетаДебиторскаяЗадолженностьИП", Неопределено);
				ПараметрыПроведения.Вставить("РеквизитыПроведениеВзаимозачетаКредиторскаяЗадолженностьИП", Неопределено);
				
			Иначе
				
				ПараметрыПроведения.Вставить("РеквизитыПроведениеВзаимозачетаДебиторскаяЗадолженностьИП",
					РеквизитыПроведениеВзаимозачетаДебиторскаяЗадолженностьИП);

				ПараметрыПроведения.Вставить("РеквизитыПроведениеВзаимозачетаКредиторскаяЗадолженностьИП",
					РеквизитыПроведениеВзаимозачетаКредиторскаяЗадолженностьИП);
				
			КонецЕсли;
			
		Иначе	
			
			ПараметрыПроведения.Вставить("РеквизитыПроведениеВзаимозачетаДебиторскаяЗадолженностьИП",
				РеквизитыПроведениеВзаимозачетаДебиторскаяЗадолженностьИП);

			ПараметрыПроведения.Вставить("РеквизитыПроведениеВзаимозачетаКредиторскаяЗадолженностьИП",
				РеквизитыПроведениеВзаимозачетаКредиторскаяЗадолженностьИП);
			
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат ПараметрыПроведения;
	
КонецФункции 

Функция ТекстЗапросаВременныеТаблицы(НомераТаблиц, ПараметрыПроведения, Реквизиты)

	ТекстЗапроса = "";
	
	Если Реквизиты.ЕстьДебиторскаяЗадолженность Тогда
	
		ТекстЗапроса = ТекстЗапроса
		+	ТекстЗапросаВременнаяТаблицаДебиторскаяЗадолженность(НомераТаблиц);
		
	КонецЕсли;
			
	Если Реквизиты.ЕстьДебиторскаяЗадолженностьВозвратАванса Тогда
		
		ТекстЗапроса = ТекстЗапроса
		+	ТекстЗапросаВременнаяТаблицаДебиторскаяЗадолженностьВозвратАванса(НомераТаблиц);
		
	КонецЕсли;
	
	Если Реквизиты.ЕстьКредиторскаяЗадолженность Тогда
	
		ТекстЗапроса = ТекстЗапроса
		+	ТекстЗапросаВременнаяТаблицаКредиторскаяЗадолженность(НомераТаблиц);

	КонецЕсли;
	
	Если Реквизиты.ЕстьКредиторскаяЗадолженностьВозвратАванса Тогда
		
		ТекстЗапроса = ТекстЗапроса
		+	ТекстЗапросаВременнаяТаблицаКредиторскаяЗадолженностьВозвратАванса(НомераТаблиц);
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВременнаяТаблицаДебиторскаяЗадолженность(НомераТаблиц)
	
	НомераТаблиц.Вставить("ВТ_ДебиторскаяЗадолженность", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаДебиторскаяЗадолженность.Ссылка КАК Ссылка,
	|	ТаблицаДебиторскаяЗадолженность.НомерСтроки КАК НомерСтроки,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	ТаблицаДебиторскаяЗадолженность.Ссылка.КонтрагентДебитор КАК КонтрагентДебитор,
	|	ТаблицаДебиторскаяЗадолженность.Ссылка.КонтрагентКредитор КАК КонтрагентКредитор,
	|	ТаблицаДебиторскаяЗадолженность.КорДоговорКонтрагента КАК ДоговорКредитора,
	|	ТаблицаДебиторскаяЗадолженность.ДоговорКонтрагента.Владелец КАК Контрагент,
	|	ТаблицаДебиторскаяЗадолженность.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ТаблицаДебиторскаяЗадолженность.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	ТаблицаДебиторскаяЗадолженность.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ТаблицаДебиторскаяЗадолженность.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ВЫБОР
	|		КОГДА ТаблицаДебиторскаяЗадолженность.ДоговорКонтрагента.ВалютаВзаиморасчетов = &ВалютаРеглУчета
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК РасчетыВВалюте,
	|	ВЫБОР
	|		КОГДА ТаблицаДебиторскаяЗадолженность.Сделка В (&ДебиторскаяЗадолженностьСделкаПустыеЗначения)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СпособыПогашенияЗадолженности.Автоматически)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СпособыПогашенияЗадолженности.ПоДокументу)
	|	КОНЕЦ КАК СпособПогашенияЗадолженности,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаДебиторскаяЗадолженность.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|			ТОГДА ТаблицаДебиторскаяЗадолженность.КорДоговорКонтрагента.ВалютаВзаиморасчетов
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаДебиторскаяЗадолженность.Ссылка.СубконтоДт2 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|					ТОГДА ТаблицаДебиторскаяЗадолженность.Ссылка.СубконтоДт2.ВалютаВзаиморасчетов
	|				ИНАЧЕ ТаблицаДебиторскаяЗадолженность.ДоговорКонтрагента.ВалютаВзаиморасчетов
	|			КОНЕЦ
	|	КОНЕЦ КАК ВалютаВзаиморасчетовСПолучателем,
	|	ТаблицаДебиторскаяЗадолженность.Сделка КАК ДокументРасчетов,
	|	ТаблицаДебиторскаяЗадолженность.СчетУчетаРасчетов КАК СчетРасчетов,
	|	ТаблицаДебиторскаяЗадолженность.СчетУчетаРасчетов КАК СчетАвансов,
	|	ТаблицаДебиторскаяЗадолженность.КорСчетУчетаРасчетов КАК КорСчетРасчетов,
	|	ТаблицаДебиторскаяЗадолженность.Ссылка.ИспользоватьВспомогательныйСчет КАК ИспользоватьВспомогательныйСчет,
	|	ТаблицаДебиторскаяЗадолженность.Ссылка.СчетДт КАК СчетДт,
	|	ТаблицаДебиторскаяЗадолженность.Ссылка.СубконтоДт1 КАК СубконтоДт1,
	|	ТаблицаДебиторскаяЗадолженность.Ссылка.СубконтоДт2 КАК СубконтоДт2,
	|	ТаблицаДебиторскаяЗадолженность.Ссылка.СубконтоДт3 КАК СубконтоДт3,
	|	ТаблицаДебиторскаяЗадолженность.Ссылка.СчетКт КАК СчетКт,
	|	ТаблицаДебиторскаяЗадолженность.Ссылка.СубконтоКт1 КАК СубконтоКт1,
	|	ТаблицаДебиторскаяЗадолженность.Ссылка.СубконтоКт2 КАК СубконтоКт2,
	|	ТаблицаДебиторскаяЗадолженность.Ссылка.СубконтоКт3 КАК СубконтоКт3,
	|	ТаблицаДебиторскаяЗадолженность.Ссылка.ПодразделениеОрганизации КАК КорПодразделение,
	|	ТаблицаДебиторскаяЗадолженность.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ТаблицаДебиторскаяЗадолженность.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах
	|				ТОГДА ТаблицаДебиторскаяЗадолженность.Сумма
	|			ИНАЧЕ ТаблицаДебиторскаяЗадолженность.СуммаВзаиморасчетов * (ТаблицаДебиторскаяЗадолженность.КурсВзаиморасчетов / ВЫБОР
	|					КОГДА ТаблицаДебиторскаяЗадолженность.КратностьВзаиморасчетов = 0
	|						ТОГДА 1
	|					ИНАЧЕ ТаблицаДебиторскаяЗадолженность.КратностьВзаиморасчетов
	|				КОНЕЦ)
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаРуб,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ТаблицаДебиторскаяЗадолженность.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах
	|				ТОГДА ТаблицаДебиторскаяЗадолженность.СуммаНУ
	|			ИНАЧЕ ТаблицаДебиторскаяЗадолженность.СуммаНУ * (ТаблицаДебиторскаяЗадолженность.КурсВзаиморасчетов / ВЫБОР
	|					КОГДА ТаблицаДебиторскаяЗадолженность.КратностьВзаиморасчетов = 0
	|						ТОГДА 1
	|					ИНАЧЕ ТаблицаДебиторскаяЗадолженность.КратностьВзаиморасчетов
	|				КОНЕЦ)
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаНУ,
	|	ТаблицаДебиторскаяЗадолженность.Ссылка.ВидОперации КАК ВидОперации,
	|	ТаблицаДебиторскаяЗадолженность.Сумма КАК СуммаВВалютеДокумента
	|ПОМЕСТИТЬ ВТ_ДебиторскаяЗадолженность
	|ИЗ
	|	Документ.КорректировкаДолга.ДебиторскаяЗадолженность КАК ТаблицаДебиторскаяЗадолженность
	|ГДЕ
	|	ТаблицаДебиторскаяЗадолженность.Ссылка = &Ссылка
	|	И НЕ &УсловиеДебиторскаяЗадолженностьВозвратАванса
	|	И (НЕ &ЭтоОтложенноеПроведение
	|			ИЛИ ТаблицаДебиторскаяЗадолженность.ДоговорКонтрагента = &ДоговорДляОтложенногоПроведения)";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаВременнаяТаблицаДебиторскаяЗадолженностьВозвратАванса(НомераТаблиц)
	
	НомераТаблиц.Вставить("ВТ_ДебиторскаяЗадолженностьВозвратАванса", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаДебиторскаяЗадолженность.Ссылка КАК Ссылка,
	|	ТаблицаДебиторскаяЗадолженность.НомерСтроки КАК НомерСтроки,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	ТаблицаДебиторскаяЗадолженность.Ссылка.КонтрагентДебитор КАК КонтрагентДебитор,
	|	ТаблицаДебиторскаяЗадолженность.Ссылка.КонтрагентКредитор КАК КонтрагентКредитор,
	|	ТаблицаДебиторскаяЗадолженность.КорДоговорКонтрагента КАК ДоговорКредитора,
	|	ТаблицаДебиторскаяЗадолженность.ДоговорКонтрагента.Владелец КАК Контрагент,
	|	ТаблицаДебиторскаяЗадолженность.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ТаблицаДебиторскаяЗадолженность.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	ТаблицаДебиторскаяЗадолженность.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ТаблицаДебиторскаяЗадолженность.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ВЫБОР
	|		КОГДА ТаблицаДебиторскаяЗадолженность.ДоговорКонтрагента.ВалютаВзаиморасчетов = &ВалютаРеглУчета
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК РасчетыВВалюте,
	|	ВЫБОР
	|		КОГДА ТаблицаДебиторскаяЗадолженность.Сделка В (&ДебиторскаяЗадолженностьСделкаПустыеЗначения)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СпособыПогашенияЗадолженности.Автоматически)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СпособыПогашенияЗадолженности.ПоДокументу)
	|	КОНЕЦ КАК СпособПогашенияЗадолженности,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаДебиторскаяЗадолженность.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|			ТОГДА ТаблицаДебиторскаяЗадолженность.КорДоговорКонтрагента.ВалютаВзаиморасчетов
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаДебиторскаяЗадолженность.Ссылка.СубконтоДт2 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|					ТОГДА ТаблицаДебиторскаяЗадолженность.Ссылка.СубконтоДт2.ВалютаВзаиморасчетов
	|				ИНАЧЕ ТаблицаДебиторскаяЗадолженность.ДоговорКонтрагента.ВалютаВзаиморасчетов
	|			КОНЕЦ
	|	КОНЕЦ КАК ВалютаВзаиморасчетовСПолучателем,
	|	ТаблицаДебиторскаяЗадолженность.Сделка КАК ДокументРасчетов,
	|	ТаблицаДебиторскаяЗадолженность.СчетУчетаРасчетов КАК СчетРасчетов,
	|	ТаблицаДебиторскаяЗадолженность.СчетУчетаРасчетов КАК СчетАвансов,
	|	ТаблицаДебиторскаяЗадолженность.КорСчетУчетаРасчетов КАК КорСчетРасчетов,
	|	ТаблицаДебиторскаяЗадолженность.Ссылка.ИспользоватьВспомогательныйСчет КАК ИспользоватьВспомогательныйСчет,
	|	ТаблицаДебиторскаяЗадолженность.Ссылка.СчетДт КАК СчетДт,
	|	ТаблицаДебиторскаяЗадолженность.Ссылка.СубконтоДт1 КАК СубконтоДт1,
	|	ТаблицаДебиторскаяЗадолженность.Ссылка.СубконтоДт2 КАК СубконтоДт2,
	|	ТаблицаДебиторскаяЗадолженность.Ссылка.СубконтоДт3 КАК СубконтоДт3,
	|	ТаблицаДебиторскаяЗадолженность.Ссылка.СчетКт КАК СчетКт,
	|	ТаблицаДебиторскаяЗадолженность.Ссылка.СубконтоКт1 КАК СубконтоКт1,
	|	ТаблицаДебиторскаяЗадолженность.Ссылка.СубконтоКт2 КАК СубконтоКт2,
	|	ТаблицаДебиторскаяЗадолженность.Ссылка.СубконтоКт3 КАК СубконтоКт3,
	|	ТаблицаДебиторскаяЗадолженность.Ссылка.ПодразделениеОрганизации КАК КорПодразделение,
	|	ТаблицаДебиторскаяЗадолженность.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ТаблицаДебиторскаяЗадолженность.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах
	|				ТОГДА ТаблицаДебиторскаяЗадолженность.Сумма
	|			ИНАЧЕ ТаблицаДебиторскаяЗадолженность.СуммаВзаиморасчетов * (ТаблицаДебиторскаяЗадолженность.КурсВзаиморасчетов / ВЫБОР
	|					КОГДА ТаблицаДебиторскаяЗадолженность.КратностьВзаиморасчетов = 0
	|						ТОГДА 1
	|					ИНАЧЕ ТаблицаДебиторскаяЗадолженность.КратностьВзаиморасчетов
	|				КОНЕЦ)
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаРуб,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ТаблицаДебиторскаяЗадолженность.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах
	|				ТОГДА ТаблицаДебиторскаяЗадолженность.СуммаНУ
	|			ИНАЧЕ ТаблицаДебиторскаяЗадолженность.СуммаНУ * (ТаблицаДебиторскаяЗадолженность.КурсВзаиморасчетов / ВЫБОР
	|					КОГДА ТаблицаДебиторскаяЗадолженность.КратностьВзаиморасчетов = 0
	|						ТОГДА 1
	|					ИНАЧЕ ТаблицаДебиторскаяЗадолженность.КратностьВзаиморасчетов
	|				КОНЕЦ)
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаНУ,
	|	ТаблицаДебиторскаяЗадолженность.Ссылка.ВидОперации КАК ВидОперации,
	|	ТаблицаДебиторскаяЗадолженность.Сумма КАК СуммаВВалютеДокумента
	|ПОМЕСТИТЬ ВТ_ДебиторскаяЗадолженностьВозвратАванса
	|ИЗ
	|	Документ.КорректировкаДолга.ДебиторскаяЗадолженность КАК ТаблицаДебиторскаяЗадолженность
	|ГДЕ
	|	ТаблицаДебиторскаяЗадолженность.Ссылка = &Ссылка
	|	И &УсловиеДебиторскаяЗадолженностьВозвратАванса
	|	И (НЕ &ЭтоОтложенноеПроведение
	|			ИЛИ ТаблицаДебиторскаяЗадолженность.ДоговорКонтрагента = &ДоговорДляОтложенногоПроведения)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	НомерСтроки";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаВременнаяТаблицаКредиторскаяЗадолженность(НомераТаблиц)
	
	НомераТаблиц.Вставить("ВТ_КредиторскаяЗадолженность", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаКредиторскаяЗадолженность.Ссылка КАК Ссылка,
	|	ТаблицаКредиторскаяЗадолженность.НомерСтроки КАК НомерСтроки,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	ТаблицаКредиторскаяЗадолженность.Ссылка.КонтрагентДебитор КАК КонтрагентДебитор,
	|	ТаблицаКредиторскаяЗадолженность.Ссылка.КонтрагентКредитор КАК КонтрагентКредитор,
	|	ТаблицаКредиторскаяЗадолженность.КорДоговорКонтрагента КАК ДоговорКредитора,
	|	ТаблицаКредиторскаяЗадолженность.ДоговорКонтрагента.Владелец КАК Контрагент,
	|	ТаблицаКредиторскаяЗадолженность.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ТаблицаКредиторскаяЗадолженность.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	ТаблицаКредиторскаяЗадолженность.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ТаблицаКредиторскаяЗадолженность.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ВЫБОР
	|		КОГДА ТаблицаКредиторскаяЗадолженность.ДоговорКонтрагента.ВалютаВзаиморасчетов = &ВалютаРеглУчета
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК РасчетыВВалюте,
	|	ВЫБОР
	|		КОГДА ТаблицаКредиторскаяЗадолженность.Сделка В (&КредиторскаяЗадолженностьСделкаПустыеЗначения)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СпособыПогашенияЗадолженности.Автоматически)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СпособыПогашенияЗадолженности.ПоДокументу)
	|	КОНЕЦ КАК СпособПогашенияЗадолженности,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаКредиторскаяЗадолженность.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|			ТОГДА ТаблицаКредиторскаяЗадолженность.КорДоговорКонтрагента.ВалютаВзаиморасчетов
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаКредиторскаяЗадолженность.Ссылка.СубконтоКт2 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|					ТОГДА ТаблицаКредиторскаяЗадолженность.Ссылка.СубконтоКт2.ВалютаВзаиморасчетов
	|				ИНАЧЕ ТаблицаКредиторскаяЗадолженность.ДоговорКонтрагента.ВалютаВзаиморасчетов
	|			КОНЕЦ
	|	КОНЕЦ КАК ВалютаВзаиморасчетовСПолучателем,
	|	ТаблицаКредиторскаяЗадолженность.Сделка КАК ДокументРасчетов,
	|	ТаблицаКредиторскаяЗадолженность.СчетУчетаРасчетов КАК СчетРасчетов,
	|	ТаблицаКредиторскаяЗадолженность.СчетУчетаРасчетов КАК СчетАвансов,
	|	ТаблицаКредиторскаяЗадолженность.КорСчетУчетаРасчетов КАК КорСчетРасчетов,
	|	ТаблицаКредиторскаяЗадолженность.Ссылка.ИспользоватьВспомогательныйСчет КАК ИспользоватьВспомогательныйСчет,
	|	ТаблицаКредиторскаяЗадолженность.Ссылка.СчетДт КАК СчетДт,
	|	ТаблицаКредиторскаяЗадолженность.Ссылка.СубконтоДт1 КАК СубконтоДт1,
	|	ТаблицаКредиторскаяЗадолженность.Ссылка.СубконтоДт2 КАК СубконтоДт2,
	|	ТаблицаКредиторскаяЗадолженность.Ссылка.СубконтоДт3 КАК СубконтоДт3,
	|	ТаблицаКредиторскаяЗадолженность.Ссылка.СчетКт КАК СчетКт,
	|	ТаблицаКредиторскаяЗадолженность.Ссылка.СубконтоКт1 КАК СубконтоКт1,
	|	ТаблицаКредиторскаяЗадолженность.Ссылка.СубконтоКт2 КАК СубконтоКт2,
	|	ТаблицаКредиторскаяЗадолженность.Ссылка.СубконтоКт3 КАК СубконтоКт3,
	|	ТаблицаКредиторскаяЗадолженность.Ссылка.ПодразделениеОрганизации КАК КорПодразделение,
	|	ТаблицаКредиторскаяЗадолженность.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ТаблицаКредиторскаяЗадолженность.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах
	|				ТОГДА ТаблицаКредиторскаяЗадолженность.Сумма
	|			ИНАЧЕ ТаблицаКредиторскаяЗадолженность.СуммаВзаиморасчетов * (ТаблицаКредиторскаяЗадолженность.КурсВзаиморасчетов / ВЫБОР
	|					КОГДА ТаблицаКредиторскаяЗадолженность.КратностьВзаиморасчетов = 0
	|						ТОГДА 1
	|					ИНАЧЕ ТаблицаКредиторскаяЗадолженность.КратностьВзаиморасчетов
	|				КОНЕЦ)
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаРуб,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ТаблицаКредиторскаяЗадолженность.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах
	|				ТОГДА ТаблицаКредиторскаяЗадолженность.СуммаНУ
	|			ИНАЧЕ ТаблицаКредиторскаяЗадолженность.СуммаНУ * (ТаблицаКредиторскаяЗадолженность.КурсВзаиморасчетов / ВЫБОР
	|					КОГДА ТаблицаКредиторскаяЗадолженность.КратностьВзаиморасчетов = 0
	|						ТОГДА 1
	|					ИНАЧЕ ТаблицаКредиторскаяЗадолженность.КратностьВзаиморасчетов
	|				КОНЕЦ)
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаНУ,
	|	ТаблицаКредиторскаяЗадолженность.Ссылка.ВидОперации КАК ВидОперации,
	|	ТаблицаКредиторскаяЗадолженность.Сумма КАК СуммаВВалютеДокумента
	|ПОМЕСТИТЬ ВТ_КредиторскаяЗадолженность
	|ИЗ
	|	Документ.КорректировкаДолга.КредиторскаяЗадолженность КАК ТаблицаКредиторскаяЗадолженность
	|ГДЕ
	|	ТаблицаКредиторскаяЗадолженность.Ссылка = &Ссылка
	|	И НЕ &УсловиеКредиторскаяЗадолженностьВозвратАванса
	|	И (НЕ &ЭтоОтложенноеПроведение
	|			ИЛИ ТаблицаКредиторскаяЗадолженность.ДоговорКонтрагента = &ДоговорДляОтложенногоПроведения)";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстУсловияДебиторскаяЗадолженностьВозвратАванса()
	
	Возврат "(ТаблицаДебиторскаяЗадолженность.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)
	|				ИЛИ ТаблицаДебиторскаяЗадолженность.ДоговорКонтрагента.ВидДоговора В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СКомиссионером), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку))
	|					И ТаблицаДебиторскаяЗадолженность.СчетУчетаРасчетов В
	|						(ВЫБРАТЬ
	|							ВТ_СчетаУчетаРасчетовСПоставщиками.Счет
	|						ИЗ
	|							ВТ_СчетаУчетаРасчетовСПоставщиками)
	|				ИЛИ ТаблицаДебиторскаяЗадолженность.ДоговорКонтрагента.ВидДоговора В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СКомитентом), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку))
	|					И ТаблицаДебиторскаяЗадолженность.СчетУчетаРасчетов В
	|						(ВЫБРАТЬ
	|							ВТ_СчетаУчетаРасчетовСПоставщиками.Счет
	|						ИЗ
	|							ВТ_СчетаУчетаРасчетовСПоставщиками))";
	
	
КонецФункции

Функция ТекстУсловияКредиторскаяЗадолженностьВозвратАванса()

	Возврат "(ТаблицаКредиторскаяЗадолженность.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
	|				ИЛИ ТаблицаКредиторскаяЗадолженность.ДоговорКонтрагента.ВидДоговора В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СКомиссионером), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку))
	|					И ТаблицаКредиторскаяЗадолженность.СчетУчетаРасчетов В
	|						(ВЫБРАТЬ
	|							ВТ_СчетаУчетаРасчетовСПокупателями.Счет
	|						ИЗ
	|							ВТ_СчетаУчетаРасчетовСПокупателями)
	|				ИЛИ ТаблицаКредиторскаяЗадолженность.ДоговорКонтрагента.ВидДоговора В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СКомитентом), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку))
	|					И ТаблицаКредиторскаяЗадолженность.СчетУчетаРасчетов В
	|						(ВЫБРАТЬ
	|							ВТ_СчетаУчетаРасчетовСПокупателями.Счет
	|						ИЗ
	|							ВТ_СчетаУчетаРасчетовСПокупателями))";

КонецФункции

Функция ТекстЗапросаВременнаяТаблицаКредиторскаяЗадолженностьВозвратАванса(НомераТаблиц)
	
	НомераТаблиц.Вставить("ВТ_КредиторскаяЗадолженностьВозвратАванса", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаКредиторскаяЗадолженность.Ссылка КАК Ссылка,
	|	ТаблицаКредиторскаяЗадолженность.НомерСтроки КАК НомерСтроки,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение,
	|	ТаблицаКредиторскаяЗадолженность.Ссылка.КонтрагентДебитор КАК КонтрагентДебитор,
	|	ТаблицаКредиторскаяЗадолженность.Ссылка.КонтрагентКредитор КАК КонтрагентКредитор,
	|	ТаблицаКредиторскаяЗадолженность.КорДоговорКонтрагента КАК ДоговорКредитора,
	|	ТаблицаКредиторскаяЗадолженность.ДоговорКонтрагента.Владелец КАК Контрагент,
	|	ТаблицаКредиторскаяЗадолженность.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ТаблицаКредиторскаяЗадолженность.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	ТаблицаКредиторскаяЗадолженность.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ТаблицаКредиторскаяЗадолженность.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ВЫБОР
	|		КОГДА ТаблицаКредиторскаяЗадолженность.ДоговорКонтрагента.ВалютаВзаиморасчетов = &ВалютаРеглУчета
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК РасчетыВВалюте,
	|	ВЫБОР
	|		КОГДА ТаблицаКредиторскаяЗадолженность.Сделка В (&КредиторскаяЗадолженностьСделкаПустыеЗначения)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СпособыПогашенияЗадолженности.Автоматически)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СпособыПогашенияЗадолженности.ПоДокументу)
	|	КОНЕЦ КАК СпособПогашенияЗадолженности,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаКредиторскаяЗадолженность.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|			ТОГДА ТаблицаКредиторскаяЗадолженность.КорДоговорКонтрагента.ВалютаВзаиморасчетов
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаКредиторскаяЗадолженность.Ссылка.СубконтоКт2 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|					ТОГДА ТаблицаКредиторскаяЗадолженность.Ссылка.СубконтоКт2.ВалютаВзаиморасчетов
	|				ИНАЧЕ ТаблицаКредиторскаяЗадолженность.ДоговорКонтрагента.ВалютаВзаиморасчетов
	|			КОНЕЦ
	|	КОНЕЦ КАК ВалютаВзаиморасчетовСПолучателем,
	|	ТаблицаКредиторскаяЗадолженность.Сделка КАК ДокументРасчетов,
	|	ТаблицаКредиторскаяЗадолженность.СчетУчетаРасчетов КАК СчетРасчетов,
	|	ТаблицаКредиторскаяЗадолженность.СчетУчетаРасчетов КАК СчетАвансов,
	|	ТаблицаКредиторскаяЗадолженность.КорСчетУчетаРасчетов КАК КорСчетРасчетов,
	|	ТаблицаКредиторскаяЗадолженность.Ссылка.ИспользоватьВспомогательныйСчет КАК ИспользоватьВспомогательныйСчет,
	|	ТаблицаКредиторскаяЗадолженность.Ссылка.СчетДт КАК СчетДт,
	|	ТаблицаКредиторскаяЗадолженность.Ссылка.СубконтоДт1 КАК СубконтоДт1,
	|	ТаблицаКредиторскаяЗадолженность.Ссылка.СубконтоДт2 КАК СубконтоДт2,
	|	ТаблицаКредиторскаяЗадолженность.Ссылка.СубконтоДт3 КАК СубконтоДт3,
	|	ТаблицаКредиторскаяЗадолженность.Ссылка.СчетКт КАК СчетКт,
	|	ТаблицаКредиторскаяЗадолженность.Ссылка.СубконтоКт1 КАК СубконтоКт1,
	|	ТаблицаКредиторскаяЗадолженность.Ссылка.СубконтоКт2 КАК СубконтоКт2,
	|	ТаблицаКредиторскаяЗадолженность.Ссылка.СубконтоКт3 КАК СубконтоКт3,
	|	ТаблицаКредиторскаяЗадолженность.Ссылка.ПодразделениеОрганизации КАК КорПодразделение,
	|	ТаблицаКредиторскаяЗадолженность.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ТаблицаКредиторскаяЗадолженность.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах
	|				ТОГДА ТаблицаКредиторскаяЗадолженность.Сумма
	|			ИНАЧЕ ТаблицаКредиторскаяЗадолженность.СуммаВзаиморасчетов * (ТаблицаКредиторскаяЗадолженность.КурсВзаиморасчетов / ВЫБОР
	|					КОГДА ТаблицаКредиторскаяЗадолженность.КратностьВзаиморасчетов = 0
	|						ТОГДА 1
	|					ИНАЧЕ ТаблицаКредиторскаяЗадолженность.КратностьВзаиморасчетов
	|				КОНЕЦ)
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаРуб,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ТаблицаКредиторскаяЗадолженность.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах
	|				ТОГДА ТаблицаКредиторскаяЗадолженность.СуммаНУ
	|			ИНАЧЕ ТаблицаКредиторскаяЗадолженность.СуммаНУ * (ТаблицаКредиторскаяЗадолженность.КурсВзаиморасчетов / ВЫБОР
	|					КОГДА ТаблицаКредиторскаяЗадолженность.КратностьВзаиморасчетов = 0
	|						ТОГДА 1
	|					ИНАЧЕ ТаблицаКредиторскаяЗадолженность.КратностьВзаиморасчетов
	|				КОНЕЦ)
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаНУ,
	|	ТаблицаКредиторскаяЗадолженность.Ссылка.ВидОперации КАК ВидОперации,
	|	ТаблицаКредиторскаяЗадолженность.Сумма КАК СуммаВВалютеДокумента
	|ПОМЕСТИТЬ ВТ_КредиторскаяЗадолженностьВозвратАванса
	|ИЗ
	|	Документ.КорректировкаДолга.КредиторскаяЗадолженность КАК ТаблицаКредиторскаяЗадолженность
	|ГДЕ
	|	ТаблицаКредиторскаяЗадолженность.Ссылка = &Ссылка
	|	И &УсловиеКредиторскаяЗадолженностьВозвратАванса
	|	И (НЕ &ЭтоОтложенноеПроведение
	|			ИЛИ &ОрганизацияПрименяетУСН
	|			ИЛИ ТаблицаКредиторскаяЗадолженность.ДоговорКонтрагента = &ДоговорДляОтложенногоПроведения)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	НомерСтроки";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаРеквизиты(НомераТаблиц)

	НомераТаблиц.Вставить("Реквизиты", НомераТаблиц.Количество());

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	&ОрганизацияПрименяетУСН КАК ПрименяетсяУСН
	|ИЗ
	|	Документ.КорректировкаДолга КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

// Вид операции "Проведение взаимозачета".

Функция ТекстЗапросаРеквизитыПроведениеВзаимозачетаДебиторскаяЗадолженность(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	
	Если НЕ НомераТаблиц.Свойство("ВТ_ДебиторскаяЗадолженность")
		ИЛИ Реквизиты.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности 
		ИЛИ Реквизиты.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности 
		Тогда
		
		ПараметрыПроведения.Вставить("РеквизитыПроведениеВзаимозачетаДебиторскаяЗадолженность", Неопределено);
		Возврат "";
		
	КонецЕсли;
		
	НомераТаблиц.Вставить("РеквизитыПроведениеВзаимозачетаДебиторскаяЗадолженность", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.ВидОперации КАК ВидОперации,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	&ОрганизацияПрименяетУСН КАК УчитыватьЗадолженностьУСН,
	|	&ОрганизацияПрименяетУСНПатент КАК УчитыватьЗадолженностьУСНПатент,
	|	""Поступление"" КАК НаправлениеДвижения,
	|	ЛОЖЬ КАК ЭтоВозврат,
	|	ИСТИНА КАК РасчетыПоРеализации
	|ИЗ
	|	Документ.КорректировкаДолга КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаРеквизитыПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	
	
	Если НЕ НомераТаблиц.Свойство("ВТ_ДебиторскаяЗадолженностьВозвратАванса") 
		ИЛИ Реквизиты.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности 
		ИЛИ Реквизиты.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности 
		Тогда
		
		ПараметрыПроведения.Вставить("РеквизитыПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса", Неопределено);
		Возврат "";
		
	КонецЕсли;
	
	НомераТаблиц.Вставить("РеквизитыПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.ВидОперации КАК ВидОперации,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	&ОрганизацияПрименяетУСН КАК УчитыватьЗадолженностьУСН,
	|	&ОрганизацияПрименяетУСНПатент КАК УчитыватьЗадолженностьУСНПатент,
	|	""Поступление"" КАК НаправлениеДвижения,
	|	ИСТИНА КАК ЭтоВозврат,
	|	ИСТИНА КАК РасчетыПоРеализации
	|ИЗ
	|	Документ.КорректировкаДолга КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаРеквизитыПроведениеВзаимозачетаКредиторскаяЗадолженность(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	
	Если НЕ НомераТаблиц.Свойство("ВТ_КредиторскаяЗадолженность")  
		ИЛИ Реквизиты.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности 
		ИЛИ Реквизиты.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности 
		Тогда
		
		ПараметрыПроведения.Вставить("РеквизитыПроведениеВзаимозачетаКредиторскаяЗадолженность", Неопределено);
		Возврат "";
		
	КонецЕсли;
	
	НомераТаблиц.Вставить("РеквизитыПроведениеВзаимозачетаКредиторскаяЗадолженность", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.ВидОперации КАК ВидОперации,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	&ОрганизацияПрименяетУСН КАК УчитыватьЗадолженностьУСН,
	|	&ОрганизацияПрименяетУСНПатент КАК УчитыватьЗадолженностьУСНПатент,
	|	""Выбытие"" КАК НаправлениеДвижения,
	|	ЛОЖЬ КАК ЭтоВозврат,
	|	ИСТИНА КАК РасчетыПоРеализации
	|ИЗ
	|	Документ.КорректировкаДолга КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();

КонецФункции

Функция ТекстЗапросаРеквизитыПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	
	Если НЕ НомераТаблиц.Свойство("ВТ_КредиторскаяЗадолженностьВозвратАванса")  
		ИЛИ Реквизиты.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности 
		ИЛИ Реквизиты.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности 
		Тогда
		
		ПараметрыПроведения.Вставить("РеквизитыПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса", Неопределено);
		Возврат "";
		
	КонецЕсли;
	
	НомераТаблиц.Вставить("РеквизитыПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.ВидОперации КАК ВидОперации,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	&ОрганизацияПрименяетУСН КАК УчитыватьЗадолженностьУСН,
	|	&ОрганизацияПрименяетУСНПатент КАК УчитыватьЗадолженностьУСНПатент,
	|	""Выбытие"" КАК НаправлениеДвижения,
	|	ИСТИНА КАК ЭтоВозврат,
	|	ИСТИНА КАК РасчетыПоРеализации
	|ИЗ
	|	Документ.КорректировкаДолга КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();

КонецФункции

Функция ТекстЗапросаТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	
	Если НЕ НомераТаблиц.Свойство("ВТ_ДебиторскаяЗадолженность")
		ИЛИ Реквизиты.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности 
		ИЛИ Реквизиты.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности 
		Тогда
		
		ПараметрыПроведения.Вставить("ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность", Неопределено);
		Возврат "";
		
	КонецЕсли;
	
	НомераТаблиц.Вставить("ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаДебиторскаяЗадолженность.Ссылка КАК Ссылка,
	|	ТаблицаДебиторскаяЗадолженность.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДебиторскаяЗадолженность.Подразделение КАК Подразделение,
	|	ТаблицаДебиторскаяЗадолженность.Контрагент КАК Контрагент,
	|	ТаблицаДебиторскаяЗадолженность.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ТаблицаДебиторскаяЗадолженность.ВидДоговора КАК ВидДоговора,
	|	ТаблицаДебиторскаяЗадолженность.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ТаблицаДебиторскаяЗадолженность.ВалютаВзаиморасчетовСПолучателем КАК ВалютаВзаиморасчетовСПолучателем,
	|	ТаблицаДебиторскаяЗадолженность.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ТаблицаДебиторскаяЗадолженность.РасчетыВВалюте КАК РасчетыВВалюте,
	|	ТаблицаДебиторскаяЗадолженность.СпособПогашенияЗадолженности КАК СпособПогашенияЗадолженности,
	|	ТаблицаДебиторскаяЗадолженность.ДокументРасчетов КАК ДокументРасчетов,
	|	ТаблицаДебиторскаяЗадолженность.СчетРасчетов КАК СчетРасчетов,
	|	ТаблицаДебиторскаяЗадолженность.СчетАвансов КАК СчетАвансов,
	|	НЕОПРЕДЕЛЕНО КАК ПорядокОтраженияАванса,
	|	ВЫБОР
	|		КОГДА ТаблицаДебиторскаяЗадолженность.СчетДт = ТаблицаДебиторскаяЗадолженность.СчетКт
	|				И ТаблицаДебиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|				И НЕ ТаблицаДебиторскаяЗадолженность.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|				И НЕ ТаблицаДебиторскаяЗадолженность.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|				И ТаблицаДебиторскаяЗадолженность.СубконтоДт1 = ТаблицаДебиторскаяЗадолженность.СубконтоКт1
	|				И ТаблицаДебиторскаяЗадолженность.СубконтоДт2 = ТаблицаДебиторскаяЗадолженность.СубконтоКт2
	|				И ТаблицаДебиторскаяЗадолженность.СубконтоДт3 = ТаблицаДебиторскаяЗадолженность.СубконтоКт3
	|			ТОГДА ТаблицаДебиторскаяЗадолженность.СчетДт
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|	КОНЕЦ КАК КорСчет,
	|	ВЫБОР
	|		КОГДА ТаблицаДебиторскаяЗадолженность.СчетДт = ТаблицаДебиторскаяЗадолженность.СчетКт
	|				И ТаблицаДебиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|				И НЕ ТаблицаДебиторскаяЗадолженность.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|				И НЕ ТаблицаДебиторскаяЗадолженность.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|				И ТаблицаДебиторскаяЗадолженность.СубконтоДт1 = ТаблицаДебиторскаяЗадолженность.СубконтоКт1
	|				И ТаблицаДебиторскаяЗадолженность.СубконтоДт2 = ТаблицаДебиторскаяЗадолженность.СубконтоКт2
	|				И ТаблицаДебиторскаяЗадолженность.СубконтоДт3 = ТаблицаДебиторскаяЗадолженность.СубконтоКт3
	|			ТОГДА ТаблицаДебиторскаяЗадолженность.СубконтоДт1
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК КорСубконто1,
	|	ВЫБОР
	|		КОГДА ТаблицаДебиторскаяЗадолженность.СчетДт = ТаблицаДебиторскаяЗадолженность.СчетКт
	|				И ТаблицаДебиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|				И НЕ ТаблицаДебиторскаяЗадолженность.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|				И НЕ ТаблицаДебиторскаяЗадолженность.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|				И ТаблицаДебиторскаяЗадолженность.СубконтоДт1 = ТаблицаДебиторскаяЗадолженность.СубконтоКт1
	|				И ТаблицаДебиторскаяЗадолженность.СубконтоДт2 = ТаблицаДебиторскаяЗадолженность.СубконтоКт2
	|				И ТаблицаДебиторскаяЗадолженность.СубконтоДт3 = ТаблицаДебиторскаяЗадолженность.СубконтоКт3
	|			ТОГДА ТаблицаДебиторскаяЗадолженность.СубконтоДт2
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК КорСубконто2,
	|	ВЫБОР
	|		КОГДА ТаблицаДебиторскаяЗадолженность.СчетДт = ТаблицаДебиторскаяЗадолженность.СчетКт
	|				И ТаблицаДебиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|				И НЕ ТаблицаДебиторскаяЗадолженность.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|				И НЕ ТаблицаДебиторскаяЗадолженность.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|				И ТаблицаДебиторскаяЗадолженность.СубконтоДт1 = ТаблицаДебиторскаяЗадолженность.СубконтоКт1
	|				И ТаблицаДебиторскаяЗадолженность.СубконтоДт2 = ТаблицаДебиторскаяЗадолженность.СубконтоКт2
	|				И ТаблицаДебиторскаяЗадолженность.СубконтоДт3 = ТаблицаДебиторскаяЗадолженность.СубконтоКт3
	|			ТОГДА ТаблицаДебиторскаяЗадолженность.СубконтоДт3
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК КорСубконто3,
	|	ТаблицаДебиторскаяЗадолженность.КорПодразделение КАК КорПодразделение,
	|	ТаблицаДебиторскаяЗадолженность.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ТаблицаДебиторскаяЗадолженность.СуммаРуб КАК СуммаРуб,
	|	&СодержаниеПроводкиПроведениеВзаимозачета КАК Содержание
	|ПОМЕСТИТЬ ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность
	|ИЗ
	|	ВТ_ДебиторскаяЗадолженность КАК ТаблицаДебиторскаяЗадолженность
	|ГДЕ
	|	(ТаблицаДебиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.ЗачетЗадолженности)
	|			ИЛИ ТаблицаДебиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.ЗачетАвансов)
	|			ИЛИ ТаблицаДебиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|				И ТаблицаДебиторскаяЗадолженность.СчетДт = ТаблицаДебиторскаяЗадолженность.СчетКт
	|				И ТаблицаДебиторскаяЗадолженность.СубконтоДт1 = ТаблицаДебиторскаяЗадолженность.СубконтоКт1
	|				И ТаблицаДебиторскаяЗадолженность.СубконтоДт2 = ТаблицаДебиторскаяЗадолженность.СубконтоКт2
	|				И ТаблицаДебиторскаяЗадолженность.СубконтоДт3 = ТаблицаДебиторскаяЗадолженность.СубконтоКт3
	|				И ТаблицаДебиторскаяЗадолженность.Ссылка.СуммаДтЗадолженности = ТаблицаДебиторскаяЗадолженность.Ссылка.СуммаКтЗадолженности)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность.Ссылка КАК Ссылка,
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность.НомерСтроки КАК НомерСтроки,
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность.Подразделение КАК Подразделение,
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность.Контрагент КАК Контрагент,
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность.ВидДоговора КАК ВидДоговора,
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность.ВалютаВзаиморасчетовСПолучателем КАК ВалютаВзаиморасчетовСПолучателем,
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность.РасчетыВВалюте КАК РасчетыВВалюте,
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность.СпособПогашенияЗадолженности КАК СпособПогашенияЗадолженности,
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность.ДокументРасчетов КАК ДокументРасчетов,
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность.СчетРасчетов КАК СчетРасчетов,
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность.СчетАвансов КАК СчетАвансов,
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность.ПорядокОтраженияАванса КАК ПорядокОтраженияАванса,
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность.КорСчет КАК КорСчет,
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность.КорСубконто1 КАК КорСубконто1,
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность.КорСубконто2 КАК КорСубконто2,
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность.КорСубконто3 КАК КорСубконто3,
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность.КорПодразделение КАК КорПодразделение,
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность.СуммаРуб КАК СуммаРуб,
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность.Содержание КАК Содержание
	|ИЗ
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность КАК ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность.НомерСтроки";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	
	Если НЕ НомераТаблиц.Свойство("ВТ_ДебиторскаяЗадолженностьВозвратАванса") 
		ИЛИ Реквизиты.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности 
		ИЛИ Реквизиты.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности 
		Тогда
		
		ПараметрыПроведения.Вставить("ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса", Неопределено);
		Возврат "";
		
	КонецЕсли;
	
	НомераТаблиц.Вставить("ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаДебиторскаяЗадолженность.Ссылка КАК Ссылка,
	|	ТаблицаДебиторскаяЗадолженность.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДебиторскаяЗадолженность.Подразделение КАК Подразделение,
	|	ТаблицаДебиторскаяЗадолженность.Контрагент КАК Контрагент,
	|	ТаблицаДебиторскаяЗадолженность.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ТаблицаДебиторскаяЗадолженность.ВидДоговора КАК ВидДоговора,
	|	ТаблицаДебиторскаяЗадолженность.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ТаблицаДебиторскаяЗадолженность.ВалютаВзаиморасчетовСПолучателем КАК ВалютаВзаиморасчетовСПолучателем,
	|	ТаблицаДебиторскаяЗадолженность.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ТаблицаДебиторскаяЗадолженность.РасчетыВВалюте КАК РасчетыВВалюте,
	|	ТаблицаДебиторскаяЗадолженность.СпособПогашенияЗадолженности КАК СпособПогашенияЗадолженности,
	|	ТаблицаДебиторскаяЗадолженность.ДокументРасчетов КАК ДокументРасчетов,
	|	ТаблицаДебиторскаяЗадолженность.СчетРасчетов КАК СчетРасчетов,
	|	ТаблицаДебиторскаяЗадолженность.СчетАвансов КАК СчетАвансов,
	|	НЕОПРЕДЕЛЕНО КАК ПорядокОтраженияАванса,
	|	ВЫБОР
	|		КОГДА ТаблицаДебиторскаяЗадолженность.СчетДт = ТаблицаДебиторскаяЗадолженность.СчетКт
	|				И ТаблицаДебиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|				И НЕ ТаблицаДебиторскаяЗадолженность.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|				И НЕ ТаблицаДебиторскаяЗадолженность.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|				И ТаблицаДебиторскаяЗадолженность.СубконтоДт1 = ТаблицаДебиторскаяЗадолженность.СубконтоКт1
	|				И ТаблицаДебиторскаяЗадолженность.СубконтоДт2 = ТаблицаДебиторскаяЗадолженность.СубконтоКт2
	|				И ТаблицаДебиторскаяЗадолженность.СубконтоДт3 = ТаблицаДебиторскаяЗадолженность.СубконтоКт3
	|			ТОГДА ТаблицаДебиторскаяЗадолженность.СчетДт
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|	КОНЕЦ КАК КорСчет,
	|	ВЫБОР
	|		КОГДА ТаблицаДебиторскаяЗадолженность.СчетДт = ТаблицаДебиторскаяЗадолженность.СчетКт
	|				И ТаблицаДебиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|				И НЕ ТаблицаДебиторскаяЗадолженность.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|				И НЕ ТаблицаДебиторскаяЗадолженность.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|				И ТаблицаДебиторскаяЗадолженность.СубконтоДт1 = ТаблицаДебиторскаяЗадолженность.СубконтоКт1
	|				И ТаблицаДебиторскаяЗадолженность.СубконтоДт2 = ТаблицаДебиторскаяЗадолженность.СубконтоКт2
	|				И ТаблицаДебиторскаяЗадолженность.СубконтоДт3 = ТаблицаДебиторскаяЗадолженность.СубконтоКт3
	|			ТОГДА ТаблицаДебиторскаяЗадолженность.СубконтоДт1
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК КорСубконто1,
	|	ВЫБОР
	|		КОГДА ТаблицаДебиторскаяЗадолженность.СчетДт = ТаблицаДебиторскаяЗадолженность.СчетКт
	|				И ТаблицаДебиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|				И НЕ ТаблицаДебиторскаяЗадолженность.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|				И НЕ ТаблицаДебиторскаяЗадолженность.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|				И ТаблицаДебиторскаяЗадолженность.СубконтоДт1 = ТаблицаДебиторскаяЗадолженность.СубконтоКт1
	|				И ТаблицаДебиторскаяЗадолженность.СубконтоДт2 = ТаблицаДебиторскаяЗадолженность.СубконтоКт2
	|				И ТаблицаДебиторскаяЗадолженность.СубконтоДт3 = ТаблицаДебиторскаяЗадолженность.СубконтоКт3
	|			ТОГДА ТаблицаДебиторскаяЗадолженность.СубконтоДт2
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК КорСубконто2,
	|	ВЫБОР
	|		КОГДА ТаблицаДебиторскаяЗадолженность.СчетДт = ТаблицаДебиторскаяЗадолженность.СчетКт
	|				И ТаблицаДебиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|				И НЕ ТаблицаДебиторскаяЗадолженность.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|				И НЕ ТаблицаДебиторскаяЗадолженность.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|				И ТаблицаДебиторскаяЗадолженность.СубконтоДт1 = ТаблицаДебиторскаяЗадолженность.СубконтоКт1
	|				И ТаблицаДебиторскаяЗадолженность.СубконтоДт2 = ТаблицаДебиторскаяЗадолженность.СубконтоКт2
	|				И ТаблицаДебиторскаяЗадолженность.СубконтоДт3 = ТаблицаДебиторскаяЗадолженность.СубконтоКт3
	|			ТОГДА ТаблицаДебиторскаяЗадолженность.СубконтоДт3
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК КорСубконто3,
	|	ТаблицаДебиторскаяЗадолженность.КорПодразделение КАК КорПодразделение,
	|	ТаблицаДебиторскаяЗадолженность.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ТаблицаДебиторскаяЗадолженность.СуммаРуб КАК СуммаРуб,
	|	&СодержаниеПроводкиПроведениеВзаимозачета КАК Содержание
	|ПОМЕСТИТЬ ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса
	|ИЗ
	|	ВТ_ДебиторскаяЗадолженностьВозвратАванса КАК ТаблицаДебиторскаяЗадолженность
	|ГДЕ
	|	(ТаблицаДебиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.ЗачетЗадолженности)
	|			ИЛИ ТаблицаДебиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.ЗачетАвансов)
	|			ИЛИ ТаблицаДебиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|				И ТаблицаДебиторскаяЗадолженность.СчетДт = ТаблицаДебиторскаяЗадолженность.СчетКт
	|				И ТаблицаДебиторскаяЗадолженность.СубконтоДт1 = ТаблицаДебиторскаяЗадолженность.СубконтоКт1
	|				И ТаблицаДебиторскаяЗадолженность.СубконтоДт2 = ТаблицаДебиторскаяЗадолженность.СубконтоКт2
	|				И ТаблицаДебиторскаяЗадолженность.СубконтоДт3 = ТаблицаДебиторскаяЗадолженность.СубконтоКт3
	|				И ТаблицаДебиторскаяЗадолженность.Ссылка.СуммаДтЗадолженности = ТаблицаДебиторскаяЗадолженность.Ссылка.СуммаКтЗадолженности)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса.Ссылка КАК Ссылка,
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса.НомерСтроки КАК НомерСтроки,
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса.Подразделение КАК Подразделение,
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса.Контрагент КАК Контрагент,
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса.ВидДоговора КАК ВидДоговора,
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса.ВалютаВзаиморасчетовСПолучателем КАК ВалютаВзаиморасчетовСПолучателем,
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса.РасчетыВВалюте КАК РасчетыВВалюте,
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса.СпособПогашенияЗадолженности КАК СпособПогашенияЗадолженности,
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса.ДокументРасчетов КАК ДокументРасчетов,
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса.СчетРасчетов КАК СчетРасчетов,
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса.СчетАвансов КАК СчетАвансов,
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса.ПорядокОтраженияАванса КАК ПорядокОтраженияАванса,
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса.КорСчет КАК КорСчет,
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса.КорСубконто1 КАК КорСубконто1,
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса.КорСубконто2 КАК КорСубконто2,
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса.КорСубконто3 КАК КорСубконто3,
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса.КорПодразделение КАК КорПодразделение,
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса.СуммаРуб КАК СуммаРуб,
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса.Содержание КАК Содержание
	|ИЗ
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса КАК ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса.НомерСтроки";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	
	Если НЕ НомераТаблиц.Свойство("ВТ_КредиторскаяЗадолженность")  
		ИЛИ Реквизиты.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности 
		ИЛИ Реквизиты.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности 
		Тогда
		
		ПараметрыПроведения.Вставить("ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность", Неопределено);
		Возврат "";
		
	КонецЕсли;
	
	НомераТаблиц.Вставить("ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаКредиторскаяЗадолженность.Ссылка КАК Ссылка,
	|	ТаблицаКредиторскаяЗадолженность.НомерСтроки КАК НомерСтроки,
	|	ТаблицаКредиторскаяЗадолженность.Подразделение КАК Подразделение,
	|	ТаблицаКредиторскаяЗадолженность.Контрагент КАК Контрагент,
	|	ТаблицаКредиторскаяЗадолженность.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ТаблицаКредиторскаяЗадолженность.ВидДоговора КАК ВидДоговора,
	|	ТаблицаКредиторскаяЗадолженность.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ТаблицаКредиторскаяЗадолженность.ВалютаВзаиморасчетовСПолучателем КАК ВалютаВзаиморасчетовСПолучателем,
	|	ТаблицаКредиторскаяЗадолженность.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ТаблицаКредиторскаяЗадолженность.РасчетыВВалюте КАК РасчетыВВалюте,
	|	ТаблицаКредиторскаяЗадолженность.СпособПогашенияЗадолженности КАК СпособПогашенияЗадолженности,
	|	ТаблицаКредиторскаяЗадолженность.ДокументРасчетов КАК ДокументРасчетов,
	|	ТаблицаКредиторскаяЗадолженность.СчетРасчетов КАК СчетРасчетов,
	|	ТаблицаКредиторскаяЗадолженность.СчетАвансов КАК СчетАвансов,
	|	НЕОПРЕДЕЛЕНО КАК ПорядокОтраженияАванса,
	|	ВЫБОР
	|		КОГДА ТаблицаКредиторскаяЗадолженность.СчетДт = ТаблицаКредиторскаяЗадолженность.СчетКт
	|				И ТаблицаКредиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|				И НЕ ТаблицаКредиторскаяЗадолженность.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|				И НЕ ТаблицаКредиторскаяЗадолженность.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|				И ТаблицаКредиторскаяЗадолженность.СубконтоДт1 = ТаблицаКредиторскаяЗадолженность.СубконтоКт1
	|				И ТаблицаКредиторскаяЗадолженность.СубконтоДт2 = ТаблицаКредиторскаяЗадолженность.СубконтоКт2
	|				И ТаблицаКредиторскаяЗадолженность.СубконтоДт3 = ТаблицаКредиторскаяЗадолженность.СубконтоКт3
	|			ТОГДА ТаблицаКредиторскаяЗадолженность.СчетДт
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|	КОНЕЦ КАК КорСчет,
	|	ВЫБОР
	|		КОГДА ТаблицаКредиторскаяЗадолженность.СчетДт = ТаблицаКредиторскаяЗадолженность.СчетКт
	|				И ТаблицаКредиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|				И НЕ ТаблицаКредиторскаяЗадолженность.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|				И НЕ ТаблицаКредиторскаяЗадолженность.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|				И ТаблицаКредиторскаяЗадолженность.СубконтоДт1 = ТаблицаКредиторскаяЗадолженность.СубконтоКт1
	|				И ТаблицаКредиторскаяЗадолженность.СубконтоДт2 = ТаблицаКредиторскаяЗадолженность.СубконтоКт2
	|				И ТаблицаКредиторскаяЗадолженность.СубконтоДт3 = ТаблицаКредиторскаяЗадолженность.СубконтоКт3
	|			ТОГДА ТаблицаКредиторскаяЗадолженность.СубконтоДт1
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК КорСубконто1,
	|	ВЫБОР
	|		КОГДА ТаблицаКредиторскаяЗадолженность.СчетДт = ТаблицаКредиторскаяЗадолженность.СчетКт
	|				И ТаблицаКредиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|				И НЕ ТаблицаКредиторскаяЗадолженность.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|				И НЕ ТаблицаКредиторскаяЗадолженность.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|				И ТаблицаКредиторскаяЗадолженность.СубконтоДт1 = ТаблицаКредиторскаяЗадолженность.СубконтоКт1
	|				И ТаблицаКредиторскаяЗадолженность.СубконтоДт2 = ТаблицаКредиторскаяЗадолженность.СубконтоКт2
	|				И ТаблицаКредиторскаяЗадолженность.СубконтоДт3 = ТаблицаКредиторскаяЗадолженность.СубконтоКт3
	|			ТОГДА ТаблицаКредиторскаяЗадолженность.СубконтоДт2
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК КорСубконто2,
	|	ВЫБОР
	|		КОГДА ТаблицаКредиторскаяЗадолженность.СчетДт = ТаблицаКредиторскаяЗадолженность.СчетКт
	|				И ТаблицаКредиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|				И НЕ ТаблицаКредиторскаяЗадолженность.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|				И НЕ ТаблицаКредиторскаяЗадолженность.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|				И ТаблицаКредиторскаяЗадолженность.СубконтоДт1 = ТаблицаКредиторскаяЗадолженность.СубконтоКт1
	|				И ТаблицаКредиторскаяЗадолженность.СубконтоДт2 = ТаблицаКредиторскаяЗадолженность.СубконтоКт2
	|				И ТаблицаКредиторскаяЗадолженность.СубконтоДт3 = ТаблицаКредиторскаяЗадолженность.СубконтоКт3
	|			ТОГДА ТаблицаКредиторскаяЗадолженность.СубконтоДт3
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК КорСубконто3,
	|	ТаблицаКредиторскаяЗадолженность.КорПодразделение КАК КорПодразделение,
	|	ТаблицаКредиторскаяЗадолженность.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ТаблицаКредиторскаяЗадолженность.СуммаРуб КАК СуммаРуб,
	|	&СодержаниеПроводкиПроведениеВзаимозачета КАК Содержание
	|ПОМЕСТИТЬ ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность
	|ИЗ
	|	ВТ_КредиторскаяЗадолженность КАК ТаблицаКредиторскаяЗадолженность
	|ГДЕ
	|	(ТаблицаКредиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.ЗачетЗадолженности)
	|			ИЛИ ТаблицаКредиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.ЗачетАвансов)
	|			ИЛИ ТаблицаКредиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|				И ТаблицаКредиторскаяЗадолженность.СчетДт = ТаблицаКредиторскаяЗадолженность.СчетКт
	|				И ТаблицаКредиторскаяЗадолженность.СубконтоДт1 = ТаблицаКредиторскаяЗадолженность.СубконтоКт1
	|				И ТаблицаКредиторскаяЗадолженность.СубконтоДт2 = ТаблицаКредиторскаяЗадолженность.СубконтоКт2
	|				И ТаблицаКредиторскаяЗадолженность.СубконтоДт3 = ТаблицаКредиторскаяЗадолженность.СубконтоКт3
	|				И ТаблицаКредиторскаяЗадолженность.Ссылка.СуммаДтЗадолженности = ТаблицаКредиторскаяЗадолженность.Ссылка.СуммаКтЗадолженности)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность.Ссылка КАК Ссылка,
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность.НомерСтроки КАК НомерСтроки,
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность.Подразделение КАК Подразделение,
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность.Контрагент КАК Контрагент,
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность.ВидДоговора КАК ВидДоговора,
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность.ВалютаВзаиморасчетовСПолучателем КАК ВалютаВзаиморасчетовСПолучателем,
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность.РасчетыВВалюте КАК РасчетыВВалюте,
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность.СпособПогашенияЗадолженности КАК СпособПогашенияЗадолженности,
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность.ДокументРасчетов КАК ДокументРасчетов,
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность.СчетРасчетов КАК СчетРасчетов,
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность.СчетАвансов КАК СчетАвансов,
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность.ПорядокОтраженияАванса КАК ПорядокОтраженияАванса,
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность.КорСчет КАК КорСчет,
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность.КорСубконто1 КАК КорСубконто1,
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность.КорСубконто2 КАК КорСубконто2,
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность.КорСубконто3 КАК КорСубконто3,
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность.КорПодразделение КАК КорПодразделение,
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность.СуммаРуб КАК СуммаРуб,
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность.Содержание КАК Содержание
	|ИЗ
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность КАК ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность.НомерСтроки";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	
	Если НЕ НомераТаблиц.Свойство("ВТ_КредиторскаяЗадолженностьВозвратАванса")  
		ИЛИ Реквизиты.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности 
		ИЛИ Реквизиты.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности 
		Тогда
		
		ПараметрыПроведения.Вставить("ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса", Неопределено);
		Возврат "";
		
	КонецЕсли;
		
	НомераТаблиц.Вставить("ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаКредиторскаяЗадолженность.Ссылка КАК Ссылка,
	|	ТаблицаКредиторскаяЗадолженность.НомерСтроки КАК НомерСтроки,
	|	ТаблицаКредиторскаяЗадолженность.Подразделение КАК Подразделение,
	|	ТаблицаКредиторскаяЗадолженность.Контрагент КАК Контрагент,
	|	ТаблицаКредиторскаяЗадолженность.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ТаблицаКредиторскаяЗадолженность.ВидДоговора КАК ВидДоговора,
	|	ТаблицаКредиторскаяЗадолженность.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ТаблицаКредиторскаяЗадолженность.ВалютаВзаиморасчетовСПолучателем КАК ВалютаВзаиморасчетовСПолучателем,
	|	ТаблицаКредиторскаяЗадолженность.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ТаблицаКредиторскаяЗадолженность.РасчетыВВалюте КАК РасчетыВВалюте,
	|	ТаблицаКредиторскаяЗадолженность.СпособПогашенияЗадолженности КАК СпособПогашенияЗадолженности,
	|	ТаблицаКредиторскаяЗадолженность.ДокументРасчетов КАК ДокументРасчетов,
	|	ТаблицаКредиторскаяЗадолженность.СчетРасчетов КАК СчетРасчетов,
	|	ТаблицаКредиторскаяЗадолженность.СчетАвансов КАК СчетАвансов,
	|	НЕОПРЕДЕЛЕНО КАК ПорядокОтраженияАванса,
	|	ВЫБОР
	|		КОГДА ТаблицаКредиторскаяЗадолженность.СчетДт = ТаблицаКредиторскаяЗадолженность.СчетКт
	|				И ТаблицаКредиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|				И НЕ ТаблицаКредиторскаяЗадолженность.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|				И НЕ ТаблицаКредиторскаяЗадолженность.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|				И ТаблицаКредиторскаяЗадолженность.СубконтоДт1 = ТаблицаКредиторскаяЗадолженность.СубконтоКт1
	|				И ТаблицаКредиторскаяЗадолженность.СубконтоДт2 = ТаблицаКредиторскаяЗадолженность.СубконтоКт2
	|				И ТаблицаКредиторскаяЗадолженность.СубконтоДт3 = ТаблицаКредиторскаяЗадолженность.СубконтоКт3
	|			ТОГДА ТаблицаКредиторскаяЗадолженность.СчетДт
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|	КОНЕЦ КАК КорСчет,
	|	ВЫБОР
	|		КОГДА ТаблицаКредиторскаяЗадолженность.СчетДт = ТаблицаКредиторскаяЗадолженность.СчетКт
	|				И ТаблицаКредиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|				И НЕ ТаблицаКредиторскаяЗадолженность.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|				И НЕ ТаблицаКредиторскаяЗадолженность.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|				И ТаблицаКредиторскаяЗадолженность.СубконтоДт1 = ТаблицаКредиторскаяЗадолженность.СубконтоКт1
	|				И ТаблицаКредиторскаяЗадолженность.СубконтоДт2 = ТаблицаКредиторскаяЗадолженность.СубконтоКт2
	|				И ТаблицаКредиторскаяЗадолженность.СубконтоДт3 = ТаблицаКредиторскаяЗадолженность.СубконтоКт3
	|			ТОГДА ТаблицаКредиторскаяЗадолженность.СубконтоДт1
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК КорСубконто1,
	|	ВЫБОР
	|		КОГДА ТаблицаКредиторскаяЗадолженность.СчетДт = ТаблицаКредиторскаяЗадолженность.СчетКт
	|				И ТаблицаКредиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|				И НЕ ТаблицаКредиторскаяЗадолженность.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|				И НЕ ТаблицаКредиторскаяЗадолженность.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|				И ТаблицаКредиторскаяЗадолженность.СубконтоДт1 = ТаблицаКредиторскаяЗадолженность.СубконтоКт1
	|				И ТаблицаКредиторскаяЗадолженность.СубконтоДт2 = ТаблицаКредиторскаяЗадолженность.СубконтоКт2
	|				И ТаблицаКредиторскаяЗадолженность.СубконтоДт3 = ТаблицаКредиторскаяЗадолженность.СубконтоКт3
	|			ТОГДА ТаблицаКредиторскаяЗадолженность.СубконтоДт2
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК КорСубконто2,
	|	ВЫБОР
	|		КОГДА ТаблицаКредиторскаяЗадолженность.СчетДт = ТаблицаКредиторскаяЗадолженность.СчетКт
	|				И ТаблицаКредиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|				И НЕ ТаблицаКредиторскаяЗадолженность.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|				И НЕ ТаблицаКредиторскаяЗадолженность.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|				И ТаблицаКредиторскаяЗадолженность.СубконтоДт1 = ТаблицаКредиторскаяЗадолженность.СубконтоКт1
	|				И ТаблицаКредиторскаяЗадолженность.СубконтоДт2 = ТаблицаКредиторскаяЗадолженность.СубконтоКт2
	|				И ТаблицаКредиторскаяЗадолженность.СубконтоДт3 = ТаблицаКредиторскаяЗадолженность.СубконтоКт3
	|			ТОГДА ТаблицаКредиторскаяЗадолженность.СубконтоДт3
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК КорСубконто3,
	|	ТаблицаКредиторскаяЗадолженность.КорПодразделение КАК КорПодразделение,
	|	ТаблицаКредиторскаяЗадолженность.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ТаблицаКредиторскаяЗадолженность.СуммаРуб КАК СуммаРуб,
	|	&СодержаниеПроводкиПроведениеВзаимозачета КАК Содержание
	|ПОМЕСТИТЬ ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса
	|ИЗ
	|	ВТ_КредиторскаяЗадолженностьВозвратАванса КАК ТаблицаКредиторскаяЗадолженность
	|ГДЕ
	|	(ТаблицаКредиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.ЗачетЗадолженности)
	|			ИЛИ ТаблицаКредиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.ЗачетАвансов)
	|			ИЛИ ТаблицаКредиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|				И ТаблицаКредиторскаяЗадолженность.СчетДт = ТаблицаКредиторскаяЗадолженность.СчетКт
	|				И ТаблицаКредиторскаяЗадолженность.СубконтоДт1 = ТаблицаКредиторскаяЗадолженность.СубконтоКт1
	|				И ТаблицаКредиторскаяЗадолженность.СубконтоДт2 = ТаблицаКредиторскаяЗадолженность.СубконтоКт2
	|				И ТаблицаКредиторскаяЗадолженность.СубконтоДт3 = ТаблицаКредиторскаяЗадолженность.СубконтоКт3
	|				И ТаблицаКредиторскаяЗадолженность.Ссылка.СуммаДтЗадолженности = ТаблицаКредиторскаяЗадолженность.Ссылка.СуммаКтЗадолженности)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса.Ссылка КАК Ссылка,
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса.НомерСтроки КАК НомерСтроки,
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса.Подразделение КАК Подразделение,
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса.Контрагент КАК Контрагент,
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса.ВидДоговора КАК ВидДоговора,
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса.ВалютаВзаиморасчетовСПолучателем КАК ВалютаВзаиморасчетовСПолучателем,
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса.РасчетыВВалюте КАК РасчетыВВалюте,
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса.СпособПогашенияЗадолженности КАК СпособПогашенияЗадолженности,
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса.ДокументРасчетов КАК ДокументРасчетов,
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса.СчетРасчетов КАК СчетРасчетов,
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса.СчетАвансов КАК СчетАвансов,
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса.ПорядокОтраженияАванса КАК ПорядокОтраженияАванса,
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса.КорСчет КАК КорСчет,
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса.КорСубконто1 КАК КорСубконто1,
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса.КорСубконто2 КАК КорСубконто2,
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса.КорСубконто3 КАК КорСубконто3,
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса.КорПодразделение КАК КорПодразделение,
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса.СуммаРуб КАК СуммаРуб,
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса.Содержание КАК Содержание
	|ИЗ
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса КАК ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса.НомерСтроки";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
		
КонецФункции

// Вид операции "Перенос задолженности".

Функция ТекстЗапросаРеквизитыПереносЗадолженностиДебиторскаяЗадолженность(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	
	Если НЕ НомераТаблиц.Свойство("ВТ_ДебиторскаяЗадолженность")  
		ИЛИ Реквизиты.ВидОперации <> Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности 
			И Реквизиты.ВидОперации <> Перечисления.ВидыОперацийКорректировкаДолга.Прочее
		Тогда
		
		ПараметрыПроведения.Вставить("РеквизитыПереносЗадолженностиДебиторскаяЗадолженность", Неопределено);
		Возврат "";
		
	КонецЕсли;
		
	НомераТаблиц.Вставить("РеквизитыПереносЗадолженностиДебиторскаяЗадолженность", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.ВидОперации КАК ВидОперации,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	&ОрганизацияПрименяетУСН КАК УчитыватьЗадолженностьУСН,
	|	&ОрганизацияПрименяетУСНПатент КАК УчитыватьЗадолженностьУСНПатент,
	|	""Поступление"" КАК НаправлениеДвижения,
	|	ЛОЖЬ КАК ЭтоВозврат,
	|	ИСТИНА РасчетыПоРеализации
	|ИЗ
	|	Документ.КорректировкаДолга КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаРеквизитыПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	
	Если НЕ НомераТаблиц.Свойство("ВТ_ДебиторскаяЗадолженностьВозвратАванса")  
		ИЛИ Реквизиты.ВидОперации <> Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности 
			И Реквизиты.ВидОперации <> Перечисления.ВидыОперацийКорректировкаДолга.Прочее
		Тогда
		
		ПараметрыПроведения.Вставить("РеквизитыПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса", Неопределено);
		Возврат "";
		
	КонецЕсли;
	
	НомераТаблиц.Вставить("РеквизитыПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.ВидОперации КАК ВидОперации,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	&ОрганизацияПрименяетУСН КАК УчитыватьЗадолженностьУСН,
	|	&ОрганизацияПрименяетУСНПатент КАК УчитыватьЗадолженностьУСНПатент,
	|	""Поступление"" КАК НаправлениеДвижения,
	|	ИСТИНА КАК ЭтоВозврат,
	|	ИСТИНА РасчетыПоРеализации
	|ИЗ
	|	Документ.КорректировкаДолга КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаРеквизитыПереносЗадолженностиКредиторскаяЗадолженность(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	
	Если НЕ НомераТаблиц.Свойство("ВТ_КредиторскаяЗадолженность")  
		ИЛИ Реквизиты.ВидОперации <> Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности 
			И Реквизиты.ВидОперации <> Перечисления.ВидыОперацийКорректировкаДолга.Прочее
		Тогда
		
		ПараметрыПроведения.Вставить("РеквизитыПереносЗадолженностиКредиторскаяЗадолженность", Неопределено);
		Возврат "";
		
	КонецЕсли;
	
	НомераТаблиц.Вставить("РеквизитыПереносЗадолженностиКредиторскаяЗадолженность", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.ВидОперации КАК ВидОперации,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	&ОрганизацияПрименяетУСН КАК УчитыватьЗадолженностьУСН,
	|	&ОрганизацияПрименяетУСНПатент КАК УчитыватьЗадолженностьУСНПатент,
	|	""Выбытие"" КАК НаправлениеДвижения,
	|	ЛОЖЬ КАК ЭтоВозврат,
	|	ИСТИНА РасчетыПоРеализации
	|ИЗ
	|	Документ.КорректировкаДолга КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаРеквизитыПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	
	Если НЕ НомераТаблиц.Свойство("ВТ_КредиторскаяЗадолженностьВозвратАванса")  
		ИЛИ Реквизиты.ВидОперации <> Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности 
			И Реквизиты.ВидОперации <> Перечисления.ВидыОперацийКорректировкаДолга.Прочее
		Тогда
		
		ПараметрыПроведения.Вставить("РеквизитыПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса", Неопределено);
		Возврат "";
		
	КонецЕсли;
	
	НомераТаблиц.Вставить("РеквизитыПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.ВидОперации КАК ВидОперации,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	&ОрганизацияПрименяетУСН КАК УчитыватьЗадолженностьУСН,
	|	&ОрганизацияПрименяетУСНПатент КАК УчитыватьЗадолженностьУСНПатент,
	|	""Выбытие"" КАК НаправлениеДвижения,
	|	ИСТИНА КАК ЭтоВозврат,
	|	ИСТИНА РасчетыПоРеализации
	|ИЗ
	|	Документ.КорректировкаДолга КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаТаблицаПереносЗадолженностиДебиторскаяЗадолженность(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	
	Если НЕ НомераТаблиц.Свойство("ВТ_ДебиторскаяЗадолженность")  
		ИЛИ Реквизиты.ВидОперации <> Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности 
			И Реквизиты.ВидОперации <> Перечисления.ВидыОперацийКорректировкаДолга.Прочее
		Тогда
		
		ПараметрыПроведения.Вставить("ТаблицаПереносЗадолженностиДебиторскаяЗадолженность", Неопределено);
		Возврат "";
		
	КонецЕсли;
		
	НомераТаблиц.Вставить("ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТаблицаПереносЗадолженностиДебиторскаяЗадолженность", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаДебиторскаяЗадолженность.Ссылка КАК Ссылка,
	|	ТаблицаДебиторскаяЗадолженность.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДебиторскаяЗадолженность.Подразделение КАК Подразделение,
	|	ТаблицаДебиторскаяЗадолженность.Контрагент КАК Контрагент,
	|	ТаблицаДебиторскаяЗадолженность.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ТаблицаДебиторскаяЗадолженность.ВидДоговора КАК ВидДоговора,
	|	ТаблицаДебиторскаяЗадолженность.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ТаблицаДебиторскаяЗадолженность.ВалютаВзаиморасчетовСПолучателем КАК ВалютаВзаиморасчетовСПолучателем,
	|	ТаблицаДебиторскаяЗадолженность.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ТаблицаДебиторскаяЗадолженность.РасчетыВВалюте КАК РасчетыВВалюте,
	|	ТаблицаДебиторскаяЗадолженность.СпособПогашенияЗадолженности КАК СпособПогашенияЗадолженности,
	|	ТаблицаДебиторскаяЗадолженность.ДокументРасчетов КАК ДокументРасчетов,
	|	ТаблицаДебиторскаяЗадолженность.СчетРасчетов КАК СчетРасчетов,
	|	ТаблицаДебиторскаяЗадолженность.СчетАвансов КАК СчетАвансов,
	|	НЕОПРЕДЕЛЕНО КАК ПорядокОтраженияАванса,
	|	ВЫБОР
	|		КОГДА ТаблицаДебиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|			ТОГДА ТаблицаДебиторскаяЗадолженность.СчетДт
	|		ИНАЧЕ ТаблицаДебиторскаяЗадолженность.КорСчетРасчетов
	|	КОНЕЦ КАК КорСчет,
	|	ВЫБОР
	|		КОГДА ТаблицаДебиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|			ТОГДА ТаблицаДебиторскаяЗадолженность.СубконтоДт1
	|		ИНАЧЕ ТаблицаДебиторскаяЗадолженность.КонтрагентКредитор
	|	КОНЕЦ КАК КорСубконто1,
	|	ВЫБОР
	|		КОГДА ТаблицаДебиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|			ТОГДА ТаблицаДебиторскаяЗадолженность.СубконтоДт2
	|		ИНАЧЕ ТаблицаДебиторскаяЗадолженность.ДоговорКредитора
	|	КОНЕЦ КАК КорСубконто2,
	|	ВЫБОР
	|		КОГДА ТаблицаДебиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|			ТОГДА ТаблицаДебиторскаяЗадолженность.СубконтоДт3
	|		КОГДА ТаблицаДебиторскаяЗадолженность.Контрагент = ТаблицаДебиторскаяЗадолженность.КонтрагентКредитор
	|				И ТаблицаДебиторскаяЗадолженность.СчетРасчетов = ТаблицаДебиторскаяЗадолженность.КорСчетРасчетов
	|			ТОГДА ТаблицаДебиторскаяЗадолженность.ДокументРасчетов
	|		ИНАЧЕ ТаблицаДебиторскаяЗадолженность.Ссылка
	|	КОНЕЦ КАК КорСубконто3,
	|	ТаблицаДебиторскаяЗадолженность.КорПодразделение КАК КорПодразделение,
	|	ТаблицаДебиторскаяЗадолженность.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ТаблицаДебиторскаяЗадолженность.СуммаРуб КАК СуммаРуб,
	|	&СодержаниеПроводкиПереносЗадолженности КАК Содержание
	|ПОМЕСТИТЬ ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность
	|ИЗ
	|	ВТ_ДебиторскаяЗадолженность КАК ТаблицаДебиторскаяЗадолженность
	|ГДЕ
	|	(ТаблицаДебиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.ПереносЗадолженности)
	|			ИЛИ ТаблицаДебиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|				И НЕ ТаблицаДебиторскаяЗадолженность.СчетДт = ТаблицаДебиторскаяЗадолженность.СчетКт
	|				И НЕ ТаблицаДебиторскаяЗадолженность.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|				И (ТаблицаДебиторскаяЗадолженность.СубконтоДт1 ССЫЛКА Справочник.Контрагенты
	|					ИЛИ ТаблицаДебиторскаяЗадолженность.СубконтоДт2 ССЫЛКА Справочник.Контрагенты
	|					ИЛИ ТаблицаДебиторскаяЗадолженность.СубконтоДт3 ССЫЛКА Справочник.Контрагенты)
	|				И (ТаблицаДебиторскаяЗадолженность.СубконтоДт1 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|					ИЛИ ТаблицаДебиторскаяЗадолженность.СубконтоДт2 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|					ИЛИ ТаблицаДебиторскаяЗадолженность.СубконтоДт3 ССЫЛКА Справочник.ДоговорыКонтрагентов)
	|			ИЛИ ТаблицаДебиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|				И ТаблицаДебиторскаяЗадолженность.СчетДт = ТаблицаДебиторскаяЗадолженность.СчетКт
	|				И ТаблицаДебиторскаяЗадолженность.СубконтоДт1 = ТаблицаДебиторскаяЗадолженность.СубконтоКт1
	|				И ТаблицаДебиторскаяЗадолженность.СубконтоДт2 = ТаблицаДебиторскаяЗадолженность.СубконтоКт2
	|				И ТаблицаДебиторскаяЗадолженность.СубконтоДт3 = ТаблицаДебиторскаяЗадолженность.СубконтоКт3
	|				И (ТаблицаДебиторскаяЗадолженность.СубконтоДт1 ССЫЛКА Справочник.Контрагенты
	|					ИЛИ ТаблицаДебиторскаяЗадолженность.СубконтоДт2 ССЫЛКА Справочник.Контрагенты
	|					ИЛИ ТаблицаДебиторскаяЗадолженность.СубконтоДт3 ССЫЛКА Справочник.Контрагенты)
	|				И (ТаблицаДебиторскаяЗадолженность.СубконтоДт1 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|					ИЛИ ТаблицаДебиторскаяЗадолженность.СубконтоДт2 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|					ИЛИ ТаблицаДебиторскаяЗадолженность.СубконтоДт3 ССЫЛКА Справочник.ДоговорыКонтрагентов)
	|				И НЕ ТаблицаДебиторскаяЗадолженность.Ссылка.СуммаДтЗадолженности = ТаблицаДебиторскаяЗадолженность.Ссылка.СуммаКтЗадолженности)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность.Ссылка КАК Ссылка,
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность.НомерСтроки КАК НомерСтроки,
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность.Подразделение КАК Подразделение,
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность.Контрагент КАК Контрагент,
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность.ВидДоговора КАК ВидДоговора,
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность.ВалютаВзаиморасчетовСПолучателем КАК ВалютаВзаиморасчетовСПолучателем,
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность.РасчетыВВалюте КАК РасчетыВВалюте,
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность.СпособПогашенияЗадолженности КАК СпособПогашенияЗадолженности,
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность.ДокументРасчетов КАК ДокументРасчетов,
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность.СчетРасчетов КАК СчетРасчетов,
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность.СчетАвансов КАК СчетАвансов,
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность.ПорядокОтраженияАванса КАК ПорядокОтраженияАванса,
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность.КорСчет КАК КорСчет,
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность.КорСубконто1 КАК КорСубконто1,
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность.КорСубконто2 КАК КорСубконто2,
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность.КорСубконто3 КАК КорСубконто3,
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность.КорПодразделение КАК КорПодразделение,
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность.СуммаРуб КАК СуммаРуб,
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность.Содержание КАК Содержание
	|ИЗ
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность КАК ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность.НомерСтроки";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	
	Если НЕ НомераТаблиц.Свойство("ВТ_ДебиторскаяЗадолженностьВозвратАванса")   
		ИЛИ Реквизиты.ВидОперации <> Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности 
			И Реквизиты.ВидОперации <> Перечисления.ВидыОперацийКорректировкаДолга.Прочее
		Тогда
		
		ПараметрыПроведения.Вставить("ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса", Неопределено);
		Возврат "";
		
	КонецЕсли;
		
	НомераТаблиц.Вставить("ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаДебиторскаяЗадолженность.Ссылка КАК Ссылка,
	|	ТаблицаДебиторскаяЗадолженность.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДебиторскаяЗадолженность.Подразделение КАК Подразделение,
	|	ТаблицаДебиторскаяЗадолженность.Контрагент КАК Контрагент,
	|	ТаблицаДебиторскаяЗадолженность.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ТаблицаДебиторскаяЗадолженность.ВидДоговора КАК ВидДоговора,
	|	ТаблицаДебиторскаяЗадолженность.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ТаблицаДебиторскаяЗадолженность.ВалютаВзаиморасчетовСПолучателем КАК ВалютаВзаиморасчетовСПолучателем,
	|	ТаблицаДебиторскаяЗадолженность.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ТаблицаДебиторскаяЗадолженность.РасчетыВВалюте КАК РасчетыВВалюте,
	|	ТаблицаДебиторскаяЗадолженность.СпособПогашенияЗадолженности КАК СпособПогашенияЗадолженности,
	|	ТаблицаДебиторскаяЗадолженность.ДокументРасчетов КАК ДокументРасчетов,
	|	ТаблицаДебиторскаяЗадолженность.СчетРасчетов КАК СчетРасчетов,
	|	ТаблицаДебиторскаяЗадолженность.СчетАвансов КАК СчетАвансов,
	|	НЕОПРЕДЕЛЕНО КАК ПорядокОтраженияАванса,
	|	ВЫБОР
	|		КОГДА ТаблицаДебиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|			ТОГДА ТаблицаДебиторскаяЗадолженность.СчетДт
	|		ИНАЧЕ ТаблицаДебиторскаяЗадолженность.КорСчетРасчетов
	|	КОНЕЦ КАК КорСчет,
	|	ВЫБОР
	|		КОГДА ТаблицаДебиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|			ТОГДА ТаблицаДебиторскаяЗадолженность.СубконтоДт1
	|		ИНАЧЕ ТаблицаДебиторскаяЗадолженность.КонтрагентКредитор
	|	КОНЕЦ КАК КорСубконто1,
	|	ВЫБОР
	|		КОГДА ТаблицаДебиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|			ТОГДА ТаблицаДебиторскаяЗадолженность.СубконтоДт2
	|		ИНАЧЕ ТаблицаДебиторскаяЗадолженность.ДоговорКредитора
	|	КОНЕЦ КАК КорСубконто2,
	|	ВЫБОР
	|		КОГДА ТаблицаДебиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|			ТОГДА ТаблицаДебиторскаяЗадолженность.СубконтоДт3
	|		КОГДА ТаблицаДебиторскаяЗадолженность.Контрагент = ТаблицаДебиторскаяЗадолженность.КонтрагентКредитор
	|				И ТаблицаДебиторскаяЗадолженность.СчетРасчетов = ТаблицаДебиторскаяЗадолженность.КорСчетРасчетов
	|			ТОГДА ТаблицаДебиторскаяЗадолженность.ДокументРасчетов
	|		ИНАЧЕ ТаблицаДебиторскаяЗадолженность.Ссылка
	|	КОНЕЦ КАК КорСубконто3,
	|	ТаблицаДебиторскаяЗадолженность.КорПодразделение КАК КорПодразделение,
	|	ТаблицаДебиторскаяЗадолженность.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ТаблицаДебиторскаяЗадолженность.СуммаРуб КАК СуммаРуб,
	|	&СодержаниеПроводкиПереносЗадолженности КАК Содержание
	|ПОМЕСТИТЬ ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса
	|ИЗ
	|	ВТ_ДебиторскаяЗадолженностьВозвратАванса КАК ТаблицаДебиторскаяЗадолженность
	|ГДЕ
	|	(ТаблицаДебиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.ПереносЗадолженности)
	|			ИЛИ ТаблицаДебиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|				И НЕ ТаблицаДебиторскаяЗадолженность.СчетДт = ТаблицаДебиторскаяЗадолженность.СчетКт
	|				И НЕ ТаблицаДебиторскаяЗадолженность.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|				И (ТаблицаДебиторскаяЗадолженность.СубконтоДт1 ССЫЛКА Справочник.Контрагенты
	|					ИЛИ ТаблицаДебиторскаяЗадолженность.СубконтоДт2 ССЫЛКА Справочник.Контрагенты
	|					ИЛИ ТаблицаДебиторскаяЗадолженность.СубконтоДт3 ССЫЛКА Справочник.Контрагенты)
	|				И (ТаблицаДебиторскаяЗадолженность.СубконтоДт1 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|					ИЛИ ТаблицаДебиторскаяЗадолженность.СубконтоДт2 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|					ИЛИ ТаблицаДебиторскаяЗадолженность.СубконтоДт3 ССЫЛКА Справочник.ДоговорыКонтрагентов)
	|			ИЛИ ТаблицаДебиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|				И ТаблицаДебиторскаяЗадолженность.СчетДт = ТаблицаДебиторскаяЗадолженность.СчетКт
	|				И ТаблицаДебиторскаяЗадолженность.СубконтоДт1 = ТаблицаДебиторскаяЗадолженность.СубконтоКт1
	|				И ТаблицаДебиторскаяЗадолженность.СубконтоДт2 = ТаблицаДебиторскаяЗадолженность.СубконтоКт2
	|				И ТаблицаДебиторскаяЗадолженность.СубконтоДт3 = ТаблицаДебиторскаяЗадолженность.СубконтоКт3
	|				И (ТаблицаДебиторскаяЗадолженность.СубконтоДт1 ССЫЛКА Справочник.Контрагенты
	|					ИЛИ ТаблицаДебиторскаяЗадолженность.СубконтоДт2 ССЫЛКА Справочник.Контрагенты
	|					ИЛИ ТаблицаДебиторскаяЗадолженность.СубконтоДт3 ССЫЛКА Справочник.Контрагенты)
	|				И (ТаблицаДебиторскаяЗадолженность.СубконтоДт1 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|					ИЛИ ТаблицаДебиторскаяЗадолженность.СубконтоДт2 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|					ИЛИ ТаблицаДебиторскаяЗадолженность.СубконтоДт3 ССЫЛКА Справочник.ДоговорыКонтрагентов)
	|				И НЕ ТаблицаДебиторскаяЗадолженность.Ссылка.СуммаДтЗадолженности = ТаблицаДебиторскаяЗадолженность.Ссылка.СуммаКтЗадолженности)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса.Ссылка КАК Ссылка,
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса.НомерСтроки КАК НомерСтроки,
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса.Подразделение КАК Подразделение,
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса.Контрагент КАК Контрагент,
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса.ВидДоговора КАК ВидДоговора,
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса.ВалютаВзаиморасчетовСПолучателем КАК ВалютаВзаиморасчетовСПолучателем,
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса.РасчетыВВалюте КАК РасчетыВВалюте,
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса.СпособПогашенияЗадолженности КАК СпособПогашенияЗадолженности,
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса.ДокументРасчетов КАК ДокументРасчетов,
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса.СчетРасчетов КАК СчетРасчетов,
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса.СчетАвансов КАК СчетАвансов,
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса.ПорядокОтраженияАванса КАК ПорядокОтраженияАванса,
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса.КорСчет КАК КорСчет,
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса.КорСубконто1 КАК КорСубконто1,
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса.КорСубконто2 КАК КорСубконто2,
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса.КорСубконто3 КАК КорСубконто3,
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса.КорПодразделение КАК КорПодразделение,
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса.СуммаРуб КАК СуммаРуб,
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса.Содержание КАК Содержание
	|ИЗ
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса КАК ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса.НомерСтроки";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаТаблицаПереносЗадолженностиКредиторскаяЗадолженность(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	
	Если НЕ НомераТаблиц.Свойство("ВТ_КредиторскаяЗадолженность")   
		ИЛИ Реквизиты.ВидОперации <> Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности 
			И Реквизиты.ВидОперации <> Перечисления.ВидыОперацийКорректировкаДолга.Прочее
		Тогда
		
		ПараметрыПроведения.Вставить("ТаблицаПереносЗадолженностиКредиторскаяЗадолженность", Неопределено);
		Возврат "";
		
	КонецЕсли;
		
	НомераТаблиц.Вставить("ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТаблицаПереносЗадолженностиКредиторскаяЗадолженность", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаКредиторскаяЗадолженность.Ссылка КАК Ссылка,
	|	ТаблицаКредиторскаяЗадолженность.НомерСтроки КАК НомерСтроки,
	|	ТаблицаКредиторскаяЗадолженность.Подразделение КАК Подразделение,
	|	ТаблицаКредиторскаяЗадолженность.Контрагент КАК Контрагент,
	|	ТаблицаКредиторскаяЗадолженность.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ТаблицаКредиторскаяЗадолженность.ВидДоговора КАК ВидДоговора,
	|	ТаблицаКредиторскаяЗадолженность.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ТаблицаКредиторскаяЗадолженность.ВалютаВзаиморасчетовСПолучателем КАК ВалютаВзаиморасчетовСПолучателем,
	|	ТаблицаКредиторскаяЗадолженность.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ТаблицаКредиторскаяЗадолженность.РасчетыВВалюте КАК РасчетыВВалюте,
	|	ТаблицаКредиторскаяЗадолженность.СпособПогашенияЗадолженности КАК СпособПогашенияЗадолженности,
	|	ТаблицаКредиторскаяЗадолженность.ДокументРасчетов КАК ДокументРасчетов,
	|	ТаблицаКредиторскаяЗадолженность.СчетРасчетов КАК СчетРасчетов,
	|	ТаблицаКредиторскаяЗадолженность.СчетАвансов КАК СчетАвансов,
	|	НЕОПРЕДЕЛЕНО КАК ПорядокОтраженияАванса,
	|	ВЫБОР
	|		КОГДА ТаблицаКредиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|			ТОГДА ТаблицаКредиторскаяЗадолженность.СчетКт
	|		ИНАЧЕ ТаблицаКредиторскаяЗадолженность.КорСчетРасчетов
	|	КОНЕЦ КАК КорСчет,
	|	ВЫБОР
	|		КОГДА ТаблицаКредиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|			ТОГДА ТаблицаКредиторскаяЗадолженность.СубконтоКт1
	|		ИНАЧЕ ТаблицаКредиторскаяЗадолженность.КонтрагентКредитор
	|	КОНЕЦ КАК КорСубконто1,
	|	ВЫБОР
	|		КОГДА ТаблицаКредиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|			ТОГДА ТаблицаКредиторскаяЗадолженность.СубконтоКт2
	|		ИНАЧЕ ТаблицаКредиторскаяЗадолженность.ДоговорКредитора
	|	КОНЕЦ КАК КорСубконто2,
	|	ВЫБОР
	|		КОГДА ТаблицаКредиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|			ТОГДА ТаблицаКредиторскаяЗадолженность.СубконтоКт3
	|		КОГДА ТаблицаКредиторскаяЗадолженность.Контрагент = ТаблицаКредиторскаяЗадолженность.КонтрагентКредитор
	|				И ТаблицаКредиторскаяЗадолженность.СчетРасчетов = ТаблицаКредиторскаяЗадолженность.КорСчетРасчетов
	|			ТОГДА ТаблицаКредиторскаяЗадолженность.ДокументРасчетов
	|		ИНАЧЕ ТаблицаКредиторскаяЗадолженность.Ссылка
	|	КОНЕЦ КАК КорСубконто3,
	|	ТаблицаКредиторскаяЗадолженность.КорПодразделение КАК КорПодразделение,
	|	ТаблицаКредиторскаяЗадолженность.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ТаблицаКредиторскаяЗадолженность.СуммаРуб КАК СуммаРуб,
	|	&СодержаниеПроводкиПереносЗадолженности КАК Содержание
	|ПОМЕСТИТЬ ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность
	|ИЗ
	|	ВТ_КредиторскаяЗадолженность КАК ТаблицаКредиторскаяЗадолженность
	|ГДЕ
	|	(ТаблицаКредиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.ПереносЗадолженности)
	|			ИЛИ ТаблицаКредиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|				И НЕ ТаблицаКредиторскаяЗадолженность.СчетДт = ТаблицаКредиторскаяЗадолженность.СчетКт
	|				И НЕ ТаблицаКредиторскаяЗадолженность.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|				И (ТаблицаКредиторскаяЗадолженность.СубконтоКт1 ССЫЛКА Справочник.Контрагенты
	|					ИЛИ ТаблицаКредиторскаяЗадолженность.СубконтоКт2 ССЫЛКА Справочник.Контрагенты
	|					ИЛИ ТаблицаКредиторскаяЗадолженность.СубконтоКт3 ССЫЛКА Справочник.Контрагенты)
	|				И (ТаблицаКредиторскаяЗадолженность.СубконтоКт1 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|					ИЛИ ТаблицаКредиторскаяЗадолженность.СубконтоКт2 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|					ИЛИ ТаблицаКредиторскаяЗадолженность.СубконтоКт3 ССЫЛКА Справочник.ДоговорыКонтрагентов)
	|			ИЛИ ТаблицаКредиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|				И ТаблицаКредиторскаяЗадолженность.СчетДт = ТаблицаКредиторскаяЗадолженность.СчетКт
	|				И ТаблицаКредиторскаяЗадолженность.СубконтоДт1 = ТаблицаКредиторскаяЗадолженность.СубконтоКт1
	|				И ТаблицаКредиторскаяЗадолженность.СубконтоДт2 = ТаблицаКредиторскаяЗадолженность.СубконтоКт2
	|				И ТаблицаКредиторскаяЗадолженность.СубконтоДт3 = ТаблицаКредиторскаяЗадолженность.СубконтоКт3
	|				И (ТаблицаКредиторскаяЗадолженность.СубконтоДт1 ССЫЛКА Справочник.Контрагенты
	|					ИЛИ ТаблицаКредиторскаяЗадолженность.СубконтоДт2 ССЫЛКА Справочник.Контрагенты
	|					ИЛИ ТаблицаКредиторскаяЗадолженность.СубконтоДт3 ССЫЛКА Справочник.Контрагенты)
	|				И (ТаблицаКредиторскаяЗадолженность.СубконтоДт1 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|					ИЛИ ТаблицаКредиторскаяЗадолженность.СубконтоДт2 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|					ИЛИ ТаблицаКредиторскаяЗадолженность.СубконтоДт3 ССЫЛКА Справочник.ДоговорыКонтрагентов)
	|				И НЕ ТаблицаКредиторскаяЗадолженность.Ссылка.СуммаДтЗадолженности = ТаблицаКредиторскаяЗадолженность.Ссылка.СуммаКтЗадолженности)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность.Ссылка КАК Ссылка,
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность.НомерСтроки КАК НомерСтроки,
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность.Подразделение КАК Подразделение,
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность.Контрагент КАК Контрагент,
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность.ВидДоговора КАК ВидДоговора,
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность.ВалютаВзаиморасчетовСПолучателем КАК ВалютаВзаиморасчетовСПолучателем,
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность.РасчетыВВалюте КАК РасчетыВВалюте,
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность.СпособПогашенияЗадолженности КАК СпособПогашенияЗадолженности,
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность.ДокументРасчетов КАК ДокументРасчетов,
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность.СчетРасчетов КАК СчетРасчетов,
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность.СчетАвансов КАК СчетАвансов,
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность.ПорядокОтраженияАванса КАК ПорядокОтраженияАванса,
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность.КорСчет КАК КорСчет,
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность.КорСубконто1 КАК КорСубконто1,
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность.КорСубконто2 КАК КорСубконто2,
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность.КорСубконто3 КАК КорСубконто3,
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность.КорПодразделение КАК КорПодразделение,
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность.СуммаРуб КАК СуммаРуб,
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность.Содержание КАК Содержание
	|ИЗ
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность КАК ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность.НомерСтроки";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	
	Если НЕ НомераТаблиц.Свойство("ВТ_КредиторскаяЗадолженностьВозвратАванса")   
		ИЛИ Реквизиты.ВидОперации <> Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности 
			И Реквизиты.ВидОперации <> Перечисления.ВидыОперацийКорректировкаДолга.Прочее
		Тогда
		
		ПараметрыПроведения.Вставить("ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса", Неопределено);
		Возврат "";
		
	КонецЕсли;
		
	НомераТаблиц.Вставить("ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаКредиторскаяЗадолженность.Ссылка КАК Ссылка,
	|	ТаблицаКредиторскаяЗадолженность.НомерСтроки КАК НомерСтроки,
	|	ТаблицаКредиторскаяЗадолженность.Подразделение КАК Подразделение,
	|	ТаблицаКредиторскаяЗадолженность.Контрагент КАК Контрагент,
	|	ТаблицаКредиторскаяЗадолженность.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ТаблицаКредиторскаяЗадолженность.ВидДоговора КАК ВидДоговора,
	|	ТаблицаКредиторскаяЗадолженность.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ТаблицаКредиторскаяЗадолженность.ВалютаВзаиморасчетовСПолучателем КАК ВалютаВзаиморасчетовСПолучателем,
	|	ТаблицаКредиторскаяЗадолженность.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ТаблицаКредиторскаяЗадолженность.РасчетыВВалюте КАК РасчетыВВалюте,
	|	ТаблицаКредиторскаяЗадолженность.СпособПогашенияЗадолженности КАК СпособПогашенияЗадолженности,
	|	ТаблицаКредиторскаяЗадолженность.ДокументРасчетов КАК ДокументРасчетов,
	|	ТаблицаКредиторскаяЗадолженность.СчетРасчетов КАК СчетРасчетов,
	|	ТаблицаКредиторскаяЗадолженность.СчетАвансов КАК СчетАвансов,
	|	НЕОПРЕДЕЛЕНО КАК ПорядокОтраженияАванса,
	|	ВЫБОР
	|		КОГДА ТаблицаКредиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|			ТОГДА ТаблицаКредиторскаяЗадолженность.СчетКт
	|		ИНАЧЕ ТаблицаКредиторскаяЗадолженность.КорСчетРасчетов
	|	КОНЕЦ КАК КорСчет,
	|	ВЫБОР
	|		КОГДА ТаблицаКредиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|			ТОГДА ТаблицаКредиторскаяЗадолженность.СубконтоКт1
	|		ИНАЧЕ ТаблицаКредиторскаяЗадолженность.КонтрагентКредитор
	|	КОНЕЦ КАК КорСубконто1,
	|	ВЫБОР
	|		КОГДА ТаблицаКредиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|			ТОГДА ТаблицаКредиторскаяЗадолженность.СубконтоКт2
	|		ИНАЧЕ ТаблицаКредиторскаяЗадолженность.ДоговорКредитора
	|	КОНЕЦ КАК КорСубконто2,
	|	ВЫБОР
	|		КОГДА ТаблицаКредиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|			ТОГДА ТаблицаКредиторскаяЗадолженность.СубконтоКт3
	|		КОГДА ТаблицаКредиторскаяЗадолженность.Контрагент = ТаблицаКредиторскаяЗадолженность.КонтрагентКредитор
	|				И ТаблицаКредиторскаяЗадолженность.СчетРасчетов = ТаблицаКредиторскаяЗадолженность.КорСчетРасчетов
	|			ТОГДА ТаблицаКредиторскаяЗадолженность.ДокументРасчетов
	|		ИНАЧЕ ТаблицаКредиторскаяЗадолженность.Ссылка
	|	КОНЕЦ КАК КорСубконто3,
	|	ТаблицаКредиторскаяЗадолженность.КорПодразделение КАК КорПодразделение,
	|	ТаблицаКредиторскаяЗадолженность.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ТаблицаКредиторскаяЗадолженность.СуммаРуб КАК СуммаРуб,
	|	&СодержаниеПроводкиПереносЗадолженности КАК Содержание
	|ПОМЕСТИТЬ ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса
	|ИЗ
	|	ВТ_КредиторскаяЗадолженностьВозвратАванса КАК ТаблицаКредиторскаяЗадолженность
	|ГДЕ
	|	(ТаблицаКредиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.ПереносЗадолженности)
	|			ИЛИ ТаблицаКредиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|				И НЕ ТаблицаКредиторскаяЗадолженность.СчетДт = ТаблицаКредиторскаяЗадолженность.СчетКт
	|				И НЕ ТаблицаКредиторскаяЗадолженность.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|				И (ТаблицаКредиторскаяЗадолженность.СубконтоКт1 ССЫЛКА Справочник.Контрагенты
	|					ИЛИ ТаблицаКредиторскаяЗадолженность.СубконтоКт2 ССЫЛКА Справочник.Контрагенты
	|					ИЛИ ТаблицаКредиторскаяЗадолженность.СубконтоКт3 ССЫЛКА Справочник.Контрагенты)
	|				И (ТаблицаКредиторскаяЗадолженность.СубконтоКт1 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|					ИЛИ ТаблицаКредиторскаяЗадолженность.СубконтоКт2 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|					ИЛИ ТаблицаКредиторскаяЗадолженность.СубконтоКт3 ССЫЛКА Справочник.ДоговорыКонтрагентов)
	|			ИЛИ ТаблицаКредиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|				И ТаблицаКредиторскаяЗадолженность.СчетДт = ТаблицаКредиторскаяЗадолженность.СчетКт
	|				И ТаблицаКредиторскаяЗадолженность.СубконтоДт1 = ТаблицаКредиторскаяЗадолженность.СубконтоКт1
	|				И ТаблицаКредиторскаяЗадолженность.СубконтоДт2 = ТаблицаКредиторскаяЗадолженность.СубконтоКт2
	|				И ТаблицаКредиторскаяЗадолженность.СубконтоДт3 = ТаблицаКредиторскаяЗадолженность.СубконтоКт3
	|				И (ТаблицаКредиторскаяЗадолженность.СубконтоДт1 ССЫЛКА Справочник.Контрагенты
	|					ИЛИ ТаблицаКредиторскаяЗадолженность.СубконтоДт2 ССЫЛКА Справочник.Контрагенты
	|					ИЛИ ТаблицаКредиторскаяЗадолженность.СубконтоДт3 ССЫЛКА Справочник.Контрагенты)
	|				И (ТаблицаКредиторскаяЗадолженность.СубконтоДт1 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|					ИЛИ ТаблицаКредиторскаяЗадолженность.СубконтоДт2 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|					ИЛИ ТаблицаКредиторскаяЗадолженность.СубконтоДт3 ССЫЛКА Справочник.ДоговорыКонтрагентов)
	|				И НЕ ТаблицаКредиторскаяЗадолженность.Ссылка.СуммаДтЗадолженности = ТаблицаКредиторскаяЗадолженность.Ссылка.СуммаКтЗадолженности)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса.Ссылка КАК Ссылка,
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса.НомерСтроки КАК НомерСтроки,
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса.Подразделение КАК Подразделение,
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса.Контрагент КАК Контрагент,
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса.ВидДоговора КАК ВидДоговора,
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса.ВалютаВзаиморасчетовСПолучателем КАК ВалютаВзаиморасчетовСПолучателем,
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса.РасчетыВВалюте КАК РасчетыВВалюте,
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса.СпособПогашенияЗадолженности КАК СпособПогашенияЗадолженности,
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса.ДокументРасчетов КАК ДокументРасчетов,
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса.СчетРасчетов КАК СчетРасчетов,
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса.СчетАвансов КАК СчетАвансов,
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса.ПорядокОтраженияАванса КАК ПорядокОтраженияАванса,
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса.КорСчет КАК КорСчет,
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса.КорСубконто1 КАК КорСубконто1,
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса.КорСубконто2 КАК КорСубконто2,
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса.КорСубконто3 КАК КорСубконто3,
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса.КорПодразделение КАК КорПодразделение,
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса.СуммаРуб КАК СуммаРуб,
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса.Содержание КАК Содержание
	|ИЗ
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса КАК ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса.НомерСтроки";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

// Вид операции "Списание задолженности".

Функция ТекстЗапросаРеквизитыСписаниеЗадолженностиДебиторскаяЗадолженность(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	
	Если НЕ НомераТаблиц.Свойство("ВТ_ДебиторскаяЗадолженность")   
		ИЛИ Реквизиты.ВидОперации <> Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности 
			И Реквизиты.ВидОперации <> Перечисления.ВидыОперацийКорректировкаДолга.Прочее
		Тогда
		
		ПараметрыПроведения.Вставить("РеквизитыСписаниеЗадолженностиДебиторскаяЗадолженность", Неопределено);
		Возврат "";
		
	КонецЕсли;
	
	НомераТаблиц.Вставить("РеквизитыСписаниеЗадолженностиДебиторскаяЗадолженность", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.ВидОперации КАК ВидОперации,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	&ОрганизацияПрименяетУСН КАК УчитыватьЗадолженностьУСН,
	|	&ОрганизацияПрименяетУСНПатент КАК УчитыватьЗадолженностьУСНПатент,
	|	""Поступление"" КАК НаправлениеДвижения,
	|	ЛОЖЬ КАК ЭтоВозврат,
	|	ИСТИНА РасчетыПоРеализации
	|ИЗ
	|	Документ.КорректировкаДолга КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();

КонецФункции

Функция ТекстЗапросаРеквизитыСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	
	Если НЕ НомераТаблиц.Свойство("ВТ_ДебиторскаяЗадолженностьВозвратАванса")   
		ИЛИ Реквизиты.ВидОперации <> Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности 
			И Реквизиты.ВидОперации <> Перечисления.ВидыОперацийКорректировкаДолга.Прочее
		Тогда
		
		ПараметрыПроведения.Вставить("РеквизитыСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса", Неопределено);
		Возврат "";
		
	КонецЕсли;
	
	НомераТаблиц.Вставить("РеквизитыСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.ВидОперации КАК ВидОперации,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	&ОрганизацияПрименяетУСН КАК УчитыватьЗадолженностьУСН,
	|	&ОрганизацияПрименяетУСНПатент КАК УчитыватьЗадолженностьУСНПатент,
	|	""Поступление"" КАК НаправлениеДвижения,
	|	ИСТИНА КАК ЭтоВозврат,
	|	ИСТИНА РасчетыПоРеализации
	|ИЗ
	|	Документ.КорректировкаДолга КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();

КонецФункции

Функция ТекстЗапросаРеквизитыСписаниеЗадолженностиКредиторскаяЗадолженность(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	
	Если НЕ НомераТаблиц.Свойство("ВТ_КредиторскаяЗадолженность")   
		ИЛИ Реквизиты.ВидОперации <> Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности 
			И Реквизиты.ВидОперации <> Перечисления.ВидыОперацийКорректировкаДолга.Прочее
		Тогда
		
		ПараметрыПроведения.Вставить("РеквизитыСписаниеЗадолженностиКредиторскаяЗадолженность", Неопределено);
		Возврат "";
		
	КонецЕсли;
	
	НомераТаблиц.Вставить("РеквизитыСписаниеЗадолженностиКредиторскаяЗадолженность", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.ВидОперации КАК ВидОперации,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	&ОрганизацияПрименяетУСН КАК УчитыватьЗадолженностьУСН,
	|	&ОрганизацияПрименяетУСНПатент КАК УчитыватьЗадолженностьУСНПатент,
	|	""Выбытие"" КАК НаправлениеДвижения,
	|	ЛОЖЬ КАК ЭтоВозврат,
	|	ИСТИНА РасчетыПоРеализации
	|ИЗ
	|	Документ.КорректировкаДолга КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();

КонецФункции

Функция ТекстЗапросаРеквизитыСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	
	Если НЕ НомераТаблиц.Свойство("ВТ_КредиторскаяЗадолженностьВозвратАванса")   
		ИЛИ Реквизиты.ВидОперации <> Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности 
			И Реквизиты.ВидОперации <> Перечисления.ВидыОперацийКорректировкаДолга.Прочее
		Тогда
		
		ПараметрыПроведения.Вставить("РеквизитыСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса", Неопределено);
		Возврат "";
		
	КонецЕсли;
	
	НомераТаблиц.Вставить("РеквизитыСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.ВидОперации КАК ВидОперации,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	&ОрганизацияПрименяетУСН КАК УчитыватьЗадолженностьУСН,
	|	&ОрганизацияПрименяетУСНПатент КАК УчитыватьЗадолженностьУСНПатент,
	|	""Выбытие"" КАК НаправлениеДвижения,
	|	ИСТИНА КАК ЭтоВозврат,
	|	ИСТИНА РасчетыПоРеализации
	|ИЗ
	|	Документ.КорректировкаДолга КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();

КонецФункции

Функция ТекстЗапросаТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	
	Если НЕ НомераТаблиц.Свойство("ВТ_ДебиторскаяЗадолженность")   
		ИЛИ Реквизиты.ВидОперации <> Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности 
			И Реквизиты.ВидОперации <> Перечисления.ВидыОперацийКорректировкаДолга.Прочее
		Тогда
		
		ПараметрыПроведения.Вставить("ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность", Неопределено);
		Возврат "";
		
	КонецЕсли;
		
	НомераТаблиц.Вставить("ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаДебиторскаяЗадолженность.Ссылка КАК Ссылка,
	|	ТаблицаДебиторскаяЗадолженность.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДебиторскаяЗадолженность.Подразделение КАК Подразделение,
	|	ТаблицаДебиторскаяЗадолженность.Контрагент КАК Контрагент,
	|	ТаблицаДебиторскаяЗадолженность.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ТаблицаДебиторскаяЗадолженность.ВидДоговора КАК ВидДоговора,
	|	ТаблицаДебиторскаяЗадолженность.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ТаблицаДебиторскаяЗадолженность.ВалютаВзаиморасчетовСПолучателем КАК ВалютаВзаиморасчетовСПолучателем,
	|	ТаблицаДебиторскаяЗадолженность.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ТаблицаДебиторскаяЗадолженность.РасчетыВВалюте КАК РасчетыВВалюте,
	|	ТаблицаДебиторскаяЗадолженность.СпособПогашенияЗадолженности КАК СпособПогашенияЗадолженности,
	|	ТаблицаДебиторскаяЗадолженность.ДокументРасчетов КАК ДокументРасчетов,
	|	ТаблицаДебиторскаяЗадолженность.СчетРасчетов КАК СчетРасчетов,
	|	ТаблицаДебиторскаяЗадолженность.СчетАвансов КАК СчетАвансов,
	|	НЕОПРЕДЕЛЕНО КАК ПорядокОтраженияАванса,
	|	ТаблицаДебиторскаяЗадолженность.СчетДт КАК КорСчет,
	|	ТаблицаДебиторскаяЗадолженность.СубконтоДт1 КАК КорСубконто1,
	|	ТаблицаДебиторскаяЗадолженность.СубконтоДт2 КАК КорСубконто2,
	|	ТаблицаДебиторскаяЗадолженность.СубконтоДт3 КАК КорСубконто3,
	|	ТаблицаДебиторскаяЗадолженность.КорПодразделение КАК КорПодразделение,
	|	ТаблицаДебиторскаяЗадолженность.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ТаблицаДебиторскаяЗадолженность.СуммаРуб КАК СуммаРуб,
	|	ТаблицаДебиторскаяЗадолженность.СуммаНУ КАК СуммаНУ,
	|	&СодержаниеПроводкиСписаниеЗадолженности КАК Содержание
	|ПОМЕСТИТЬ ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность
	|ИЗ
	|	ВТ_ДебиторскаяЗадолженность КАК ТаблицаДебиторскаяЗадолженность
	|ГДЕ
	|	(ТаблицаДебиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности)
	|			ИЛИ ТаблицаДебиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|				И НЕ ТаблицаДебиторскаяЗадолженность.СчетДт = ТаблицаДебиторскаяЗадолженность.СчетКт
	|				И НЕ ТаблицаДебиторскаяЗадолженность.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|				И (НЕ ТаблицаДебиторскаяЗадолженность.СубконтоДт1 ССЫЛКА Справочник.Контрагенты
	|						И НЕ ТаблицаДебиторскаяЗадолженность.СубконтоДт2 ССЫЛКА Справочник.Контрагенты
	|						И НЕ ТаблицаДебиторскаяЗадолженность.СубконтоДт3 ССЫЛКА Справочник.Контрагенты
	|					ИЛИ НЕ ТаблицаДебиторскаяЗадолженность.СубконтоДт1 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|						И НЕ ТаблицаДебиторскаяЗадолженность.СубконтоДт2 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|						И НЕ ТаблицаДебиторскаяЗадолженность.СубконтоДт3 ССЫЛКА Справочник.ДоговорыКонтрагентов)
	|			ИЛИ ТаблицаДебиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|				И ТаблицаДебиторскаяЗадолженность.СчетДт = ТаблицаДебиторскаяЗадолженность.СчетКт
	|				И ТаблицаДебиторскаяЗадолженность.СубконтоДт1 = ТаблицаДебиторскаяЗадолженность.СубконтоКт1
	|				И ТаблицаДебиторскаяЗадолженность.СубконтоДт2 = ТаблицаДебиторскаяЗадолженность.СубконтоКт2
	|				И ТаблицаДебиторскаяЗадолженность.СубконтоДт3 = ТаблицаДебиторскаяЗадолженность.СубконтоКт3
	|				И (НЕ ТаблицаДебиторскаяЗадолженность.СубконтоДт1 ССЫЛКА Справочник.Контрагенты
	|						И НЕ ТаблицаДебиторскаяЗадолженность.СубконтоДт2 ССЫЛКА Справочник.Контрагенты
	|					ИЛИ НЕ ТаблицаДебиторскаяЗадолженность.СубконтоДт1 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|						И НЕ ТаблицаДебиторскаяЗадолженность.СубконтоДт2 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|						И НЕ ТаблицаДебиторскаяЗадолженность.СубконтоДт3 ССЫЛКА Справочник.ДоговорыКонтрагентов)
	|				И НЕ ТаблицаДебиторскаяЗадолженность.Ссылка.СуммаДтЗадолженности = ТаблицаДебиторскаяЗадолженность.Ссылка.СуммаКтЗадолженности)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность.Ссылка КАК Ссылка,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность.НомерСтроки КАК НомерСтроки,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность.Подразделение КАК Подразделение,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность.Контрагент КАК Контрагент,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность.ВидДоговора КАК ВидДоговора,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность.ВалютаВзаиморасчетовСПолучателем КАК ВалютаВзаиморасчетовСПолучателем,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность.РасчетыВВалюте КАК РасчетыВВалюте,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность.СпособПогашенияЗадолженности КАК СпособПогашенияЗадолженности,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность.ДокументРасчетов КАК ДокументРасчетов,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность.СчетРасчетов КАК СчетРасчетов,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность.СчетАвансов КАК СчетАвансов,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность.ПорядокОтраженияАванса КАК ПорядокОтраженияАванса,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность.КорСчет КАК КорСчет,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность.КорСубконто1 КАК КорСубконто1,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность.КорСубконто2 КАК КорСубконто2,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность.КорСубконто3 КАК КорСубконто3,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность.КорПодразделение КАК КорПодразделение,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность.СуммаРуб КАК СуммаРуб,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность.СуммаНУ КАК СуммаНУ,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность.Содержание КАК Содержание
	|ИЗ
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность КАК ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность.НомерСтроки";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	
	Если НЕ НомераТаблиц.Свойство("ВТ_ДебиторскаяЗадолженностьВозвратАванса") 		
		ИЛИ Реквизиты.ВидОперации <> Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности 
			И Реквизиты.ВидОперации <> Перечисления.ВидыОперацийКорректировкаДолга.Прочее
		Тогда
		
		ПараметрыПроведения.Вставить("ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса", Неопределено);
		Возврат "";
		
	КонецЕсли;
		
	НомераТаблиц.Вставить("ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаДебиторскаяЗадолженность.Ссылка КАК Ссылка,
	|	ТаблицаДебиторскаяЗадолженность.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДебиторскаяЗадолженность.Подразделение КАК Подразделение,
	|	ТаблицаДебиторскаяЗадолженность.Контрагент КАК Контрагент,
	|	ТаблицаДебиторскаяЗадолженность.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ТаблицаДебиторскаяЗадолженность.ВидДоговора КАК ВидДоговора,
	|	ТаблицаДебиторскаяЗадолженность.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ТаблицаДебиторскаяЗадолженность.ВалютаВзаиморасчетовСПолучателем КАК ВалютаВзаиморасчетовСПолучателем,
	|	ТаблицаДебиторскаяЗадолженность.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ТаблицаДебиторскаяЗадолженность.РасчетыВВалюте КАК РасчетыВВалюте,
	|	ТаблицаДебиторскаяЗадолженность.СпособПогашенияЗадолженности КАК СпособПогашенияЗадолженности,
	|	ТаблицаДебиторскаяЗадолженность.ДокументРасчетов КАК ДокументРасчетов,
	|	ТаблицаДебиторскаяЗадолженность.СчетРасчетов КАК СчетРасчетов,
	|	ТаблицаДебиторскаяЗадолженность.СчетАвансов КАК СчетАвансов,
	|	НЕОПРЕДЕЛЕНО КАК ПорядокОтраженияАванса,
	|	ТаблицаДебиторскаяЗадолженность.СчетДт КАК КорСчет,
	|	ТаблицаДебиторскаяЗадолженность.СубконтоДт1 КАК КорСубконто1,
	|	ТаблицаДебиторскаяЗадолженность.СубконтоДт2 КАК КорСубконто2,
	|	ТаблицаДебиторскаяЗадолженность.СубконтоДт3 КАК КорСубконто3,
	|	ТаблицаДебиторскаяЗадолженность.КорПодразделение КАК КорПодразделение,
	|	ТаблицаДебиторскаяЗадолженность.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ТаблицаДебиторскаяЗадолженность.СуммаРуб КАК СуммаРуб,
	|	ТаблицаДебиторскаяЗадолженность.СуммаНУ КАК СуммаНУ,
	|	&СодержаниеПроводкиСписаниеЗадолженности КАК Содержание
	|ПОМЕСТИТЬ ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса
	|ИЗ
	|	ВТ_ДебиторскаяЗадолженностьВозвратАванса КАК ТаблицаДебиторскаяЗадолженность
	|ГДЕ
	|	(ТаблицаДебиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности)
	|			ИЛИ ТаблицаДебиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|				И НЕ ТаблицаДебиторскаяЗадолженность.СчетДт = ТаблицаДебиторскаяЗадолженность.СчетКт
	|				И НЕ ТаблицаДебиторскаяЗадолженность.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|				И (НЕ ТаблицаДебиторскаяЗадолженность.СубконтоДт1 ССЫЛКА Справочник.Контрагенты
	|						И НЕ ТаблицаДебиторскаяЗадолженность.СубконтоДт2 ССЫЛКА Справочник.Контрагенты
	|						И НЕ ТаблицаДебиторскаяЗадолженность.СубконтоДт3 ССЫЛКА Справочник.Контрагенты
	|					ИЛИ НЕ ТаблицаДебиторскаяЗадолженность.СубконтоДт1 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|						И НЕ ТаблицаДебиторскаяЗадолженность.СубконтоДт2 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|						И НЕ ТаблицаДебиторскаяЗадолженность.СубконтоДт3 ССЫЛКА Справочник.ДоговорыКонтрагентов)
	|			ИЛИ ТаблицаДебиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|				И ТаблицаДебиторскаяЗадолженность.СчетДт = ТаблицаДебиторскаяЗадолженность.СчетКт
	|				И ТаблицаДебиторскаяЗадолженность.СубконтоДт1 = ТаблицаДебиторскаяЗадолженность.СубконтоКт1
	|				И ТаблицаДебиторскаяЗадолженность.СубконтоДт2 = ТаблицаДебиторскаяЗадолженность.СубконтоКт2
	|				И ТаблицаДебиторскаяЗадолженность.СубконтоДт3 = ТаблицаДебиторскаяЗадолженность.СубконтоКт3
	|				И (НЕ ТаблицаДебиторскаяЗадолженность.СубконтоДт1 ССЫЛКА Справочник.Контрагенты
	|						И НЕ ТаблицаДебиторскаяЗадолженность.СубконтоДт2 ССЫЛКА Справочник.Контрагенты
	|					ИЛИ НЕ ТаблицаДебиторскаяЗадолженность.СубконтоДт1 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|						И НЕ ТаблицаДебиторскаяЗадолженность.СубконтоДт2 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|						И НЕ ТаблицаДебиторскаяЗадолженность.СубконтоДт3 ССЫЛКА Справочник.ДоговорыКонтрагентов)
	|				И НЕ ТаблицаДебиторскаяЗадолженность.Ссылка.СуммаДтЗадолженности = ТаблицаДебиторскаяЗадолженность.Ссылка.СуммаКтЗадолженности)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса.Ссылка КАК Ссылка,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса.НомерСтроки КАК НомерСтроки,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса.Подразделение КАК Подразделение,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса.Контрагент КАК Контрагент,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса.ВидДоговора КАК ВидДоговора,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса.ВалютаВзаиморасчетовСПолучателем КАК ВалютаВзаиморасчетовСПолучателем,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса.РасчетыВВалюте КАК РасчетыВВалюте,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса.СпособПогашенияЗадолженности КАК СпособПогашенияЗадолженности,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса.ДокументРасчетов КАК ДокументРасчетов,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса.СчетРасчетов КАК СчетРасчетов,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса.СчетАвансов КАК СчетАвансов,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса.ПорядокОтраженияАванса КАК ПорядокОтраженияАванса,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса.КорСчет КАК КорСчет,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса.КорСубконто1 КАК КорСубконто1,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса.КорСубконто2 КАК КорСубконто2,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса.КорСубконто3 КАК КорСубконто3,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса.КорПодразделение КАК КорПодразделение,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса.СуммаРуб КАК СуммаРуб,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса.СуммаНУ КАК СуммаНУ,
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса.Содержание КАК Содержание
	|ИЗ
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса КАК ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса.НомерСтроки";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	
	Если НЕ НомераТаблиц.Свойство("ВТ_КредиторскаяЗадолженность")  		
		ИЛИ Реквизиты.ВидОперации <> Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности 
			И Реквизиты.ВидОперации <> Перечисления.ВидыОперацийКорректировкаДолга.Прочее
		Тогда
		
		ПараметрыПроведения.Вставить("ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность", Неопределено);
		Возврат "";
		
	КонецЕсли;
		
	НомераТаблиц.Вставить("ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаКредиторскаяЗадолженность.Ссылка КАК Ссылка,
	|	ТаблицаКредиторскаяЗадолженность.НомерСтроки КАК НомерСтроки,
	|	ТаблицаКредиторскаяЗадолженность.Подразделение КАК Подразделение,
	|	ТаблицаКредиторскаяЗадолженность.Контрагент КАК Контрагент,
	|	ТаблицаКредиторскаяЗадолженность.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ТаблицаКредиторскаяЗадолженность.ВидДоговора КАК ВидДоговора,
	|	ТаблицаКредиторскаяЗадолженность.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ТаблицаКредиторскаяЗадолженность.ВалютаВзаиморасчетовСПолучателем КАК ВалютаВзаиморасчетовСПолучателем,
	|	ТаблицаКредиторскаяЗадолженность.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ТаблицаКредиторскаяЗадолженность.РасчетыВВалюте КАК РасчетыВВалюте,
	|	ТаблицаКредиторскаяЗадолженность.СпособПогашенияЗадолженности КАК СпособПогашенияЗадолженности,
	|	ТаблицаКредиторскаяЗадолженность.ДокументРасчетов КАК ДокументРасчетов,
	|	ТаблицаКредиторскаяЗадолженность.СчетРасчетов КАК СчетРасчетов,
	|	ТаблицаКредиторскаяЗадолженность.СчетАвансов КАК СчетАвансов,
	|	НЕОПРЕДЕЛЕНО КАК ПорядокОтраженияАванса,
	|	ТаблицаКредиторскаяЗадолженность.СчетКт КАК КорСчет,
	|	ТаблицаКредиторскаяЗадолженность.СубконтоКт1 КАК КорСубконто1,
	|	ТаблицаКредиторскаяЗадолженность.СубконтоКт2 КАК КорСубконто2,
	|	ТаблицаКредиторскаяЗадолженность.СубконтоКт3 КАК КорСубконто3,
	|	ТаблицаКредиторскаяЗадолженность.КорПодразделение КАК КорПодразделение,
	|	ТаблицаКредиторскаяЗадолженность.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ТаблицаКредиторскаяЗадолженность.СуммаРуб КАК СуммаРуб,
	|	ТаблицаКредиторскаяЗадолженность.СуммаНУ КАК СуммаНУ,
	|	&СодержаниеПроводкиСписаниеЗадолженности КАК Содержание
	|ПОМЕСТИТЬ ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность
	|ИЗ
	|	ВТ_КредиторскаяЗадолженность КАК ТаблицаКредиторскаяЗадолженность
	|ГДЕ
	|	(ТаблицаКредиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности)
	|			ИЛИ ТаблицаКредиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|				И НЕ ТаблицаКредиторскаяЗадолженность.СчетДт = ТаблицаКредиторскаяЗадолженность.СчетКт
	|				И НЕ ТаблицаКредиторскаяЗадолженность.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|				И (НЕ ТаблицаКредиторскаяЗадолженность.СубконтоКт1 ССЫЛКА Справочник.Контрагенты
	|						И НЕ ТаблицаКредиторскаяЗадолженность.СубконтоКт2 ССЫЛКА Справочник.Контрагенты
	|						И НЕ ТаблицаКредиторскаяЗадолженность.СубконтоКт3 ССЫЛКА Справочник.Контрагенты
	|					ИЛИ НЕ ТаблицаКредиторскаяЗадолженность.СубконтоКт1 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|						И НЕ ТаблицаКредиторскаяЗадолженность.СубконтоКт2 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|						И НЕ ТаблицаКредиторскаяЗадолженность.СубконтоКт3 ССЫЛКА Справочник.ДоговорыКонтрагентов)
	|			ИЛИ ТаблицаКредиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|				И ТаблицаКредиторскаяЗадолженность.СчетДт = ТаблицаКредиторскаяЗадолженность.СчетКт
	|				И ТаблицаКредиторскаяЗадолженность.СубконтоДт1 = ТаблицаКредиторскаяЗадолженность.СубконтоКт1
	|				И ТаблицаКредиторскаяЗадолженность.СубконтоДт2 = ТаблицаКредиторскаяЗадолженность.СубконтоКт2
	|				И ТаблицаКредиторскаяЗадолженность.СубконтоДт3 = ТаблицаКредиторскаяЗадолженность.СубконтоКт3
	|				И (НЕ ТаблицаКредиторскаяЗадолженность.СубконтоДт1 ССЫЛКА Справочник.Контрагенты
	|						И НЕ ТаблицаКредиторскаяЗадолженность.СубконтоДт2 ССЫЛКА Справочник.Контрагенты
	|					ИЛИ НЕ ТаблицаКредиторскаяЗадолженность.СубконтоДт1 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|						И НЕ ТаблицаКредиторскаяЗадолженность.СубконтоДт2 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|						И НЕ ТаблицаКредиторскаяЗадолженность.СубконтоДт3 ССЫЛКА Справочник.ДоговорыКонтрагентов)
	|				И НЕ ТаблицаКредиторскаяЗадолженность.Ссылка.СуммаДтЗадолженности = ТаблицаКредиторскаяЗадолженность.Ссылка.СуммаКтЗадолженности)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность.Ссылка КАК Ссылка,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность.НомерСтроки КАК НомерСтроки,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность.Подразделение КАК Подразделение,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность.Контрагент КАК Контрагент,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность.ВидДоговора КАК ВидДоговора,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность.ВалютаВзаиморасчетовСПолучателем КАК ВалютаВзаиморасчетовСПолучателем,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность.РасчетыВВалюте КАК РасчетыВВалюте,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность.СпособПогашенияЗадолженности КАК СпособПогашенияЗадолженности,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность.ДокументРасчетов КАК ДокументРасчетов,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность.СчетРасчетов КАК СчетРасчетов,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность.СчетАвансов КАК СчетАвансов,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность.ПорядокОтраженияАванса КАК ПорядокОтраженияАванса,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность.КорСчет КАК КорСчет,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность.КорСубконто1 КАК КорСубконто1,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность.КорСубконто2 КАК КорСубконто2,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность.КорСубконто3 КАК КорСубконто3,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность.КорПодразделение КАК КорПодразделение,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность.СуммаРуб КАК СуммаРуб,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность.СуммаНУ КАК СуммаНУ,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность.Содержание КАК Содержание
	|ИЗ
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность КАК ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность.НомерСтроки";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	
	Если НЕ НомераТаблиц.Свойство("ВТ_КредиторскаяЗадолженностьВозвратАванса")  		
		ИЛИ Реквизиты.ВидОперации <> Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности 
			И Реквизиты.ВидОперации <> Перечисления.ВидыОперацийКорректировкаДолга.Прочее
		Тогда
		
		ПараметрыПроведения.Вставить("ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса", Неопределено);
		Возврат "";
		
	КонецЕсли;
	
	НомераТаблиц.Вставить("ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаКредиторскаяЗадолженность.Ссылка КАК Ссылка,
	|	ТаблицаКредиторскаяЗадолженность.НомерСтроки КАК НомерСтроки,
	|	ТаблицаКредиторскаяЗадолженность.Подразделение КАК Подразделение,
	|	ТаблицаКредиторскаяЗадолженность.Контрагент КАК Контрагент,
	|	ТаблицаКредиторскаяЗадолженность.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ТаблицаКредиторскаяЗадолженность.ВидДоговора КАК ВидДоговора,
	|	ТаблицаКредиторскаяЗадолженность.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ТаблицаКредиторскаяЗадолженность.ВалютаВзаиморасчетовСПолучателем КАК ВалютаВзаиморасчетовСПолучателем,
	|	ТаблицаКредиторскаяЗадолженность.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ТаблицаКредиторскаяЗадолженность.РасчетыВВалюте КАК РасчетыВВалюте,
	|	ТаблицаКредиторскаяЗадолженность.СпособПогашенияЗадолженности КАК СпособПогашенияЗадолженности,
	|	ТаблицаКредиторскаяЗадолженность.ДокументРасчетов КАК ДокументРасчетов,
	|	ТаблицаКредиторскаяЗадолженность.СчетРасчетов КАК СчетРасчетов,
	|	ТаблицаКредиторскаяЗадолженность.СчетАвансов КАК СчетАвансов,
	|	НЕОПРЕДЕЛЕНО КАК ПорядокОтраженияАванса,
	|	ТаблицаКредиторскаяЗадолженность.СчетКт КАК КорСчет,
	|	ТаблицаКредиторскаяЗадолженность.СубконтоКт1 КАК КорСубконто1,
	|	ТаблицаКредиторскаяЗадолженность.СубконтоКт2 КАК КорСубконто2,
	|	ТаблицаКредиторскаяЗадолженность.СубконтоКт3 КАК КорСубконто3,
	|	ТаблицаКредиторскаяЗадолженность.КорПодразделение КАК КорПодразделение,
	|	ТаблицаКредиторскаяЗадолженность.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ТаблицаКредиторскаяЗадолженность.СуммаРуб КАК СуммаРуб,
	|	ТаблицаКредиторскаяЗадолженность.СуммаНУ КАК СуммаНУ,
	|	&СодержаниеПроводкиСписаниеЗадолженности КАК Содержание
	|ПОМЕСТИТЬ ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса
	|ИЗ
	|	ВТ_КредиторскаяЗадолженностьВозвратАванса КАК ТаблицаКредиторскаяЗадолженность
	|ГДЕ
	|	(ТаблицаКредиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности)
	|			ИЛИ ТаблицаКредиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|				И НЕ ТаблицаКредиторскаяЗадолженность.СчетДт = ТаблицаКредиторскаяЗадолженность.СчетКт
	|				И НЕ ТаблицаКредиторскаяЗадолженность.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|				И (НЕ ТаблицаКредиторскаяЗадолженность.СубконтоКт1 ССЫЛКА Справочник.Контрагенты
	|						И НЕ ТаблицаКредиторскаяЗадолженность.СубконтоКт2 ССЫЛКА Справочник.Контрагенты
	|						И НЕ ТаблицаКредиторскаяЗадолженность.СубконтоКт3 ССЫЛКА Справочник.Контрагенты
	|					ИЛИ НЕ ТаблицаКредиторскаяЗадолженность.СубконтоКт1 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|						И НЕ ТаблицаКредиторскаяЗадолженность.СубконтоКт2 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|						И НЕ ТаблицаКредиторскаяЗадолженность.СубконтоКт3 ССЫЛКА Справочник.ДоговорыКонтрагентов)
	|			ИЛИ ТаблицаКредиторскаяЗадолженность.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	|				И ТаблицаКредиторскаяЗадолженность.СчетДт = ТаблицаКредиторскаяЗадолженность.СчетКт
	|				И ТаблицаКредиторскаяЗадолженность.СубконтоДт1 = ТаблицаКредиторскаяЗадолженность.СубконтоКт1
	|				И ТаблицаКредиторскаяЗадолженность.СубконтоДт2 = ТаблицаКредиторскаяЗадолженность.СубконтоКт2
	|				И ТаблицаКредиторскаяЗадолженность.СубконтоДт3 = ТаблицаКредиторскаяЗадолженность.СубконтоКт3
	|				И (НЕ ТаблицаКредиторскаяЗадолженность.СубконтоДт1 ССЫЛКА Справочник.Контрагенты
	|						И НЕ ТаблицаКредиторскаяЗадолженность.СубконтоДт2 ССЫЛКА Справочник.Контрагенты
	|					ИЛИ НЕ ТаблицаКредиторскаяЗадолженность.СубконтоДт1 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|						И НЕ ТаблицаКредиторскаяЗадолженность.СубконтоДт2 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|						И НЕ ТаблицаКредиторскаяЗадолженность.СубконтоДт3 ССЫЛКА Справочник.ДоговорыКонтрагентов)
	|				И НЕ ТаблицаКредиторскаяЗадолженность.Ссылка.СуммаДтЗадолженности = ТаблицаКредиторскаяЗадолженность.Ссылка.СуммаКтЗадолженности)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса.Ссылка КАК Ссылка,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса.НомерСтроки КАК НомерСтроки,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса.Подразделение КАК Подразделение,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса.Контрагент КАК Контрагент,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса.ВидДоговора КАК ВидДоговора,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса.ВалютаВзаиморасчетовСПолучателем КАК ВалютаВзаиморасчетовСПолучателем,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса.РасчетыВВалюте КАК РасчетыВВалюте,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса.СпособПогашенияЗадолженности КАК СпособПогашенияЗадолженности,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса.ДокументРасчетов КАК ДокументРасчетов,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса.СчетРасчетов КАК СчетРасчетов,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса.СчетАвансов КАК СчетАвансов,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса.ПорядокОтраженияАванса КАК ПорядокОтраженияАванса,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса.КорСчет КАК КорСчет,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса.КорСубконто1 КАК КорСубконто1,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса.КорСубконто2 КАК КорСубконто2,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса.КорСубконто3 КАК КорСубконто3,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса.КорПодразделение КАК КорПодразделение,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса.СуммаРуб КАК СуммаРуб,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса.СуммаНУ КАК СуммаНУ,
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса.Содержание КАК Содержание
	|ИЗ
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса КАК ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса.НомерСтроки";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

// ОТЛОЖЕННОЕ ПРОВЕДЕНИЕ

Функция ТекстЗапросаРегистрацияОтложенныхРасчетовСКонтрагентами(НомераТаблиц, ПараметрыПроведения, Реквизиты)

	Если Реквизиты.ЭтоОтложенноеПроведение
		ИЛИ НЕ ПроведениеСервер.ИспользуетсяОтложенноеПроведение(Реквизиты.Организация, Реквизиты.Период) Тогда
		ПараметрыПроведения.Вставить("РасчетыСКонтрагентамиОтложенноеПроведение", Неопределено);
		Возврат "";
	КонецЕсли;

	НомераТаблиц.Вставить("ВТ_РасчетыСКонтрагентамиОтложенноеПроведение", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("РасчетыСКонтрагентамиОтложенноеПроведение", НомераТаблиц.Количество());

	ТекстЗапроса = 	
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка) КАК ДоговорКонтрагента
	|ПОМЕСТИТЬ ВТ_РасчетыСКонтрагентамиОтложенноеПроведение
	|ГДЕ
	|	ЛОЖЬ";
	
	Если НомераТаблиц.Свойство("ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность") Тогда
	
		ТекстЗапроса = ТекстЗапроса	+ "
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность.Контрагент,
		|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность.ДоговорКонтрагента
		|ИЗ
		|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность КАК ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность.КорСубконто1 ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность.КорСубконто1 КАК Справочник.Контрагенты)
		|		КОГДА ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность.КорСубконто2 ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность.КорСубконто2 КАК Справочник.Контрагенты)
		|		КОГДА ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность.КорСубконто3 ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность.КорСубконто3 КАК Справочник.Контрагенты)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность.КорСубконто1 ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность.КорСубконто1 КАК Справочник.ДоговорыКонтрагентов)
		|		КОГДА ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность.КорСубконто2 ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность.КорСубконто2 КАК Справочник.ДоговорыКонтрагентов)
		|		КОГДА ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность.КорСубконто3 ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность.КорСубконто3 КАК Справочник.ДоговорыКонтрагентов)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|ИЗ
		|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность КАК ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность
		|";
	
	КонецЕсли;
	
	Если НомераТаблиц.Свойство("ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса") Тогда
	
		ТекстЗапроса = ТекстЗапроса	+ "
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса.Контрагент,
		|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса.ДоговорКонтрагента
		|ИЗ
		|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса КАК ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса.КорСубконто1 ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса.КорСубконто1 КАК Справочник.Контрагенты)
		|		КОГДА ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса.КорСубконто2 ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса.КорСубконто2 КАК Справочник.Контрагенты)
		|		КОГДА ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса.КорСубконто3 ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса.КорСубконто3 КАК Справочник.Контрагенты)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса.КорСубконто1 ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса.КорСубконто1 КАК Справочник.ДоговорыКонтрагентов)
		|		КОГДА ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса.КорСубконто2 ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса.КорСубконто2 КАК Справочник.ДоговорыКонтрагентов)
		|		КОГДА ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса.КорСубконто3 ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса.КорСубконто3 КАК Справочник.ДоговорыКонтрагентов)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|ИЗ
		|	ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса КАК ВТ_ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса
		|
		|
		|";
	
	КонецЕсли;
	
	Если НомераТаблиц.Свойство("ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность") Тогда
	
		ТекстЗапроса = ТекстЗапроса	+ "
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность.Контрагент,
		|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность.ДоговорКонтрагента
		|ИЗ
		|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность КАК ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность.КорСубконто1 ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность.КорСубконто1 КАК Справочник.Контрагенты)
		|		КОГДА ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность.КорСубконто2 ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность.КорСубконто2 КАК Справочник.Контрагенты)
		|		КОГДА ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность.КорСубконто3 ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность.КорСубконто3 КАК Справочник.Контрагенты)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность.КорСубконто1 ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность.КорСубконто1 КАК Справочник.ДоговорыКонтрагентов)
		|		КОГДА ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность.КорСубконто2 ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность.КорСубконто2 КАК Справочник.ДоговорыКонтрагентов)
		|		КОГДА ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность.КорСубконто3 ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность.КорСубконто3 КАК Справочник.ДоговорыКонтрагентов)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|ИЗ
		|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность КАК ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность
		|
		|";
	
	КонецЕсли;
	
	Если НомераТаблиц.Свойство("ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса") Тогда
	
		ТекстЗапроса = ТекстЗапроса	+ "
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса.Контрагент,
		|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса.ДоговорКонтрагента
		|ИЗ
		|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса КАК ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса.КорСубконто1 ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса.КорСубконто1 КАК Справочник.Контрагенты)
		|		КОГДА ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса.КорСубконто2 ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса.КорСубконто2 КАК Справочник.Контрагенты)
		|		КОГДА ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса.КорСубконто3 ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса.КорСубконто3 КАК Справочник.Контрагенты)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса.КорСубконто1 ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса.КорСубконто1 КАК Справочник.ДоговорыКонтрагентов)
		|		КОГДА ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса.КорСубконто2 ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса.КорСубконто2 КАК Справочник.ДоговорыКонтрагентов)
		|		КОГДА ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса.КорСубконто3 ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса.КорСубконто3 КАК Справочник.ДоговорыКонтрагентов)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|ИЗ
		|	ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса КАК ВТ_ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса
		|
		|";
	
	КонецЕсли;
	
	Если НомераТаблиц.Свойство("ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность") Тогда
	
		ТекстЗапроса = ТекстЗапроса	+ "
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность.Контрагент,
		|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность.ДоговорКонтрагента
		|ИЗ
		|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность КАК ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность.КорСубконто1 ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность.КорСубконто1 КАК Справочник.Контрагенты)
		|		КОГДА ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность.КорСубконто2 ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность.КорСубконто2 КАК Справочник.Контрагенты)
		|		КОГДА ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность.КорСубконто3 ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность.КорСубконто3 КАК Справочник.Контрагенты)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность.КорСубконто1 ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность.КорСубконто1 КАК Справочник.ДоговорыКонтрагентов)
		|		КОГДА ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность.КорСубконто2 ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность.КорСубконто2 КАК Справочник.ДоговорыКонтрагентов)
		|		КОГДА ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность.КорСубконто3 ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность.КорСубконто3 КАК Справочник.ДоговорыКонтрагентов)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|ИЗ
		|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность КАК ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженность
		|
		|";
	
	КонецЕсли;
	
	Если НомераТаблиц.Свойство("ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса") Тогда
	
		ТекстЗапроса = ТекстЗапроса	+ "
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса.Контрагент,
		|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса.ДоговорКонтрагента
		|ИЗ
		|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса КАК ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса.КорСубконто1 ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса.КорСубконто1 КАК Справочник.Контрагенты)
		|		КОГДА ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса.КорСубконто2 ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса.КорСубконто2 КАК Справочник.Контрагенты)
		|		КОГДА ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса.КорСубконто3 ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса.КорСубконто3 КАК Справочник.Контрагенты)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса.КорСубконто1 ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса.КорСубконто1 КАК Справочник.ДоговорыКонтрагентов)
		|		КОГДА ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса.КорСубконто2 ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса.КорСубконто2 КАК Справочник.ДоговорыКонтрагентов)
		|		КОГДА ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса.КорСубконто3 ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса.КорСубконто3 КАК Справочник.ДоговорыКонтрагентов)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|ИЗ
		|	ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса КАК ВТ_ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса
		|
		|";
	
	КонецЕсли;
	
	Если НомераТаблиц.Свойство("ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность") Тогда
	
		ТекстЗапроса = ТекстЗапроса	+ "
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность.Контрагент,
		|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность.ДоговорКонтрагента
		|ИЗ
		|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность КАК ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность.КорСубконто1 ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность.КорСубконто1 КАК Справочник.Контрагенты)
		|		КОГДА ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность.КорСубконто2 ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность.КорСубконто2 КАК Справочник.Контрагенты)
		|		КОГДА ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность.КорСубконто3 ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность.КорСубконто3 КАК Справочник.Контрагенты)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность.КорСубконто1 ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность.КорСубконто1 КАК Справочник.ДоговорыКонтрагентов)
		|		КОГДА ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность.КорСубконто2 ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность.КорСубконто2 КАК Справочник.ДоговорыКонтрагентов)
		|		КОГДА ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность.КорСубконто3 ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность.КорСубконто3 КАК Справочник.ДоговорыКонтрагентов)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|ИЗ
		|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность КАК ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженность
		|
		|";
	
	КонецЕсли;
	
	Если НомераТаблиц.Свойство("ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса") Тогда
	
		ТекстЗапроса = ТекстЗапроса	+ "
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса.Контрагент,
		|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса.ДоговорКонтрагента
		|ИЗ
		|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса КАК ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса.КорСубконто1 ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса.КорСубконто1 КАК Справочник.Контрагенты)
		|		КОГДА ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса.КорСубконто2 ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса.КорСубконто2 КАК Справочник.Контрагенты)
		|		КОГДА ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса.КорСубконто3 ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса.КорСубконто3 КАК Справочник.Контрагенты)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса.КорСубконто1 ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса.КорСубконто1 КАК Справочник.ДоговорыКонтрагентов)
		|		КОГДА ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса.КорСубконто2 ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса.КорСубконто2 КАК Справочник.ДоговорыКонтрагентов)
		|		КОГДА ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса.КорСубконто3 ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса.КорСубконто3 КАК Справочник.ДоговорыКонтрагентов)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|ИЗ
		|	ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса КАК ВТ_ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса
		|
		|";
	
	КонецЕсли;
	
	Если НомераТаблиц.Свойство("ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность") Тогда
	
		ТекстЗапроса = ТекстЗапроса	+ "
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность.Контрагент,
		|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность.ДоговорКонтрагента
		|ИЗ
		|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность КАК ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность.КорСубконто1 ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность.КорСубконто1 КАК Справочник.Контрагенты)
		|		КОГДА ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность.КорСубконто2 ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность.КорСубконто2 КАК Справочник.Контрагенты)
		|		КОГДА ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность.КорСубконто3 ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность.КорСубконто3 КАК Справочник.Контрагенты)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность.КорСубконто1 ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность.КорСубконто1 КАК Справочник.ДоговорыКонтрагентов)
		|		КОГДА ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность.КорСубконто2 ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность.КорСубконто2 КАК Справочник.ДоговорыКонтрагентов)
		|		КОГДА ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность.КорСубконто3 ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность.КорСубконто3 КАК Справочник.ДоговорыКонтрагентов)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|ИЗ
		|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность КАК ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность
		|
		|";
	
	КонецЕсли;
	
	Если НомераТаблиц.Свойство("ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса") Тогда
	
		ТекстЗапроса = ТекстЗапроса	+ "
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса.Контрагент,
		|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса.ДоговорКонтрагента
		|ИЗ
		|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса КАК ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса.КорСубконто1 ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса.КорСубконто1 КАК Справочник.Контрагенты)
		|		КОГДА ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса.КорСубконто2 ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса.КорСубконто2 КАК Справочник.Контрагенты)
		|		КОГДА ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса.КорСубконто3 ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса.КорСубконто3 КАК Справочник.Контрагенты)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса.КорСубконто1 ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса.КорСубконто1 КАК Справочник.ДоговорыКонтрагентов)
		|		КОГДА ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса.КорСубконто2 ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса.КорСубконто2 КАК Справочник.ДоговорыКонтрагентов)
		|		КОГДА ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса.КорСубконто3 ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса.КорСубконто3 КАК Справочник.ДоговорыКонтрагентов)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|ИЗ
		|	ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса КАК ВТ_ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса
		|
		|";
	
	КонецЕсли;
	
	Если НомераТаблиц.Свойство("ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность") Тогда
	
		ТекстЗапроса = ТекстЗапроса	+ "
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность.Контрагент,
		|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность.ДоговорКонтрагента
		|ИЗ
		|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность КАК ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность.КорСубконто1 ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность.КорСубконто1 КАК Справочник.Контрагенты)
		|		КОГДА ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность.КорСубконто2 ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность.КорСубконто2 КАК Справочник.Контрагенты)
		|		КОГДА ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность.КорСубконто3 ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность.КорСубконто3 КАК Справочник.Контрагенты)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность.КорСубконто1 ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность.КорСубконто1 КАК Справочник.ДоговорыКонтрагентов)
		|		КОГДА ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность.КорСубконто2 ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность.КорСубконто2 КАК Справочник.ДоговорыКонтрагентов)
		|		КОГДА ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность.КорСубконто3 ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность.КорСубконто3 КАК Справочник.ДоговорыКонтрагентов)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|ИЗ
		|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность КАК ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность
		|
		|";
	
	КонецЕсли;
	
	Если НомераТаблиц.Свойство("ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса") Тогда
	
		ТекстЗапроса = ТекстЗапроса	+ "
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса.Контрагент,
		|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса.ДоговорКонтрагента
		|ИЗ
		|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса КАК ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса.КорСубконто1 ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса.КорСубконто1 КАК Справочник.Контрагенты)
		|		КОГДА ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса.КорСубконто2 ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса.КорСубконто2 КАК Справочник.Контрагенты)
		|		КОГДА ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса.КорСубконто3 ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса.КорСубконто3 КАК Справочник.Контрагенты)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса.КорСубконто1 ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса.КорСубконто1 КАК Справочник.ДоговорыКонтрагентов)
		|		КОГДА ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса.КорСубконто2 ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса.КорСубконто2 КАК Справочник.ДоговорыКонтрагентов)
		|		КОГДА ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса.КорСубконто3 ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ВЫРАЗИТЬ(ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса.КорСубконто3 КАК Справочник.ДоговорыКонтрагентов)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|ИЗ
		|	ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса КАК ВТ_ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса
		|";
	
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса	+ ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	ТекстЗапроса = ТекстЗапроса	+
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_РасчетыСКонтрагентамиОтложенноеПроведение.Контрагент КАК Контрагент,
	|	ВТ_РасчетыСКонтрагентамиОтложенноеПроведение.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДоговорыКонтрагентов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	&Дата КАК Дата
	|ИЗ
	|	ВТ_РасчетыСКонтрагентамиОтложенноеПроведение КАК ВТ_РасчетыСКонтрагентамиОтложенноеПроведение
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ВТ_РасчетыСКонтрагентамиОтложенноеПроведение.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	ВТ_РасчетыСКонтрагентамиОтложенноеПроведение.Контрагент <> НЕОПРЕДЕЛЕНО
	|	И ВТ_РасчетыСКонтрагентамиОтложенноеПроведение.ДоговорКонтрагента <> НЕОПРЕДЕЛЕНО";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();

КонецФункции

Процедура ОбработкаОтложенногоПроведения(Параметры, Отказ) Экспорт
	
	ПараметрыПроведения = ПодготовитьПараметрыПроведения(
		Параметры.Регистратор,
		Отказ,
		Параметры.ДоговорКонтрагента);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	Реквизиты = ПараметрыПроведения.Реквизиты[0];
	
	Если Реквизиты.ПрименяетсяУСН Тогда
		// В случае применения УСН получаем таблицу КредиторскаяЗадолженностьВозвратАванса
		// без отбора по текущему актуализируемому договору, т.к. необходимы полные данные 
		// об авансах покупателей в НалоговыйУчетУСН.ОтразитьВУСН() (ВидОперации = "ПроведениеВзаимозачетаДебитор").
		// Причем важен сам факт наличия таких записей, а не их конкретное содержание.
		// Для всех остальных случаев используем таблицы с отбором по текущему актуализируемому договору.
		ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАвансаУСН = 
			УчетВзаиморасчетов.ПодготовитьТаблицуВзаиморасчетовПогашениеЗадолженности(
				ПараметрыПроведения.ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса,
				ПараметрыПроведения.РеквизитыПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса,
				Отказ,
				"КорректировкаДолга");
	КонецЕсли;

	// Вид операции "Проведение взаимозачета".
	ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса = 
		УчетВзаиморасчетовОтложенноеПроведение.СкопироватьСтрокиТаблицыПоДоговору(
			ПараметрыПроведения.ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса,
			Параметры.ДоговорКонтрагента);
	

	ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность = 
		УчетВзаиморасчетовОтложенноеПроведение.ПодготовитьТаблицуВзаиморасчетовПогашениеЗадолженностиКорректировкаДолга(
		Параметры,
		ПараметрыПроведения.ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность,
		ПараметрыПроведения.РеквизитыПроведениеВзаимозачетаДебиторскаяЗадолженность,
		Отказ);

	ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса = 
		УчетВзаиморасчетовОтложенноеПроведение.ПодготовитьТаблицуВзаиморасчетовПогашениеЗадолженностиКорректировкаДолга(
		Параметры,
		ПараметрыПроведения.ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса, 
		ПараметрыПроведения.РеквизитыПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса,
		Отказ);
	
	ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность = 
		УчетВзаиморасчетовОтложенноеПроведение.ПодготовитьТаблицуВзаиморасчетовПогашениеЗадолженностиКорректировкаДолга(
		Параметры,
		ПараметрыПроведения.ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность, 
		ПараметрыПроведения.РеквизитыПроведениеВзаимозачетаКредиторскаяЗадолженность,
		Отказ);

	ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса = 
		УчетВзаиморасчетовОтложенноеПроведение.ПодготовитьТаблицуВзаиморасчетовПогашениеЗадолженностиКорректировкаДолга(
		Параметры,
		ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса,
		ПараметрыПроведения.РеквизитыПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса,
		Отказ);
		
	СтруктураТаблицВзаимозачета = УчетВзаиморасчетовОтложенноеПроведение.ПодготовитьСтруктуруТаблицВзаимозачета(
		Параметры,
		ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность, 
		ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса, 
		ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность, 
		ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса,
		ПараметрыПроведения.Реквизиты,
		Отказ);
		
	ТаблицаВзаимозачетаДебиторскаяЗадолженность = СтруктураТаблицВзаимозачета.ТаблицаДебиторскаяЗадолженность;
	
	ТаблицаВзаимозачетаДебиторскаяЗадолженностьВозвратАванса = 
		СтруктураТаблицВзаимозачета.ТаблицаДебиторскаяЗадолженностьВозвратАванса;
		
	ТаблицаВзаимозачетаКредиторскаяЗадолженность = СтруктураТаблицВзаимозачета.ТаблицаКредиторскаяЗадолженность;
	
	ТаблицаВзаимозачетаКредиторскаяЗадолженностьВозвратАванса = 
		СтруктураТаблицВзаимозачета.ТаблицаКредиторскаяЗадолженностьВозвратАванса;
	
	ТаблицаНДСПоРеализациямНеплательщикаВзаимозачет = УчетУСН.ПодготовитьТаблицуНДСПоРеализацииНеплательщиком(
		ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность,
		ПараметрыПроведения.РеквизитыПроведениеВзаимозачетаДебиторскаяЗадолженность);
	
	// Структура таблиц для отражения в налоговом учете УСН
	СтруктураТаблицУСНВзаимозачет = Новый Структура;
	СтруктураТаблицУСНВзаимозачет.Вставить("АвансПоставщику", ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса);
	СтруктураТаблицУСНВзаимозачет.Вставить("ДолгПокупателя", ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность);
	СтруктураТаблицУСНВзаимозачет.Вставить("АвансПокупателя", ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАвансаУСН);
	СтруктураТаблицУСНВзаимозачет.Вставить("ДолгПоставщику", ТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность);
	СтруктураТаблицУСНВзаимозачет.Вставить("ТаблицаНДСПродажи", ТаблицаНДСПоРеализациямНеплательщикаВзаимозачет);
	
	// Вид операции "Перенос задолженности".
	
	ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса = 
		УчетВзаиморасчетовОтложенноеПроведение.СкопироватьСтрокиТаблицыПоДоговору(
			ПараметрыПроведения.ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса,
			Параметры.ДоговорКонтрагента);
	

	ТаблицаПереносЗадолженностиДебиторскаяЗадолженность = 
		УчетВзаиморасчетовОтложенноеПроведение.ПодготовитьТаблицуВзаиморасчетовПогашениеЗадолженностиКорректировкаДолга(
		Параметры,
		ПараметрыПроведения.ТаблицаПереносЗадолженностиДебиторскаяЗадолженность, 
		ПараметрыПроведения.РеквизитыПереносЗадолженностиДебиторскаяЗадолженность, 
		Отказ, 
		"КорректировкаДолга");

	ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса = 
		УчетВзаиморасчетовОтложенноеПроведение.ПодготовитьТаблицуВзаиморасчетовПогашениеЗадолженностиКорректировкаДолга(
		Параметры,
		ПараметрыПроведения.ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса, 
		ПараметрыПроведения.РеквизитыПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса, 
		Отказ, 
		"КорректировкаДолга");
	
	ТаблицаПереносЗадолженностиКредиторскаяЗадолженность = 
		УчетВзаиморасчетовОтложенноеПроведение.ПодготовитьТаблицуВзаиморасчетовПогашениеЗадолженностиКорректировкаДолга(
		Параметры,
		ПараметрыПроведения.ТаблицаПереносЗадолженностиКредиторскаяЗадолженность, 
		ПараметрыПроведения.РеквизитыПереносЗадолженностиКредиторскаяЗадолженность, 
		Отказ, 
		"КорректировкаДолга");

	ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса = 
		УчетВзаиморасчетовОтложенноеПроведение.ПодготовитьТаблицуВзаиморасчетовПогашениеЗадолженностиКорректировкаДолга(
		Параметры,
		ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса, 
		ПараметрыПроведения.РеквизитыПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса,
		Отказ,
		"КорректировкаДолга");
		
	ТаблицаВзаиморасчетовПереносЗадолженностиДебиторскаяЗадолженность = 
		УчетВзаиморасчетов.ПодготовитьТаблицуВзаиморасчетовПереносЗадолженности(
		ТаблицаПереносЗадолженностиДебиторскаяЗадолженность, 
		ПараметрыПроведения.РеквизитыПереносЗадолженностиДебиторскаяЗадолженность, Отказ);

	ТаблицаВзаиморасчетовПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса = 
		УчетВзаиморасчетов.ПодготовитьТаблицуВзаиморасчетовПереносЗадолженности(
		ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса, 
		ПараметрыПроведения.РеквизитыПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса, Отказ);
	
	ТаблицаВзаиморасчетовПереносЗадолженностиКредиторскаяЗадолженность = 
		УчетВзаиморасчетов.ПодготовитьТаблицуВзаиморасчетовПереносЗадолженности(
		ТаблицаПереносЗадолженностиКредиторскаяЗадолженность, 
		ПараметрыПроведения.РеквизитыПереносЗадолженностиКредиторскаяЗадолженность, Отказ);

	ТаблицаВзаиморасчетовПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса = 
		УчетВзаиморасчетов.ПодготовитьТаблицуВзаиморасчетовПереносЗадолженности(
		ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса, 
		ПараметрыПроведения.РеквизитыПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса, Отказ);
	
	// Структура таблиц для отражения в налоговом учете УСН
	СтруктураТаблицУСНПереносЗадолженности = Новый Структура;
	СтруктураТаблицУСНПереносЗадолженности.Вставить("АвансПоставщику", ТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса);
	СтруктураТаблицУСНПереносЗадолженности.Вставить("ДолгПокупателя", ТаблицаПереносЗадолженностиДебиторскаяЗадолженность);
	СтруктураТаблицУСНПереносЗадолженности.Вставить("АвансПокупателя", ТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса);
	СтруктураТаблицУСНПереносЗадолженности.Вставить("ДолгПоставщику", ТаблицаПереносЗадолженностиКредиторскаяЗадолженность);
	
	// Вид операции "Списание задолженности".
	
	ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса =
		УчетВзаиморасчетовОтложенноеПроведение.СкопироватьСтрокиТаблицыПоДоговору(
			ПараметрыПроведения.ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса,
			Параметры.ДоговорКонтрагента);
	
	ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность = 
		УчетВзаиморасчетовОтложенноеПроведение.ПодготовитьТаблицуВзаиморасчетовСписаниеЗадолженности(
		Параметры,
		ПараметрыПроведения.ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность, 
		ПараметрыПроведения.РеквизитыСписаниеЗадолженностиДебиторскаяЗадолженность, 
		Отказ);

	ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса = 
		УчетВзаиморасчетовОтложенноеПроведение.ПодготовитьТаблицуВзаиморасчетовСписаниеЗадолженности(
		Параметры,
		ПараметрыПроведения.ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса, 
		ПараметрыПроведения.РеквизитыСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса,
		Отказ);
	
	ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность = 
		УчетВзаиморасчетовОтложенноеПроведение.ПодготовитьТаблицуВзаиморасчетовСписаниеЗадолженности(
		Параметры,
		ПараметрыПроведения.ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность, 
		ПараметрыПроведения.РеквизитыСписаниеЗадолженностиКредиторскаяЗадолженность,
		Отказ);

	ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса = 
		УчетВзаиморасчетовОтложенноеПроведение.ПодготовитьТаблицуВзаиморасчетовСписаниеЗадолженности(
		Параметры,
		ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса, 
		ПараметрыПроведения.РеквизитыСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса,
		Отказ);
	
	// Структура таблиц для отражения в налоговом учете УСН
	СтруктураТаблицУСНСписаниеЗадолженности = Новый Структура;
	СтруктураТаблицУСНСписаниеЗадолженности.Вставить("АвансПоставщику", ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса);
	СтруктураТаблицУСНСписаниеЗадолженности.Вставить("ДолгПокупателя", ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность);
	СтруктураТаблицУСНСписаниеЗадолженности.Вставить("АвансПокупателя", ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса);
	СтруктураТаблицУСНСписаниеЗадолженности.Вставить("ДолгПоставщику", ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность);
	
	// ФОРМИРОВАНИЕ ДВИЖЕНИЙ

	// Вид операции "Проведение взаимозачета".
	
	УчетВзаиморасчетовОтложенноеПроведение.СформироватьДвиженияВзаимозачет(
		Параметры,
		ТаблицаВзаимозачетаДебиторскаяЗадолженность,
		ПараметрыПроведения.РеквизитыПроведениеВзаимозачетаДебиторскаяЗадолженность, 
		Отказ);
		
	УчетВзаиморасчетовОтложенноеПроведение.СформироватьДвиженияВзаимозачет(
		Параметры,
		ТаблицаВзаимозачетаДебиторскаяЗадолженностьВозвратАванса,
		ПараметрыПроведения.РеквизитыПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса,
		Отказ);
		
	УчетВзаиморасчетовОтложенноеПроведение.СформироватьДвиженияВзаимозачет(
		Параметры,
		ТаблицаВзаимозачетаКредиторскаяЗадолженность,
		ПараметрыПроведения.РеквизитыПроведениеВзаимозачетаКредиторскаяЗадолженность, 
		Отказ);
		
	УчетВзаиморасчетовОтложенноеПроведение.СформироватьДвиженияВзаимозачет(
		Параметры,
		ТаблицаВзаимозачетаКредиторскаяЗадолженностьВозвратАванса,
		ПараметрыПроведения.РеквизитыПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса,
		Отказ);
		
	УчетВзаиморасчетовОтложенноеПроведение.СформироватьДвиженияВзаимозачетОстатокКорДвижений(
		Параметры,
		СтруктураТаблицВзаимозачета,
		Отказ);
		
	// УСН
		
	УчетВзаиморасчетовОтложенноеПроведение.СформироватьДвиженияУСН(Параметры, СтруктураТаблицУСНВзаимозачет);
		
		
	// Вид операции "Перенос задолженности".
	
	УчетВзаиморасчетовОтложенноеПроведение.СформироватьДвиженияПереносЗадолженности(
		Параметры,
		ТаблицаВзаиморасчетовПереносЗадолженностиДебиторскаяЗадолженность,
		ПараметрыПроведения.РеквизитыПереносЗадолженностиДебиторскаяЗадолженность,
		Отказ);
		
	УчетВзаиморасчетовОтложенноеПроведение.СформироватьДвиженияПереносЗадолженности(
		Параметры,
		ТаблицаВзаиморасчетовПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса,
		ПараметрыПроведения.РеквизитыПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса,
		Отказ);
		
	УчетВзаиморасчетовОтложенноеПроведение.СформироватьДвиженияПереносЗадолженности(
		Параметры,
		ТаблицаВзаиморасчетовПереносЗадолженностиКредиторскаяЗадолженность,
		ПараметрыПроведения.РеквизитыПереносЗадолженностиКредиторскаяЗадолженность,
		Отказ);
		
	УчетВзаиморасчетовОтложенноеПроведение.СформироватьДвиженияПереносЗадолженности(
		Параметры,
		ТаблицаВзаиморасчетовПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса,
		ПараметрыПроведения.РеквизитыПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса,
		Отказ);
		
		
	// УСН
		
	УчетВзаиморасчетовОтложенноеПроведение.СформироватьДвиженияУСН(Параметры, СтруктураТаблицУСНПереносЗадолженности);
		
		
	// Вид операции "Списание задолженности".
	
	УчетВзаиморасчетовОтложенноеПроведение.СформироватьДвиженияСписаниеЗадолженности(
		Параметры,
		ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность,
		ПараметрыПроведения.РеквизитыСписаниеЗадолженностиДебиторскаяЗадолженность,
		Отказ);
		
	УчетВзаиморасчетовОтложенноеПроведение.СформироватьДвиженияСписаниеЗадолженности(
		Параметры,
		ТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса,
		ПараметрыПроведения.РеквизитыСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса,
		Отказ);
	
	УчетВзаиморасчетовОтложенноеПроведение.СформироватьДвиженияСписаниеЗадолженности(
		Параметры,
		ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность,
		ПараметрыПроведения.РеквизитыСписаниеЗадолженностиКредиторскаяЗадолженность,
		Отказ);
		
	УчетВзаиморасчетовОтложенноеПроведение.СформироватьДвиженияСписаниеЗадолженности(
		Параметры,
		ТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса,
		ПараметрыПроведения.РеквизитыСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса,
		Отказ);
		
		
	// УСН
		
	УчетВзаиморасчетовОтложенноеПроведение.СформироватьДвиженияУСН(Параметры, СтруктураТаблицУСНСписаниеЗадолженности);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	// Акт взаимозачета
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "КорректировкаДолга";
	КомандаПечати.Представление = НСтр("ru = 'Акт взаимозачета'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	
	// Реестр документов
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Реестр";
	КомандаПечати.Представление = НСтр("ru = 'Реестр документов'");
	КомандаПечати.ЗаголовокФормы= НСтр("ru = 'Реестр документов ""Корректировка долга""'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечатиРеестраДокументов";
	КомандаПечати.СписокФорм    = "ФормаСписка";
	КомандаПечати.Порядок       = 100;
	
КонецПроцедуры

Функция ПечатьАктаВзаимозачета(МассивОбъектов, ОбъектыПечати)

	УстановитьПривилегированныйРежим(Истина);
	
	ВалютаРеглУчета = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.РазмерКолонтитулаСверху	= 0;
	ТабличныйДокумент.РазмерКолонтитулаСнизу	= 0;
	ТабличныйДокумент.АвтоМасштаб				= Истина;
	ТабличныйДокумент.ОриентацияСтраницы		= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати		= "ПАРАМЕТРЫ_ПЕЧАТИ_КорректировкаДолга_Акт";
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КорректировкаДолга.Ссылка,
	|	КорректировкаДолга.Номер,
	|	КорректировкаДолга.Дата КАК Дата,
	|	КорректировкаДолга.КонтрагентДебитор КАК Дебитор,
	|	КорректировкаДолга.КонтрагентКредитор КАК Кредитор,
	|	КорректировкаДолга.Организация,
	|	КорректировкаДолга.ВалютаДокумента,
	|	КорректировкаДолга.ДебиторскаяЗадолженность.(
	|		ДоговорКонтрагента,
	|		ДоговорКонтрагента.Наименование КАК ДоговорПредставление,
	|		Сумма,
	|		СуммаВзаиморасчетов
	|	),
	|	КорректировкаДолга.КредиторскаяЗадолженность.(
	|		ДоговорКонтрагента,
	|		ДоговорКонтрагента.Наименование КАК ДоговорПредставление,
	|		Сумма,
	|		СуммаВзаиморасчетов
	|	)
	|ИЗ
	|	Документ.КорректировкаДолга КАК КорректировкаДолга
	|ГДЕ
	|	КорректировкаДолга.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	КорректировкаДолга.Ссылка,
	|	КорректировкаДолга.ДебиторскаяЗадолженность.НомерСтроки,
	|	КорректировкаДолга.КредиторскаяЗадолженность.НомерСтроки";
	
	Шапка = Запрос.Выполнить().Выбрать();
	
	ПервыйДокумент = Истина;
	
	Пока Шапка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.КорректировкаДолга.ПФ_MXL_Взаимозачет");
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		
		ОбластьМакета.Параметры.Заполнить(Шапка);
		
		СведенияОбОрганизации    = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , , , Истина);
		ПредставлениеОрганизации = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,");
		
		СведенияОКонтрагенте     = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шапка.Кредитор, Шапка.Дата);
		ПредставлениеКредитора   = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКонтрагенте, "НаименованиеДляПечатныхФорм,");
		
		СтрокаКредиторки = НСтр("ru = '1. Задолженность %ПредставлениеОрганизации% перед %ПредставлениеКредитора% составляет'")+ " ";
		СтрокаКредиторки = СтрЗаменить(СтрокаКредиторки,"%ПредставлениеОрганизации%",ПредставлениеОрганизации);
		СтрокаКредиторки = СтрЗаменить(СтрокаКредиторки,"%ПредставлениеКредитора%",ПредставлениеКредитора);
		Если Шапка.ВалютаДокумента = ВалютаРеглУчета или НЕ ЗначениеЗаполнено(Шапка.ВалютаДокумента) Тогда
			КолонкаСуммы        = "Сумма";
			ПредставлениеВалюты = строка(ВалютаРеглУчета);
		Иначе	
			КолонкаСуммы        = "СуммаВзаиморасчетов";
			ПредставлениеВалюты = строка(Шапка.ВалютаДокумента);
		КонецЕсли; 
		
		ДебиторскаяЗадолженность = Шапка.ДебиторскаяЗадолженность.Выгрузить();
		КредиторскаяЗадолженность = Шапка.КредиторскаяЗадолженность.Выгрузить();
		ДебиторскаяЗадолженность.Свернуть("ДоговорКонтрагента,ДоговорПредставление","Сумма,СуммаВзаиморасчетов");
		ДебиторскаяЗадолженность.Сортировать("ДоговорПредставление,Сумма");
		КредиторскаяЗадолженность.Свернуть("ДоговорКонтрагента,ДоговорПредставление","Сумма,СуммаВзаиморасчетов");
		КредиторскаяЗадолженность.Сортировать("ДоговорПредставление,Сумма");
		
		СтрокаШапки = НСтр("ru = 'Акт взаимозачета № %Номер% от %Дата%'"); 
		СтрокаШапки = СтрЗаменить(СтрокаШапки,"%Номер%", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Шапка.Номер, Истина, Ложь));
		СтрокаШапки = СтрЗаменить(СтрокаШапки,"%Дата%",   Формат(Шапка.Дата, "ДЛФ=DD"));
		СтрокаКредиторки  = СтрокаКредиторки + Формат(КредиторскаяЗадолженность.Итог(КолонкаСуммы), "ЧЦ=15; ЧДЦ=2; ЧН=Ноль") + " " + ПредставлениеВалюты + " " +НСтр("ru = 'по следующим договорам:'");
		
		ОбластьМакета.Параметры.СтрокаШапки      = СтрокаШапки;
		ОбластьМакета.Параметры.СтрокаКредиторки = СтрокаКредиторки;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаКредиторки");
		Для каждого СтрокаЗадолженности Из КредиторскаяЗадолженность Цикл
			ОбластьМакета.Параметры.СтрокаДокументовКред = сокрЛП(СтрокаЗадолженности.ДоговорПредставление) + " :"+ символы.Таб + Формат(СтрокаЗадолженности[КолонкаСуммы], "ЧЦ=15; ЧДЦ=2; ЧН=Ноль") + " " + ПредставлениеВалюты;
			ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЦикла;
		
		ОбластьМакета         = Макет.ПолучитьОбласть("ЗаголовокДебиторки");
		
		СведенияОКонтрагенте  = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шапка.Дебитор, Шапка.Дата);
		ПредставлениеДебитора = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКонтрагенте, "НаименованиеДляПечатныхФорм,");
		
		СтрокаДебиторки       = НСтр("ru = '2. Задолженность %ПредставлениеДебитора% перед %ПредставлениеОрганизации% составляет "
		                      + "%Сумма% %ПредставлениеВалюты% по следующим договорам:'");
		СтрокаДебиторки = СтрЗаменить(СтрокаДебиторки,"%ПредставлениеДебитора%", ПредставлениеДебитора);
		СтрокаДебиторки = СтрЗаменить(СтрокаДебиторки,"%ПредставлениеОрганизации%", ПредставлениеОрганизации);
		СтрокаДебиторки = СтрЗаменить(СтрокаДебиторки,"%ПредставлениеВалюты%", ПредставлениеВалюты);
		СтрокаДебиторки = СтрЗаменить(СтрокаДебиторки,"%Сумма%", Формат(ДебиторскаяЗадолженность.Итог(КолонкаСуммы), "ЧЦ=15; ЧДЦ=2; ЧН=Ноль"));
		
		ОбластьМакета.Параметры.СтрокаДебиторки = СтрокаДебиторки;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаДебиторки");
		Для каждого СтрокаЗадолженности Из ДебиторскаяЗадолженность Цикл
			ОбластьМакета.Параметры.СтрокаДокументовДеб = сокрЛП(СтрокаЗадолженности.ДоговорПредставление) + " :" + Символы.Таб + Формат(СтрокаЗадолженности[КолонкаСуммы], "ЧЦ=15; ЧДЦ=2; ЧН=Ноль") + " " + ПредставлениеВалюты;
			ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЦикла;
		
		ОбластьПодвала     = Макет.ПолучитьОбласть("Подвал");
		СтрокаВзаимозачета = НСтр("ru = '3. Взаимозачет производится на сумму'")+ " "
		                   + Формат(ДебиторскаяЗадолженность.Итог(КолонкаСуммы), "ЧЦ=15; ЧДЦ=2; ЧН=Ноль") + " " + ПредставлениеВалюты;
		ОбластьПодвала.Параметры.СтрокаВзаимозачета       = СтрокаВзаимозачета;
		ОбластьПодвала.Параметры.ПредставлениеОрганизации = ПредставлениеОрганизации;
		ОбластьПодвала.Параметры.ПредставлениеКредитора   = ПредставлениеКредитора;
		ТабличныйДокумент.Вывести(ОбластьПодвала);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);

	КонецЦикла;

	Возврат ТабличныйДокумент;

КонецФункции

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм,ОбъектыПечати, ПараметрыВывода) Экспорт
	
	// Проверяем, нужно ли для макета ОтчетККМ формировать табличный документ.
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "КорректировкаДолга") Тогда
		
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "КорректировкаДолга", "Акт взаимозачета", 
			ПечатьАктаВзаимозачета(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
	
	ОбщегоНазначенияБП.ЗаполнитьДополнительныеПараметрыПечати(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);	
	
КонецПроцедуры

Функция ПолучитьДополнительныеРеквизитыДляРеестра() Экспорт
	
	Результат = Новый Структура("Информация", "КонтрагентДебитор");
	
	Возврат Результат;
	
КонецФункции


#Область ПечатьЧека

Функция ТекстЗапросаПараметрыПечатиЧека(ДокументСсылка, ИменаТаблиц, СообщениеОбОшибке) Экспорт
	
	ТекстЗапроса = ТекстЗапросаРеквизитыПечатиЧека(ИменаТаблиц) 
		+ Документы.РеализацияТоваровУслуг.ТекстЗапросаДанныеДляПечатиЧека(ИменаТаблиц);
		
	Возврат ТекстЗапроса;
КонецФункции

Функция НаименованиеВСтрокеЧека(СтруктураШапки) Экспорт
	
	ШаблонНаименования = НСтр("ru = 'Зачет задолженности между %1 и %2'");
	
	СведенияКонтрагент = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(СтруктураШапки.Контрагент, СтруктураШапки.Дата);
	СведенияОрганизация = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(СтруктураШапки.Организация, СтруктураШапки.Дата, , , , Истина);
	
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонНаименования, СведенияКонтрагент.НаименованиеДляПечатныхФорм, СведенияОрганизация.НаименованиеДляПечатныхФорм);
	
КонецФункции

Функция ТекстЗапросаРеквизитыПечатиЧека(ИменаТаблиц)
	
	ИменаТаблиц.Добавить("ВТ_РасшифровкаПлатежа");
	ИменаТаблиц.Добавить("ВТ_ДоговораПлатежногоАгента");
	ИменаТаблиц.Добавить("ВТ_РеквизитыШапки");
	ИменаТаблиц.Добавить("РеквизитыПечатиЧека");
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	КорректировкаДолгаЗадолженность.Ссылка КАК Ссылка,
	|	КорректировкаДолгаЗадолженность.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	КорректировкаДолгаЗадолженность.Сделка КАК Сделка,
	|	0 КАК СуммаНДС,
	|	НЕОПРЕДЕЛЕНО КАК СтавкаНДС,
	|	СУММА(КорректировкаДолгаЗадолженность.Сумма) КАК СуммаПлатежа,
	|	СУММА(КорректировкаДолгаЗадолженность.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетов
	|ПОМЕСТИТЬ ВТ_РасшифровкаПлатежа
	|ИЗ
	|	Документ.КорректировкаДолга.ДебиторскаяЗадолженность КАК КорректировкаДолгаЗадолженность
	|ГДЕ
	|	КорректировкаДолгаЗадолженность.Ссылка = &ДокументСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	КорректировкаДолгаЗадолженность.Ссылка,
	|	КорректировкаДолгаЗадолженность.ДоговорКонтрагента,
	|	КорректировкаДолгаЗадолженность.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасшифровкаПлатежа.Ссылка КАК Ссылка,
	|	МАКСИМУМ(РасшифровкаПлатежа.ДоговорКонтрагента) КАК ДоговорПлатежногоАгента,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РасшифровкаПлатежа.ДоговорКонтрагента) КАК КоличествоДоговоров,
	|	РасшифровкаПлатежа.ДоговорКонтрагента.Владелец КАК ПлатежныйАгент
	|ПОМЕСТИТЬ ВТ_ДоговораПлатежногоАгента
	|ИЗ
	|	ВТ_РасшифровкаПлатежа КАК РасшифровкаПлатежа
	|ГДЕ
	|	РасшифровкаПлатежа.ДоговорКонтрагента.ПлатежныйАгент
	|
	|СГРУППИРОВАТЬ ПО
	|	РасшифровкаПлатежа.Ссылка,
	|	РасшифровкаПлатежа.ДоговорКонтрагента.Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КорректировкаДолга.Ссылка КАК Ссылка,
	|	КорректировкаДолга.Дата КАК Дата,
	|	КорректировкаДолга.Номер КАК Номер,
	|	КорректировкаДолга.Организация КАК Организация,
	|	КорректировкаДолга.КонтрагентДебитор КАК Контрагент,
	|	КорректировкаДолга.СуммаДтЗадолженности КАК СуммаДокумента,
	|	КорректировкаДолга.ВалютаДокумента КАК ВалютаДокумента,
	|	ЕСТЬNULL(ВТ_ДоговораПлатежногоАгента.ДоговорПлатежногоАгента, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК ДоговорПлатежногоАгента,
	|	ЕСТЬNULL(ВТ_ДоговораПлатежногоАгента.ПлатежныйАгент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК ПлатежныйАгент,
	|	ЕСТЬNULL(ВТ_ДоговораПлатежногоАгента.КоличествоДоговоров, 0) > 1 КАК НесколькоДоговоровПлатежногоАгента
	|ПОМЕСТИТЬ ВТ_РеквизитыШапки
	|ИЗ
	|	Документ.КорректировкаДолга КАК КорректировкаДолга
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДоговораПлатежногоАгента КАК ВТ_ДоговораПлатежногоАгента
	|		ПО КорректировкаДолга.Ссылка = ВТ_ДоговораПлатежногоАгента.Ссылка
	|ГДЕ
	|	КорректировкаДолга.Ссылка = &ДокументСсылка
	|	И КорректировкаДолга.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.ЗачетЗадолженности)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РеквизитыШапки.Ссылка КАК Ссылка,
	|	ВТ_РеквизитыШапки.Организация КАК Организация,
	|	ВТ_РеквизитыШапки.СуммаДокумента КАК СуммаДокумента,
	|	ВТ_РеквизитыШапки.Контрагент КАК Контрагент,
	|	НЕОПРЕДЕЛЕНО КАК Склад,
	|	ВТ_РеквизитыШапки.Дата КАК Дата,
	|	ВТ_РеквизитыШапки.Номер КАК Номер,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОплатыККТ.ВстречноеПредоставление) КАК ТипОплаты,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств) КАК ТипРасчета,
	|	ВТ_РеквизитыШапки.ДоговорПлатежногоАгента КАК ДоговорПлатежногоАгента,
	|	ВТ_РеквизитыШапки.ПлатежныйАгент КАК ПлатежныйАгент,
	|	ВТ_РеквизитыШапки.НесколькоДоговоровПлатежногоАгента КАК НесколькоДоговоровПлатежногоАгента,
	|	ВТ_РеквизитыШапки.ВалютаДокумента КАК ВалютаДокумента,
	|	НЕОПРЕДЕЛЕНО КАК Патент
	|ИЗ
	|	ВТ_РеквизитыШапки КАК ВТ_РеквизитыШапки";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
КонецФункции


#КонецОбласти 

#КонецЕсли
