#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// См. также БухгалтерскийУчетВызовСервераПовтИсп.ОсновнаяНоменклатурнаяГруппа(),
//           БухгалтерскийУчетВызовСервераПовтИсп.ИспользоватьОднуНоменклатурнуюГруппу()

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов


#Область ПроцедурыИФункцииПечати

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОбновления

Процедура ПерезаполнитьКонстантуИспользоватьНесколькоНоменклатурныхГрупп() Экспорт
	
	МенеджерКонстанты = Константы.ИспользоватьНесколькоНоменклатурныхГрупп.СоздатьМенеджерЗначения();
	МенеджерКонстанты.Значение = Истина;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(МенеджерКонстанты);
	
КонецПроцедуры

#КонецОбласти

#Область ОсновнаяНоменклатурнаяГруппа

Функция НайтиСоздатьОсновнуюНоменклатурнуюГруппу() Экспорт
	
	КоличествоНоменклатурныхГрупп = КоличествоНоменклатурныхГрупп();
	Если КоличествоНоменклатурныхГрупп = 0 Тогда
		
		НаименованиеОсновнойНоменклатурнойГруппы = НСтр("ru = 'Основная номенклатурная группа'");
		
		УстановитьПривилегированныйРежим(Истина);
		
		НовыйЭлемент = Справочники.НоменклатурныеГруппы.СоздатьЭлемент();
		НовыйЭлемент.Заполнить(Неопределено);
		НовыйЭлемент.Наименование = НаименованиеОсновнойНоменклатурнойГруппы;
		НовыйЭлемент.Записать();
		
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ИспользоватьНесколькоНоменклатурныхГрупп

Процедура ПроверитьЗначениеОпцииИспользоватьНесколькоНоменклатурныхГрупп() Экспорт

	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоНоменклатурныхГрупп") И КоличествоНоменклатурныхГрупп() > 1 Тогда
	
		УстановитьПривилегированныйРежим(Истина);
		Константы.ИспользоватьНесколькоНоменклатурныхГрупп.Установить(Истина);
		ОбновитьПовторноИспользуемыеЗначения();
	
	КонецЕсли;

КонецПроцедуры

Функция КоличествоНоменклатурныхГрупп()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК Количество
	|ИЗ
	|	Справочник.НоменклатурныеГруппы КАК НоменклатурныеГруппы
	|ГДЕ
	|	НЕ НоменклатурныеГруппы.ЭтоГруппа";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Количество = Выборка.Количество;
	Иначе
		Количество = 0;
	КонецЕсли;
	
	Возврат Количество;
	
КонецФункции

#КонецОбласти

#КонецЕсли