
#Область КомандыФормы

&НаКлиенте
Процедура АвансовыеОтчеты(Команда)
	
	ОткрытьФормуВОкнеФормы("Документ.АвансовыйОтчет.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыПредпринимателя(Команда)
	
	ОткрытьФормуВОкнеФормы("Документ.РасходыПредпринимателя.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ПлатежныйКалендарь(Команда)
	
	ОткрытьФормуВОкнеФормы("Обработка.ПлатежныйКалендарь.Форма");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьФормуВОкнеФормы(ИмяФормы)
	
	ОткрытьФорму(ИмяФормы, , ЭтотОбъект, ИмяФормы, Окно);
	
КонецПроцедуры

#КонецОбласти