#Область СлужебныйПрограммныйИнтерфейс

Функция МожноПодключитьОбсуждения() Экспорт
	
	Возврат ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Обсуждения");
	
КонецФункции

Функция ОбсужденияПодключены() Экспорт
	
	Если МожноПодключитьОбсуждения() Тогда
		МодульОбсуждения = ОбщегоНазначения.ОбщийМодуль("Обсуждения");
		Возврат МодульОбсуждения.ОбсужденияДоступны();
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ДатаНачалаСверкиРасчетов() Экспорт
	
	Возврат СервисСверкиРасчетов.ДатаНачалаСверкиРасчетов();
	
КонецФункции

#КонецОбласти
