#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из Договоры Цикл
		Если Лев(Строка.ЗначенияРеквизитов, 5) = "e1cib" Тогда
			СтруктураЗначенияРеквизитов = ПолучитьИзВременногоХранилища(Строка.ЗначенияРеквизитов);
			Строка.ЗначенияРеквизитов = ЗначениеВСтрокуВнутр(СтруктураЗначенияРеквизитов);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Строка Из ПлатежныеПоручения Цикл
		Если Лев(Строка.ЗначенияРеквизитов, 5) = "e1cib" Тогда
			СтруктураЗначенияРеквизитов = ПолучитьИзВременногоХранилища(Строка.ЗначенияРеквизитов);
			Строка.ЗначенияРеквизитов = ЗначениеВСтрокуВнутр(СтруктураЗначенияРеквизитов);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли



