
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПредыдущиеПлатежи = Параметры.ПредыдущиеПлатежи;
	ОстатокЕНС = Параметры.ОстатокЕНС;
	ДоступноНаЕНС = ОстатокЕНС - ПредыдущиеПлатежи;
	СформироватьЗаголовокДоступноНаЕНС(ОстатокЕНС, ПредыдущиеПлатежи);
	
	ДоступноКСписанию = Параметры.ДоступноКСписанию;
	СуммаНалога = Параметры.СуммаНалога;
	
	КДоплате = СуммаНалога - ДоступноКСписанию;
	СформироватьЗаголовокКДоплате();
	
	Заголовок = СтрШаблон(НСтр("ru = 'Доступно к списанию с ЕНС в счет %1'"), Параметры.Наименование);
КонецПроцедуры

 #КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьЗаголовокДоступноНаЕНС(ОстатокЕНС, ПредыдущиеПлатежи)
	
	Если ПредыдущиеПлатежи = 0 Тогда
		ТекстДоступноНаЕНС = СтрШаблон(НСтр("ru='1. Доступно на ЕНС = Остаток ЕНС
			| (%1)'"),
			Формат(ОстатокЕНС, "ЧН=0,00"));
	Иначе
		ТекстДоступноНаЕНС = СтрШаблон(НСтр("ru='1. Доступно на ЕНС = Остаток ЕНС - Предыдущие платежи
			| (%1 %2)'"),
			Формат(ОстатокЕНС, "ЧН=0,00"),
			Формат(-ПредыдущиеПлатежи, "ЧДЦ=0; ЧО=2"));
	КонецЕсли;
	
	Элементы.ДоступноНаЕНС.Заголовок = ТекстДоступноНаЕНС;
КонецПроцедуры

&НаСервере
Процедура СформироватьЗаголовокКДоплате()
	
	Элементы.КДоплате.Заголовок = СтрШаблон(НСтр("ru='4. К доплате = Сумма налога - Доступно к списанию с ЕНС
	| (%1 %2)'"),
		СуммаНалога,
		Формат(-ДоступноКСписанию, "ЧДЦ=0; ЧО=2"));
	
КонецПроцедуры

#КонецОбласти

