#Область ПрограммныйИнтерфейс

Функция Сформировать(Часть1, Часть2, Часть3 = "", Часть4 = "", Часть5 = "", Часть6 = "", Часть7 = "", Часть8 = "", Часть9 = "", Часть10 = "") Экспорт
	
	Результат = Часть1;
	Результат = Результат + Разделитель(Результат) + Нормализовать(Часть2);
	
	Если НЕ ПустаяСтрока(Часть3) Тогда
		Результат = Результат + Разделитель(Результат) + Нормализовать(Часть3);
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(Часть4) Тогда
		Результат = Результат + Разделитель(Результат) + Нормализовать(Часть4);
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(Часть5) Тогда
		Результат = Результат + Разделитель(Результат) + Нормализовать(Часть5);
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(Часть6) Тогда
		Результат = Результат + Разделитель(Результат) + Нормализовать(Часть6);
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(Часть7) Тогда
		Результат = Результат + Разделитель(Результат) + Нормализовать(Часть7);
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(Часть8) Тогда
		Результат = Результат + Разделитель(Результат) + Нормализовать(Часть8);
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(Часть9) Тогда
		Результат = Результат + Разделитель(Результат) + Нормализовать(Часть9);
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(Часть10) Тогда
		Результат = Результат + Разделитель(Результат) + Нормализовать(Часть10);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция Разделитель(СтрокаURL)
	
	Возврат ?(Прав(СтрокаURL, 1) = "/", "", "/");
	
КонецФункции

Функция Нормализовать(СтрокаURL)
	
	Возврат ?(Лев(СтрокаURL, 1) = "/", Сред(СтрокаURL, 2), СтрокаURL);
	
КонецФункции

#КонецОбласти
