#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Позволяет дополнить предопределенные правила сдачи отчетов и уплаты налогов
// специфичными для конфигурации правилами.
//
// Параметры:
//  Правила - ТаблицаЗначений - содержит предопределенные правила конфигурации, колонки:
//   Идентификатор      - Строка
//   Представление      - Строка
//   НаименованиеПолное - Строка
//   Порядок            - Число
//   Требования         - ТаблицаЗначений - см. Справочники.ЗадачиБухгалтера.НовыйОписаниеТребования()
//
Процедура ПриПолученииПредопределенныхПравилСдачиОтчетовУплатыНалогов(Правила) Экспорт
	
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли