
#Область ПрограммныйИнтерфейс

// Вместо этой функции рекомендуется использовать функцию ВыполнениеЗадачБухгалтераПовтИспНаВызов.ПараметрыСтраховыхВзносов()
// Получает таблицу счетов и видов налогов для страховых взносов.
//
// Параметры:
//  ПериодСобытия - Дата - месяц, на который нужно получить параметры.
//
// Возвращаемое значение:
//   ТаблицаЗначений - информация о действующих страховых взносах.
//                   * Налог - СправочникСсылка.ВидыНалоговИПлатежейВБюджет - описываемый налог.
//                   * ВидНалоговогоОбязательства - ПеречислениеСсылка.ВидыПлатежейВГосБюджет - вид налога.
//                   * СчетУчета - ПланСчетовСсылка.Хозрасчетный - счет расчетов по налогу.
//                   * КБК - Строка - код налога.
//                   * НазначениеПлатежа - Строка - назначение для платежного поручения.
//
Функция ПараметрыСтраховыхВзносов(ПериодСобытия) Экспорт
	
	Если ПериодСобытия = НачалоГода(ПериодСобытия) Тогда
		ТаблицаСчетовСтраховыхВзносов = ВыполнениеЗадачБухгалтера.ПараметрыСтраховыхВзносов(ПериодСобытия);
	Иначе // параметры страховых взносов в течение года не меняются
		ТаблицаСчетовСтраховыхВзносов = ВыполнениеЗадачБухгалтераПовтИспНаВызов.ПараметрыСтраховыхВзносов(НачалоГода(ПериодСобытия));
	КонецЕсли;
	
	Возврат ТаблицаСчетовСтраховыхВзносов;
	
КонецФункции

// Возвращает признак того, что задача предназначена для процесса закрытия ИП
//
// Параметры:
//   ИдентификаторЗадачи - Строка - Код правила (см. Справочник.ПравилаПредставленияОтчетовУплатыНалогов)
//
// Возвращаемое значение:
//   Булево
//
Функция ЭтоЗадачаЗакрытияИП(ИдентификаторЗадачи) Экспорт
	
	// Задачи снятия с учета организации
	// Точка запуска: проставление в Организации даты закрытия из Листа записи ЕГР
	
	КлючИдентификатора = "СнятиеСУчета";
	
	Возврат СтрНайти(ИдентификаторЗадачи, КлючИдентификатора) > 0;
	
КонецФункции

// Возвращает признак того, что задача предназначена для процесса закрытия ИП
//
// Параметры:
//   ИдентификаторЗадачи - Строка - Код правила (см. Справочник.ПравилаПредставленияОтчетовУплатыНалогов)
//
// Возвращаемое значение:
//   Булево
//
Функция ЭтоЗадачаОплатыУставногоКапитала(ИдентификаторЗадачи) Экспорт
	
	// Событие по оплате уставного капитала
	// Точка запуска:
	// 1. При создании документа "Формирование уставного капитала"
	// 2. При вводе начальных остатков по уставному капиталу, при этом уставный капитал не оплачен или оплачен частично
	
	КлючИдентификатора = "ОплатаУставногоКапитала";
	
	Возврат СтрНайти(ИдентификаторЗадачи, КлючИдентификатора) > 0;
	
КонецФункции

#КонецОбласти