#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	УправлениеЭлементамиФормы(ЭтотОбъект);
	СобытияФормИС.СброситьРазмерыИПоложениеОкна(ЭтотОбъект);
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	СобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	УстановитьОрганизациюВладельцаМестаХранения();
	СобытияФормИСПереопределяемый.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	СобытияФормИСКлиентПереопределяемый.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъекта(Объект.Ссылка, ПараметрыЗаписи);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияСтрокойОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьОрганизациюВладельца" Тогда
		
		ПоказатьЗначение(, Организация);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьИзСервиса(Команда)
	
	ПараметрОповещения = ЗагрузитьМестоХраненияНаСервере();
	
	Если ЗначениеЗаполнено(ПараметрОповещения) Тогда
		
		ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъекта(Объект.Ссылка, ПараметрОповещения);
		УстановитьОрганизациюВладельцаМестаХранения();
		
		Закрыть();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДанныеСАТУРН(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Идентификатор",                 Объект.Идентификатор);
	ПараметрыФормы.Вставить("НеПоказыватьСостояниеЗагрузки", Истина);
	
	ОткрытьФорму(
		"Справочник.МестаХраненияСАТУРН.Форма.ДанныеКлассификатора",
		ПараметрыФормы, ЭтотОбъект,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗагрузитьМестоХраненияНаСервере()
	
	Результат = ИнтерфейсСАТУРНВызовСервера.МестоХраненияПоИдентификатору(Объект.Идентификатор);
		
	Если Не ПустаяСтрока(Результат.ТекстОшибки) Тогда
		
		ВызватьИсключение Результат.ТекстОшибки;
		
	Иначе
		
		ДанныеМестаХранения = ИнтерфейсСАТУРН.ДанныеМестаХранения(Результат.Элемент);
		МестоХранения = ИнтеграцияСАТУРН.ЗагрузитьМестоХранения(ДанныеМестаХранения,, Результат.ПараметрыОбмена); 

	КонецЕсли;
	
	Возврат МестоХранения;
	
КонецФункции

&НаСервере
Процедура УстановитьОрганизациюВладельцаМестаХранения()
	
	МассивОрганизаций     = Справочники.МестаХраненияСАТУРН.ОрганизацииВладельцыМестаХранения(Объект.Ссылка);
	МассивСтрок           = Новый Массив;
	КоличествоОрганизаций = МассивОрганизаций.Количество();
	
	Если КоличествоОрганизаций = 0 Тогда
		
		Строка = Новый ФорматированнаяСтрока(НСтр("ru = '<не указана>'"),, ЦветаСтиля.ЦветТекстаТребуетВниманияГосИС);
		МассивСтрок.Добавить(Строка);
		
	ИначеЕсли КоличествоОрганизаций = 1 Тогда
		
		Организация = МассивОрганизаций[0];
		
		Строка = Новый ФорматированнаяСтрока(Строка(Организация),, ЦветаСтиля.ЦветГиперссылкиГосИС,, "ОткрытьОрганизациюВладельца");
		МассивСтрок.Добавить(Строка);
		
	Иначе
		
		Организация  = МассивОрганизаций[0];
		ШаблонСтроки = НСтр("ru = '%1 ( + еще %2 )'");
		
		Строка = Новый ФорматированнаяСтрока(СтрШаблон(ШаблонСтроки, Организация, КоличествоОрганизаций - 1),, ЦветаСтиля.ЦветГиперссылкиГосИС,, "ОткрытьОрганизациюВладельца");
		МассивСтрок.Добавить(Строка);
		
	КонецЕсли;
	
	ОрганизацияСтрокой = Новый ФорматированнаяСтрока(МассивСтрок);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеЭлементамиФормы(Форма)
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Элементы.ТребуетсяЗагрузка.Видимость = Объект.ТребуетсяЗагрузка;
	
КонецПроцедуры

#КонецОбласти
