// @strict-types

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// см. ОбщегоНазначенияКлиентПереопределяемый.ПослеНачалаРаботыСистемы
// Не используется ОбщегоНазначенияПереопределяемый.ПриПериодическомПолученииДанныхКлиентаНаСервере т.к.
// этот метод для периодических вызовов, а текущий вызов единоразовый. Альтернатива обработчик обновления.
//
Процедура ПослеНачалаРаботыСистемы() Экспорт
	
	РекламныйСервисСлужебныйКлиент.ПослеНачалаРаботыСистемы();
	
КонецПроцедуры

#КонецОбласти

// Обработчик события формы "ПриОткрытии".
// Подключает обработчик ожидания "Подключаемый_ЗаполнитьРекламныйНоситель", который запускает ожидание выполнения 
// фонового задания по формированию рекламы.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма источник вызова.
//
Процедура ПриОткрытии(Форма) Экспорт
	
	РекламныйСервисСлужебныйКлиент.ПриОткрытии(Форма);
	
КонецПроцедуры

// Заполнить изображение рекламы.
// Запускает ожидание выполнения фонового задания по формированию рекламы.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма источник вызова.
//
Процедура ЗаполнитьРекламныйНоситель(Форма) Экспорт
	
	РекламныйСервисСлужебныйКлиент.ЗаполнитьРекламныйНоситель(Форма);
	
КонецПроцедуры

// Показать кнопку закрытия рекламы.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма источник вызова.
//
Процедура ПоказатьКнопкуЗакрытьРекламу(Форма) Экспорт
	
	РекламныйСервисСлужебныйКлиент.ПоказатьКнопкуЗакрытьРекламу(Форма);
	
КонецПроцедуры

// Обработчик команды формы Нажатие, выполнение целевого действия.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - формы вызова.
//  ДанныеСобытия - ФиксированнаяСтруктура - платформенный параметр:
//   * Anchor - Неопределено, ВнешнийОбъект - элемент А, если нажали на ссылку.
//   * Element - ВнешнийОбъект:
//    ** baseURI - Строка - базовая ссылка.
//    ** id - Строка - уникальный идентификатор рекламы.
//    ** className - Строка - имя класса
//    ** parentElement - КлючИЗначение:
//     *** attributes - Массив из КлючИЗначение:
//      **** name - Строка
//      **** value - Строка
//   * Button - Неопределено, ВнешнийОбъект - элемент input c типом button или элемент button, если нажали на кнопку.
//   * Event - ВнешнийОбъект - передается информация о событии, специфичная для используемого браузера.
//   * Document - ВнешнийОбъект - документ, являющийся владельцем элемента, на котором было произведено нажатие.
//   * Href - Неопределено, Строка - ссылка элемента.
//  СтандартнаяОбработка - Булево
//
Процедура МакетРекламныйСервисНажатие(Форма, Знач ДанныеСобытия, СтандартнаяОбработка) Экспорт
	РекламныйСервисСлужебныйКлиент.МакетРекламныйСервисНажатие(Форма, ДанныеСобытия, СтандартнаяОбработка);
КонецПроцедуры

// Обработчик команды закрыть рекламу.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма источник вызова.
//
Процедура КомандаЗакрытьРекламу(Форма) Экспорт
	
	РекламныйСервисСлужебныйКлиент.КомандаЗакрытьРекламу(Форма);
	
КонецПроцедуры

#КонецОбласти