#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция СсылкиКаналаБизнесСтарт() Экспорт
	
	ТаблицаСсылок = НоваяТаблицаСсылок();
	ДобавитьСсылку("intro", НСтр("ru = 'Введение в программу 1С:БизнесСтарт'"), ТаблицаСсылок);
	ДобавитьСсылку("depositingip", НСтр("ru = 'Начало работы в программе. Взнос денег на счет ИП'"), ТаблицаСсылок);
	ДобавитьСсылку("goodsandpartners", НСтр("ru = 'Учет товара. Поступление товаров. Информация о контрагентах'"), ТаблицаСсылок);
	ДобавитьСсылку("cashregister", НСтр("ru = 'Онлайн-касса'"), ТаблицаСсылок);
	ДобавитьСсылку("sellingforcashusnd", НСтр("ru = 'Продажа покупателю юридическому лицу за наличный расчет'"), ТаблицаСсылок, Ложь);
	ДобавитьСсылку("retailusnd", НСтр("ru = 'Розничные продажи'"), ТаблицаСсылок);
	ДобавитьСсылку("creditcardsusnd", НСтр("ru = 'Прием оплаты платежными картами'"), ТаблицаСсылок);
	ДобавитьСсылку("suppliers", НСтр("ru = 'Договор с поставщиком. Досье контрагента. Загрузка прайс-листа. Поступление товаров безнал'"), ТаблицаСсылок);
	ДобавитьСсылку("invoicingusnd", НСтр("ru = 'Продажа покупателю за безналичный расчет'"), ТаблицаСсылок);
	ДобавитьСсылку("banking", НСтр("ru = 'Работа с банком'"), ТаблицаСсылок);
	ДобавитьСсылку("outsourcingusnd", НСтр("ru = 'Расходы на аутсорсинг'"), ТаблицаСсылок, Ложь);
	ДобавитьСсылку("businesstrip", НСтр("ru = 'Оформление командировочных расходов'"), ТаблицаСсылок, Ложь);
	ДобавитьСсылку("taxreturnusnd", НСтр("ru = 'Отчетность УСН'"), ТаблицаСсылок, Ложь);
	ДобавитьСсылку("incomebookusnd", НСтр("ru = 'Книга учета доходов и расходов УСН «доходы»'"), ТаблицаСсылок, Ложь);
	ДобавитьСсылку("insurancefee", НСтр("ru = 'Страховые взносы ИП за себя'"), ТаблицаСсылок, Ложь);
	
	МассивПодстрок = Новый Массив;
	
	Для НомерСтроки = 1 По ТаблицаСсылок.Количество() Цикл
		СвойстваСсылки = ТаблицаСсылок[НомерСтроки - 1];
		Если СвойстваСсылки.Используется Тогда
			МассивПодстрок.Добавить(Формат(НомерСтроки, "ЧГ=0"));
			МассивПодстрок.Добавить(". ");
			МассивПодстрок.Добавить(Новый ФорматированнаяСтрока(СвойстваСсылки.Представление, , , , СвойстваСсылки.Ссылка));
			МассивПодстрок.Добавить(Символы.ПС);
			МассивПодстрок.Добавить(" ");
			МассивПодстрок.Добавить(Символы.ПС);
		КонецЕсли;
	КонецЦикла;
	
	МассивПодстрок.Добавить(СсылкаНаКаналБизнесСтарт());
	
	Возврат Новый ФорматированнаяСтрока(МассивПодстрок);
	
КонецФункции

Функция СсылкаНаКаналБизнесСтарт() Экспорт
	
	Возврат СтроковыеФункции.ФорматированнаяСтрока(
		НСтр("ru = 'Посмотрите канал <a href=""http://its.1c.ru/bmk/youtube/bs/channel"">Онлайн-бухгалтерия 1С:БизнесСтарт</a>'"));
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НоваяТаблицаСсылок()
	
	ТаблицаСсылок = Новый ТаблицаЗначений;
	ТаблицаСсылок.Колонки.Добавить("Ссылка", ОбщегоНазначения.ОписаниеТипаСтрока(200));
	ТаблицаСсылок.Колонки.Добавить("Представление", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТаблицаСсылок.Колонки.Добавить("Используется", Новый ОписаниеТипов("Булево"));
	
	Возврат ТаблицаСсылок;
	
КонецФункции

Функция ДобавитьСсылку(Идентификатор, Представление, ТаблицаСсылок, Используется = Истина)
	
	ШаблонСсылок = "http://its.1c.ru/bmk/youtube/bs/%1";
	
	СвойстваСсылки = ТаблицаСсылок.Добавить();
	СвойстваСсылки.Ссылка = СтрШаблон(ШаблонСсылок, Идентификатор);
	СвойстваСсылки.Представление = Представление;
	СвойстваСсылки.Используется = Используется;
	
	Возврат СвойстваСсылки;
	
КонецФункции

#КонецОбласти

#КонецЕсли