#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура;
	
	Если ЗначениеЗаполнено(ПараметрыВыполненияКоманды.Источник.Организация) Тогда
		ПараметрыФормы.Вставить("Организация", ПараметрыВыполненияКоманды.Источник.Организация);
	КонецЕсли;
	
	ОткрытьФорму("Документ.КорректировкаЕНС.ФормаСписка",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти