#Область ПрограммныйИнтерфейс

// Удаляет из массива ссылки на объекты, к которым у пользователя нет доступа
// Параметры:
//  МассивСсылок  - Массив - массив ссылок, из которого надо удалить те, к которым нет доступа
//
Процедура УдалитьНедоступныеЭлементыИзМассива(МассивСсылок) Экспорт
	
	Запрос = Новый Запрос;
	ОбъектыПоТипам = Новый Соответствие;
	
	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		Возврат;
	КонецЕсли;
	
	// Исключим из массива объекты  на чтение которых у пользователя нет прав по ролям.
	Для каждого Ссылка Из МассивСсылок Цикл
		Если ЗначениеЗаполнено(Ссылка) И ПравоДоступа("Чтение", Ссылка.Метаданные()) Тогда
			СсылкиЭтогоТипа = ОбъектыПоТипам[Ссылка.Метаданные()];
			Если СсылкиЭтогоТипа = Неопределено Тогда
				СсылкиЭтогоТипа = Новый Массив;
				ОбъектыПоТипам.Вставить(Ссылка.Метаданные(), СсылкиЭтогоТипа);
			КонецЕсли;
			СсылкиЭтогоТипа.Добавить(Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	Если ОбъектыПоТипам.Количество() = 0 Тогда
		// Все ссылки не доступны, вернем пустой массив.
		МассивСсылок = Новый Массив;
		Возврат;
	КонецЕсли;
	
	// С помощью запроса определим объекты, разрешенные по RLS.
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.ПакетЗапросов[0].ВыбиратьРазрешенные = Истина;
	Индекс = 0;
	Для каждого Объекты Из ОбъектыПоТипам Цикл
		
		Если Индекс = 0 Тогда
			// Оператор с индексом [0] создается конструктором схемы запроса всегда.
			Оператор = СхемаЗапроса.ПакетЗапросов[0].Операторы[0];
		Иначе
			Оператор = СхемаЗапроса.ПакетЗапросов[0].Операторы.Добавить();
		КонецЕсли;
		
		ИмяПараметра = СтрШаблон("МассивОбъектов_%1", Формат(Индекс + 1, "ЧГ=0"));
		
		Оператор.ВыбиратьРазличные = Истина;
		Оператор.Источники.Добавить(Объекты.Ключ.ПолноеИмя());
		Оператор.ВыбираемыеПоля.Добавить("Ссылка");
		Оператор.Отбор.Добавить(СтрШаблон("Ссылка В(&%1)", ИмяПараметра));
		
		Запрос.УстановитьПараметр(ИмяПараметра, Объекты.Значение);
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	ДопустимыеЗначения = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	// Ограничим исходную коллекцию только допустимыми значениями, через сокращение исходного массива чтобы сохранить порядок элементов.
	НедопустимыеЗначения = ОбщегоНазначенияКлиентСервер.РазностьМассивов(МассивСсылок, ДопустимыеЗначения);
	МассивСсылок         = ОбщегоНазначенияКлиентСервер.РазностьМассивов(МассивСсылок, НедопустимыеЗначения);
	
КонецПроцедуры

// Определяет перечень организаций, чтение данных которых, размещенных в конкретном объекте метаданных,
// разрешено пользователю настройками прав доступа.
//
// Функцию можно использовать, если требуется получать данные в привилегированном режиме для предоставления их пользователю - 
// она позволяет ограничить эти данные в соответствии с настройками.
//
// Функцию можно использовать только в тех случаях (для тех объектов),
// когда применяется стандартное ограничение доступа к запрашиваемому объекту метаданных - 
// то есть, аналогичное ограничению, применяемому для регистру бухгалтерии Хозрасчетный
// роли ДобавлениеИзменениеДанныхБухгалтерии.
//
// Порядок использования:
//  1. с помощью функции определяется список доступных организаций
//  2. в текстах запросов к самим данных (регистрам, документам) 
//     устанавливаются отборы по этим организациям
//  3. перед выполнением запроса к данным включается привилегированный режим.
//
// При использовании функции следует иметь в виду, что в общем случае ограничить выбираемые данные
// в соответствии с ОДД по Организации недостаточно:
// 1. в прикладном решении могут использоваться и иные виды доступа, не только Организации
// 2. перед установкой привилегированного режима в вызывающем коде следует проверить наличие прав
//    на чтение запрашиваемой таблицы (регистра, документов) в целом.
//
// Не следует (запрещается) вызывать эту функцию из кода, который может выполняться в привилегированном режиме,
// так как это приведет к последующей неверной ее работе вне привилегированного режима:
// может повторно использоваться значение, вычисленное в привилегированном режиме.
//
// Возвращаемое значение:
//  ФиксированныйМассив - содержит СправочникСсылка.Организации
//
// См. также ОбщегоНазначенияБПВызовСервераПовтИсп.ВсеОрганизацииДанныеКоторыхДоступныПоRLS()
//
// Параметры:
//  ИмяОбъектаДанных - Строка - полное имя объекта данных, доступ к которым проверяется, например, "РегистрБухгалтерии.Хозрасчетный"
//  ПравоНаИзменение - Булево - Истина, если после выполнения запроса данные предполагается менять
//               и нужно проверить, что у пользователя есть право на изменение
//  Пользователь     - СправочникСсылка.Пользователи - Ссылка на пользователя, для которого нужно получить список организаций.
// 
Функция ОрганизацииДанныеКоторыхДоступныПользователю(ИмяОбъектаДанных, ПравоНаИзменение = Ложь, Пользователь = Неопределено) Экспорт
	
	Запрос = Новый Запрос;

	Если Пользователи.ЭтоПолноправныйПользователь(Пользователь , , Ложь)
	 Или Не УправлениеДоступом.ОграничиватьДоступНаУровнеЗаписей() Тогда
		
		// Ограничений по RLS нет, возвращаем все организации из справочника
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Организации.Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации";
		
		МассивОрганизаций = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
		Возврат Новый ФиксированныйМассив(МассивОрганизаций);
		
	КонецЕсли;

	Если ПараметрыСеанса.ОграничениеДоступаНаУровнеЗаписейУниверсально Тогда
	
		// Используется механизм ограничения доступа БСП 3.0.
		// В этом случае проверка права на запись отдельно не учитывается,
		// т.к. права на добавление/изменение/удаление проверяются в момент записи, а не чтения,
		// поэтому считаем, что если есть право на чтение, то может быть доступен и для записи.
		
		// Список доступных организаций получаем в обычном, непривилегированном режиме.
		// Выбираем список организаций, по которым можно читать записи регистра.
		
		Запрос.Текст = СтрЗаменить(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	ИСТИНА В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				ИСТИНА
		|			ИЗ
		|				#ТаблицаРегистра КАК ТаблицаРегистра
		|			ГДЕ
		|				ТаблицаРегистра.Организация = Организации.Ссылка)",
		"#ТаблицаРегистра", ИмяОбъектаДанных);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		МассивОрганизаций = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
		
		// Если по организации не введено ни одной записи, то считаем, что ее данные можно читать любому пользователю.
		
		Запрос.Текст = СтрЗаменить(
		"ВЫБРАТЬ
		|	Организации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|		ЛЕВОЕ СОЕДИНЕНИЕ #ТаблицаРегистра КАК ТаблицаРегистра
		|		ПО Организации.Ссылка = ТаблицаРегистра.Организация
		|ГДЕ
		|	ТаблицаРегистра.Организация ЕСТЬ NULL",
		"#ТаблицаРегистра", ИмяОбъектаДанных);
		
		УстановитьПривилегированныйРежим(Истина);
		РезультатЗапроса = Запрос.Выполнить();
		УстановитьПривилегированныйРежим(Ложь);
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивОрганизаций,
			РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	Иначе

		// Запрос взят из шаблона #ПоЗначениям роли ДобавлениеИзменениеДанныхБухгалтерии
		// с теми параметрами, с которыми он применяется для регистра бухгалтерии Хозрасчетный.
		Запрос.УстановитьПараметр("Пользователь",
			?(Пользователь = Неопределено, Пользователи.ТекущийПользователь(), Пользователь));
		Запрос.УстановитьПараметр("Изменение", ПравоНаИзменение);
		Запрос.УстановитьПараметр("ИмяОбъектаДанных", ИмяОбъектаДанных);
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	Организации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	ИСТИНА В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				ИСТИНА
		|			ИЗ
		|				Справочник.ИдентификаторыОбъектовМетаданных КАК СвойстваТекущейТаблицы
		|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа КАК ГруппыДоступа
		|					ПО
		|						СвойстваТекущейТаблицы.ПолноеИмя = &ИмяОбъектаДанных
		|							И ИСТИНА В
		|								(ВЫБРАТЬ ПЕРВЫЕ 1
		|									ИСТИНА
		|								ИЗ
		|									РегистрСведений.ТаблицыГруппДоступа КАК ТаблицыГруппДоступа
		|								ГДЕ
		|									ТаблицыГруппДоступа.Таблица = СвойстваТекущейТаблицы.Ссылка
		|									И ТаблицыГруппДоступа.ГруппаДоступа = ГруппыДоступа.Ссылка
		|									И ТаблицыГруппДоступа.ПравоИзменение = &Изменение)
		|							И ГруппыДоступа.Ссылка В
		|								(ВЫБРАТЬ
		|									ГруппыДоступаПользователи.Ссылка КАК ГруппаДоступа
		|								ИЗ
		|									Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
		|										ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоставыГруппПользователей КАК СоставыГруппПользователей
		|										ПО
		|											СоставыГруппПользователей.Пользователь = &Пользователь
		|												И СоставыГруппПользователей.ГруппаПользователей = ГруппыДоступаПользователи.Пользователь)
		|			ГДЕ
		|				ВЫБОР
		|					КОГДА ИСТИНА В
		|							(ВЫБРАТЬ ПЕРВЫЕ 1
		|								ИСТИНА
		|							ИЗ
		|								РегистрСведений.ЗначенияГруппДоступа КАК Значения
		|									ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГруппыЗначенийДоступа КАК ГруппыЗначений
		|									ПО
		|										Значения.ГруппаДоступа = ГруппыДоступа.Ссылка
		|											И Значения.ЗначениеДоступа = Организации.Ссылка
		|											И ГруппыЗначений.ЗначениеДоступа = ГруппыЗначений.ГруппаЗначенийДоступа)
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ = ВЫБОР
		|					КОГДА ИСТИНА В
		|							(ВЫБРАТЬ ПЕРВЫЕ 1
		|								ИСТИНА
		|							ИЗ
		|								РегистрСведений.ЗначенияГруппДоступаПоУмолчанию КАК ЗначенияПоУмолчанию
		|							ГДЕ
		|								ЗначенияПоУмолчанию.ГруппаДоступа = ГруппыДоступа.Ссылка
		|								И ТИПЗНАЧЕНИЯ(ЗначенияПоУмолчанию.ТипЗначенийДоступа) = ТИПЗНАЧЕНИЯ(Организации.Ссылка)
		|								И ЗначенияПоУмолчанию.ВсеРазрешены = ЛОЖЬ)
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ)";
		
		Если Не ПравоНаИзменение Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И ТаблицыГруппДоступа.ПравоИзменение = &Изменение", "");
		КонецЕсли;
		Запрос.Текст = ТекстЗапроса;
		
		// Доступ к настройкам RLS выполняется в привилегированном режиме.
		УстановитьПривилегированныйРежим(Истина);
		РезультатЗапроса = Запрос.Выполнить();
		УстановитьПривилегированныйРежим(Ложь);
		
		МассивОрганизаций = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");		
		
	КонецЕсли;

	Возврат Новый ФиксированныйМассив(МассивОрганизаций);
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Заполняет описания поставляемых профилей пользователей в подсистеме БСП "Управление доступом".
// См. УправлениеДоступомПереопределяемый.ПриЗаполненииПоставляемыхПрофилейГруппДоступа()
//
// Параметры:
//  ОписаниеПрофиля		 - см. УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа() - заполняемая коллекция
//
Процедура ЗаполнитьПоставляемыеПрофилиПользователей(ОписанияПрофилей) Экспорт
	
	ОписанияПрофилейБП = Новый Массив;
	ОписанияПрофилейБП.Добавить(ОписаниеПрофиляГлавныйБухгалтер());
	ОписанияПрофилейБП.Добавить(ОписаниеПрофиляБухгалтер());
	ОписанияПрофилейБП.Добавить(ОписаниеПрофиляМенеджерПоПродажам());
	ОписанияПрофилейБП.Добавить(ОписаниеПрофиляКладовщик());
	ОписанияПрофилейБП.Добавить(ОписаниеПрофиляТолькоПросмотр());
	
	ВытеснитьРолиИнтегральнымиРолями(ОписанияПрофилейБП);
	ИсключитьИзбыточныеРолиПросмотра(ОписанияПрофилейБП);
	ЗапретитьРедактированиеОбщихДанных(ОписанияПрофилейБП);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ОписанияПрофилей, ОписанияПрофилейБП);
	
КонецПроцедуры

// Включает виды доступа в подсистеме БСП "Управление доступом".
// См. УправлениеДоступомПереопределяемый.ПриЗаполненииВидовДоступа()
//
Процедура ЗаполнитьВидыДоступа(ВидыДоступа) Экспорт
	
	// Организации
	Если ВидыДоступа.Найти("Организации", "Имя") = Неопределено Тогда // Могут быть добавлены библиотеками
		ВидДоступа = ВидыДоступа.Добавить();
		ВидДоступа.Имя           = "Организации";
		ВидДоступа.Представление = НСтр("ru = 'Организации'");
		ВидДоступа.ТипЗначений   = Тип("СправочникСсылка.Организации");
	КонецЕсли;
	
	// Виды операций документа "ПКО"
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя           = "ВидыОперацийПКО";
	ВидДоступа.Представление = НСтр("ru = 'Виды поступления наличных'");
	ВидДоступа.ТипЗначений   = Тип("ПеречислениеСсылка.ВидыОперацийПКО");
	
	// Виды операций документа "Поступление товаров и услуг"
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя           = "ВидыОперацийПТиУ";
	ВидДоступа.Представление = НСтр("ru = 'Виды поступления товаров и услуг'");
	ВидДоступа.ТипЗначений   = Тип("ПеречислениеСсылка.ВидыОперацийПоступлениеТоваровУслуг");
	
КонецПроцедуры

Процедура ЗаполнитьВидыОграниченийПравОбъектовМетаданных(Описание) Экспорт

	Описание = "
	|Справочник.АвансовыйПлатежИностранцаПоНДФЛПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.АвансовыйПлатежИностранцаПоНДФЛПрисоединенныеФайлы.Чтение.Организации
	|Справочник.АвансовыйПлатежИностранцаПоНДФЛПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.АвансовыйПлатежИностранцаПоНДФЛПрисоединенныеФайлы.Изменение.Организации
	|Справочник.АктПроверкиСтраховыхВзносовПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.АктПроверкиСтраховыхВзносовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.АктПроверкиСтраховыхВзносовПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.АктПроверкиСтраховыхВзносовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.БанковскиеКартыКонтрагентов.Чтение.ГруппыФизическихЛиц
	|Справочник.БанковскиеКартыКонтрагентов.Изменение.ГруппыФизическихЛиц
	|Справочник.БанковскиеСчета.Чтение.ГруппыФизическихЛиц
	|Справочник.БанковскиеСчета.Чтение.Организации
	|Справочник.БанковскиеСчета.Изменение.ГруппыФизическихЛиц
	|Справочник.БанковскиеСчета.Изменение.Организации
	|Справочник.Билеты.Чтение.Организации
	|Справочник.Билеты.Изменение.Организации
	|Справочник.БольничныйЛистПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.БольничныйЛистПрисоединенныеФайлы.Чтение.Организации
	|Справочник.БольничныйЛистПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.БольничныйЛистПрисоединенныеФайлы.Изменение.Организации
	|Справочник.БронированиеГражданПребывающихВЗапасеПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.БронированиеГражданПребывающихВЗапасеПрисоединенныеФайлы.Чтение.Организации
	|Справочник.БронированиеГражданПребывающихВЗапасеПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.БронированиеГражданПребывающихВЗапасеПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВедомостьНаВыплатуЗарплатыВБанкПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ВедомостьНаВыплатуЗарплатыВБанкПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВедомостьНаВыплатуЗарплатыВБанкПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ВедомостьНаВыплатуЗарплатыВБанкПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВедомостьНаВыплатуЗарплатыВКассуПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ВедомостьНаВыплатуЗарплатыВКассуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВедомостьНаВыплатуЗарплатыВКассуПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ВедомостьНаВыплатуЗарплатыВКассуПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВедомостьНаВыплатуЗарплатыПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ВедомостьНаВыплатуЗарплатыПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВедомостьНаВыплатуЗарплатыПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ВедомостьНаВыплатуЗарплатыПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВедомостьУплатыАДВ_11ПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВедомостьУплатыАДВ_11ПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВерсииФайлов.Чтение.Объект.БизнесПроцесс.Задание
	|Справочник.ВерсииФайлов.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаИзменитьЛичныеДанные
	|Справочник.ВерсииФайлов.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаНалоговыйВычет
	|Справочник.ВерсииФайлов.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаОтпуск
	|Справочник.ВерсииФайлов.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаОтсутствиеПоБолезни
	|Справочник.ВерсииФайлов.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаСправка2НДФЛ
	|Справочник.ВерсииФайлов.Чтение.Объект.БизнесПроцесс.ОбращениеСотрудника
	|Справочник.ВерсииФайлов.Чтение.Объект.БизнесПроцесс.УдалитьЗаявкаКабинетСотрудника
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.УдалитьЗаявлениеАбонентаСпецоператораСвязи
	|Справочник.ВерсииФайлов.Чтение.Объект.Задача.ЗадачаИсполнителя
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.Организации
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.ПапкиФайлов
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.ФизическиеЛица
	|Справочник.ВерсииФайлов.Изменение.Объект.БизнесПроцесс.Задание
	|Справочник.ВерсииФайлов.Изменение.Объект.БизнесПроцесс.ЗаявкаСотрудникаИзменитьЛичныеДанные
	|Справочник.ВерсииФайлов.Изменение.Объект.БизнесПроцесс.ЗаявкаСотрудникаНалоговыйВычет
	|Справочник.ВерсииФайлов.Изменение.Объект.БизнесПроцесс.ЗаявкаСотрудникаОтпуск
	|Справочник.ВерсииФайлов.Изменение.Объект.БизнесПроцесс.ЗаявкаСотрудникаОтсутствиеПоБолезни
	|Справочник.ВерсииФайлов.Изменение.Объект.БизнесПроцесс.ЗаявкаСотрудникаСправка2НДФЛ
	|Справочник.ВерсииФайлов.Изменение.Объект.БизнесПроцесс.ОбращениеСотрудника
	|Справочник.ВерсииФайлов.Изменение.Объект.БизнесПроцесс.УдалитьЗаявкаКабинетСотрудника
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.УдалитьЗаявлениеАбонентаСпецоператораСвязи
	|Справочник.ВерсииФайлов.Изменение.Объект.Задача.ЗадачаИсполнителя
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.Организации
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.ПапкиФайлов
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.ФизическиеЛица
	|Справочник.ВидыДеятельностиЕНВД.Чтение.Организации
	|Справочник.ВидыДеятельностиЕНВД.Изменение.Организации
	|Справочник.ВидыОплатОрганизаций.Чтение.Организации
	|Справочник.ВидыОплатОрганизаций.Изменение.Организации
	|Справочник.ВидыРасчетовРезервовПоОплатеТруда.Чтение.Организации
	|Справочник.ВидыРасчетовРезервовПоОплатеТруда.Изменение.Организации
	|Справочник.ВнешниеПользователи.Чтение.ВнешниеПользователи
	|Справочник.ВозвратНДФЛПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ВозвратНДФЛПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВозвратНДФЛПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ВозвратНДФЛПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВозмещениеБольничныхВЧастиФБПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ВозмещениеБольничныхВЧастиФБПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВозмещениеБольничныхВЧастиФБПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ВозмещениеБольничныхВЧастиФБПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВходящийЗапросФССДляРасчетаПособияПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ВходящийЗапросФССДляРасчетаПособияПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВходящийЗапросФССДляРасчетаПособияПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ВходящийЗапросФССДляРасчетаПособияПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРРПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРРПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРРПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРРПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ДепонированиеЗарплатыПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ДепонированиеЗарплатыПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ДепонированиеЗарплатыПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ДепонированиеЗарплатыПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ДоверенностиНалогоплательщика.Чтение.Организации
	|Справочник.ДоверенностиНалогоплательщика.Изменение.Организации
	|Справочник.ДоговорРаботыУслугиПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ДоговорРаботыУслугиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ДоговорРаботыУслугиПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ДоговорРаботыУслугиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ДоговорыКонтрагентов.Чтение.Организации
	|Справочник.ДоговорыКонтрагентов.Изменение.Организации
	|Справочник.ДоговорыХраненияПартийЗЕРНО.Чтение.Организации
	|Справочник.ДоговорыХраненияПартийЗЕРНО.Изменение.Организации
	|Справочник.ДокументКадровогоЭДОПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ДокументКадровогоЭДОПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ДокументКадровогоЭДОПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ДокументКадровогоЭДОПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ДокументооборотыОбменаСБанками.Чтение.Организации
	|Справочник.ДокументооборотыОбменаСБанками.Изменение.Организации
	|Справочник.ДокументыРеализацииПолномочийНалоговыхОрганов.Чтение.Организации
	|Справочник.ДокументыРеализацииПолномочийНалоговыхОрганов.Изменение.Организации
	|Справочник.ДополнительныеОтчетыИОбработки.Чтение.ДополнительныеОтчетыИОбработки
	|Справочник.ЗапросСреднегоЗаработкаСЭДОПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗапросСреднегоЗаработкаСЭДОПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗапросСреднегоЗаработкаСЭДОПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗапросСреднегоЗаработкаСЭДОПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗарплатныеПроекты.Чтение.Организации
	|Справочник.ЗарплатныеПроекты.Изменение.Организации
	|Справочник.ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудниковПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудниковПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудниковПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудниковПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудниковПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудниковПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудниковПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудниковПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаявлениеВФССОВозмещенииРасходовНаПогребениеПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗаявлениеВФССОВозмещенииРасходовНаПогребениеПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявлениеВФССОВозмещенииРасходовНаПогребениеПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗаявлениеВФССОВозмещенииРасходовНаПогребениеПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаявлениеОНазначенииПенсии.Чтение.Организации
	|Справочник.ЗаявлениеОНазначенииПенсии.Изменение.Организации
	|Справочник.ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаявлениеСотрудникаНаВыплатуПособияПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗаявлениеСотрудникаНаВыплатуПособияПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявлениеСотрудникаНаВыплатуПособияПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗаявлениеСотрудникаНаВыплатуПособияПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаявленияОбОтзывеМЧДФНС.Чтение.Организации
	|Справочник.ЗаявленияОбОтзывеМЧДФНС.Изменение.Организации
	|Справочник.ЗаявленияОПредоставленииСведенийОТрудовойДеятельностиПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗаявленияОПредоставленииСведенийОТрудовойДеятельностиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявленияОПредоставленииСведенийОТрудовойДеятельностиПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗаявленияОПредоставленииСведенийОТрудовойДеятельностиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗначенияСвойствОбъектов.Чтение.ДополнительныеСведения
	|Справочник.ЗначенияСвойствОбъектовИерархия.Чтение.ДополнительныеСведения
	|Справочник.ИзвещениеФССПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ИзвещениеФССПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИзвещениеФССПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ИзвещениеФССПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ИсполнительныйЛистПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ИсполнительныйЛистПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИсполнительныйЛистПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ИсполнительныйЛистПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ИсходящаяСправкаОЗаработкеДляРасчетаПособийПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ИсходящаяСправкаОЗаработкеДляРасчетаПособийПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИсходящаяСправкаОЗаработкеДляРасчетаПособийПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ИсходящаяСправкаОЗаработкеДляРасчетаПособийПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ИсходящееСообщениеОСтраховомСлучаеФССПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ИсходящееСообщениеОСтраховомСлучаеФССПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИсходящееСообщениеОСтраховомСлучаеФССПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ИсходящееСообщениеОСтраховомСлучаеФССПрисоединенныеФайлы.Изменение.Организации
	|Справочник.КадровыйПереводПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.КадровыйПереводПрисоединенныеФайлы.Чтение.Организации
	|Справочник.КадровыйПереводПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.КадровыйПереводПрисоединенныеФайлы.Изменение.Организации
	|Справочник.КомплектыОтчетностиПерсУчета.Чтение.Организации
	|Справочник.КомплектыОтчетностиПерсУчета.Изменение.Организации
	|Справочник.ЛистокСообщенияДляВоенкоматаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЛистокСообщенияДляВоенкоматаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЛистокСообщенияДляВоенкоматаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЛистокСообщенияДляВоенкоматаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.МакетыПенсионныхДел.Чтение.Организации
	|Справочник.МакетыПенсионныхДел.Изменение.Организации
	|Справочник.МаршрутыПодписания.Чтение.Организации
	|Справочник.МаршрутыПодписания.Изменение.Организации
	|Справочник.МашиночитаемыеДоверенностиОрганизаций.Чтение.Организации
	|Справочник.МашиночитаемыеДоверенностиОрганизаций.Изменение.Организации
	|Справочник.МашиночитаемыеДоверенностиФНС.Чтение.Организации
	|Справочник.МашиночитаемыеДоверенностиФНС.Изменение.Организации
	|Справочник.МашиночитаемыеДоверенностиФСС.Чтение.Организации
	|Справочник.МашиночитаемыеДоверенностиФСС.Изменение.Организации
	|Справочник.МашиночитаемыеДоверенностиЦБ.Чтение.Организации
	|Справочник.МашиночитаемыеДоверенностиЦБ.Изменение.Организации
	|Справочник.НастройкиИнтеграцииМаркетплейс.Чтение.Организации
	|Справочник.НастройкиИнтеграцииМаркетплейс.Изменение.Организации
	|Справочник.НастройкиОбменСБанками.Чтение.Организации
	|Справочник.НастройкиОбменСБанками.Изменение.Организации
	|Справочник.НастройкиОнлайнОплат.Чтение.Организации
	|Справочник.НастройкиОнлайнОплат.Изменение.Организации
	|Справочник.НастройкиРасчетаРезервовПоОплатеТруда.Чтение.Организации
	|Справочник.НастройкиРасчетаРезервовПоОплатеТруда.Изменение.Организации
	|Справочник.НачислениеЗарплатыПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.НачислениеЗарплатыПрисоединенныеФайлы.Чтение.Организации
	|Справочник.НачислениеЗарплатыПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.НачислениеЗарплатыПрисоединенныеФайлы.Изменение.Организации
	|Справочник.НачислениеОценочныхОбязательствПоОтпускамПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.НачислениеОценочныхОбязательствПоОтпускамПрисоединенныеФайлы.Чтение.Организации
	|Справочник.НачислениеОценочныхОбязательствПоОтпускамПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.НачислениеОценочныхОбязательствПоОтпускамПрисоединенныеФайлы.Изменение.Организации
	|Справочник.НесоответствиеСведенийОЗастрахованномЛицеСЭДОПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.НесоответствиеСведенийОЗастрахованномЛицеСЭДОПрисоединенныеФайлы.Чтение.Организации
	|Справочник.НесоответствиеСведенийОЗастрахованномЛицеСЭДОПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.НесоответствиеСведенийОЗастрахованномЛицеСЭДОПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОбразованиеФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|Справочник.ОбразованиеФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|Справочник.ОперацияНалоговогоУчетаПоНДФЛПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ОперацияНалоговогоУчетаПоНДФЛПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОперацияНалоговогоУчетаПоНДФЛПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ОперацияНалоговогоУчетаПоНДФЛПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОперацияУчетаПоСтраховымВзносамПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ОперацияУчетаПоСтраховымВзносамПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОперацияУчетаПоСтраховымВзносамПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ОперацияУчетаПоСтраховымВзносамПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОписиВходящихДокументовИзНалоговыхОрганов.Чтение.Организации
	|Справочник.ОписиВходящихДокументовИзНалоговыхОрганов.Изменение.Организации
	|Справочник.ОписиИсходящихДокументовВНалоговыеОрганы.Чтение.Организации
	|Справочник.ОписиИсходящихДокументовВНалоговыеОрганы.Изменение.Организации
	|Справочник.ОписьЗаявленийСотрудниковНаВыплатуПособийПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ОписьЗаявленийСотрудниковНаВыплатуПособийПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОписьЗаявленийСотрудниковНаВыплатуПособийПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ОписьЗаявленийСотрудниковНаВыплатуПособийПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОписьПачекСЗВ_6ПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОписьПачекСЗВ_6ПрисоединенныеФайлы.Изменение.Организации
	|Справочник.Организации.Чтение.Организации
	|Справочник.Организации.Изменение.Организации
	|Справочник.ОрганизацииПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОснованияПраваПодписи.Чтение.Организации
	|Справочник.ОснованияПраваПодписи.Изменение.Организации
	|Справочник.ОтветНаЗапросФССДляРасчетаПособияПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ОтветНаЗапросФССДляРасчетаПособияПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтветНаЗапросФССДляРасчетаПособияПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ОтветНаЗапросФССДляРасчетаПособияПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтзывЗаявленийОПредоставленииСведенийОТрудовойДеятельностиПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ОтзывЗаявленийОПредоставленииСведенийОТрудовойДеятельностиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтзывЗаявленийОПредоставленииСведенийОТрудовойДеятельностиПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ОтзывЗаявленийОПредоставленииСведенийОТрудовойДеятельностиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтменаБронированияГражданПребывающихВЗапасеПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ОтменаБронированияГражданПребывающихВЗапасеПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтменаБронированияГражданПребывающихВЗапасеПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ОтменаБронированияГражданПребывающихВЗапасеПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтправкиМинобороны.Чтение.Организации
	|Справочник.ОтправкиМинобороны.Изменение.Организации
	|Справочник.ОтправкиРегистрацияЮЛ.Чтение.Организации
	|Справочник.ОтправкиРегистрацияЮЛ.Изменение.Организации
	|Справочник.ОтправкиРПН.Чтение.Организации
	|Справочник.ОтправкиРПН.Изменение.Организации
	|Справочник.ОтправкиРЭЦ.Чтение.Организации
	|Справочник.ОтправкиРЭЦ.Изменение.Организации
	|Справочник.ОтправкиФСРАР.Чтение.Организации
	|Справочник.ОтправкиФСРАР.Изменение.Организации
	|Справочник.ОтправкиФСС.Чтение.Организации
	|Справочник.ОтправкиФСС.Изменение.Организации
	|Справочник.ОтправкиФТС.Чтение.Организации
	|Справочник.ОтправкиФТС.Изменение.Организации
	|Справочник.ОтпускБезСохраненияОплатыПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ОтпускБезСохраненияОплатыПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтпускБезСохраненияОплатыПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ОтпускБезСохраненияОплатыПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтпускПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ОтпускПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтпускПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ОтпускПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтражениеЗарплатыВБухучетеПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ОтражениеЗарплатыВБухучетеПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтражениеЗарплатыВБухучетеПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ОтражениеЗарплатыВБухучетеПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОфлайнОборудование.Чтение.Организации
	|Справочник.ОфлайнОборудование.Изменение.Организации
	|Справочник.ПапкиФайлов.Чтение.НастройкиПрав.Справочник.ПапкиФайлов
	|Справочник.ПапкиФайлов.Изменение.НастройкиПрав.Справочник.ПапкиФайлов
	|Справочник.Патенты.Чтение.Организации
	|Справочник.Патенты.Изменение.Организации
	|Справочник.ПерепискаСКонтролирующимиОрганами.Чтение.Организации
	|Справочник.ПерепискаСКонтролирующимиОрганами.Изменение.Организации
	|Справочник.ПерерасчетНДФЛПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПерерасчетНДФЛПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПерерасчетНДФЛПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПерерасчетНДФЛПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПерерасчетСтраховыхВзносовПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПерерасчетСтраховыхВзносовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПерерасчетСтраховыхВзносовПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПерерасчетСтраховыхВзносовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПодключаемоеОборудование.Чтение.Организации
	|Справочник.ПодключаемоеОборудование.Изменение.Организации
	|Справочник.ПодразделенияОрганизаций.Чтение.Организации
	|Справочник.ПодразделенияОрганизаций.Изменение.Организации
	|Справочник.ПодтверждениеЗачисленияЗарплатыПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПодтверждениеЗачисленияЗарплатыПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПодтверждениеЗачисленияЗарплатыПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПодтверждениеЗачисленияЗарплатыПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПодтверждениеОткрытияЛицевыхСчетовСотрудниковПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПодтверждениеОткрытияЛицевыхСчетовСотрудниковПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПодтверждениеОткрытияЛицевыхСчетовСотрудниковПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПодтверждениеОткрытияЛицевыхСчетовСотрудниковПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПравилаРегулярныхПлатежей.Чтение.Организации
	|Справочник.ПрекращениеСтандартныхВычетовНДФЛПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПрекращениеСтандартныхВычетовНДФЛПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПрекращениеСтандартныхВычетовНДФЛПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПрекращениеСтандартныхВычетовНДФЛПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПриемНаРаботуПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПриемНаРаботуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПриемНаРаботуПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПриемНаРаботуПрисоединенныеФайлы.Изменение.Организации
	|Справочник.РегистрацииВНалоговомОргане.Чтение.Организации
	|Справочник.РегистрацииВНалоговомОргане.Изменение.Организации
	|Справочник.РегистрацииВОрганеСтатистики.Чтение.Организации
	|Справочник.РегистрацииВОрганеСтатистики.Изменение.Организации
	|Справочник.РегистрацияТрудовойДеятельностиПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.РегистрацияТрудовойДеятельностиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.РегистрацияТрудовойДеятельностиПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.РегистрацияТрудовойДеятельностиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.РеестрДанныхЭЛНЗаполняемыхРаботодателемПрисоединенныеФайлы.Чтение.Организации
	|Справочник.РеестрДанныхЭЛНЗаполняемыхРаботодателемПрисоединенныеФайлы.Изменение.Организации
	|Справочник.РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособийПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособийПрисоединенныеФайлы.Чтение.Организации
	|Справочник.РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособийПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособийПрисоединенныеФайлы.Изменение.Организации
	|Справочник.РезервыПоОплатеТрудаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.РезервыПоОплатеТрудаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.РезервыПоОплатеТрудаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.РезервыПоОплатеТрудаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.РодственникиФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|Справочник.РодственникиФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|Справочник.СамостоятельныеКлассификационныеЕдиницы.Чтение.Организации
	|Справочник.СамостоятельныеКлассификационныеЕдиницы.Изменение.Организации
	|Справочник.СведенияДляИсчисленияДоплатыКПенсииСЗВ_ДСОПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СведенияДляИсчисленияДоплатыКПенсииСЗВ_ДСОПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СведенияДляИсчисленияДоплатыКПенсииСЗВ_ДСОПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СведенияДляИсчисленияДоплатыКПенсииСЗВ_ДСОПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СведенияОДоходахСотрудникаДляСоцВыплатПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СведенияОДоходахСотрудникаДляСоцВыплатПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СведенияОДоходахСотрудникаДляСоцВыплатПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СведенияОДоходахСотрудникаДляСоцВыплатПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СведенияОЗастрахованномЛицеФССПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СведенияОЗастрахованномЛицеФССПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СведенияОЗастрахованномЛицеФССПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СведенияОЗастрахованномЛицеФССПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СведенияОЗастрахованныхЛицахСЗВ_МПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СведенияОЗастрахованныхЛицахСЗВ_МПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СведенияОЗастрахованныхЛицахСЗВ_МПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СведенияОЗастрахованныхЛицахСЗВ_МПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СведенияОПриемеПереводеИУвольненииДляВоенкоматаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СведенияОПриемеПереводеИУвольненииДляВоенкоматаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СведенияОПриемеПереводеИУвольненииДляВоенкоматаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СведенияОПриемеПереводеИУвольненииДляВоенкоматаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СведенияОТрудовойДеятельностиРаботникаСТД_РПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СведенияОТрудовойДеятельностиРаботникаСТД_РПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СведенияОТрудовойДеятельностиРаботникаСТД_РПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СведенияОТрудовойДеятельностиРаботникаСТД_РПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СверкаСВоеннымКомиссариатомПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СверкаСВоеннымКомиссариатомПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СверкаСВоеннымКомиссариатомПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СверкаСВоеннымКомиссариатомПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СверкаСДокументамиВоинскогоУчетаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СверкаСДокументамиВоинскогоУчетаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СверкаСДокументамиВоинскогоУчетаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СверкаСДокументамиВоинскогоУчетаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СканированныеДокументыДляПередачиВЭлектронномВиде.Чтение.Организации
	|Справочник.СканированныеДокументыДляПередачиВЭлектронномВиде.Изменение.Организации
	|Справочник.СогласиеНаПрисоединениеККЭДОПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СогласиеНаПрисоединениеККЭДОПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СогласиеНаПрисоединениеККЭДОПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СогласиеНаПрисоединениеККЭДОПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СообщениеЭДОПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СообщениеЭДОПрисоединенныеФайлы.Изменение.Организации
	|Справочник.Сотрудники.Чтение.ГруппыФизическихЛиц
	|Справочник.Сотрудники.Чтение.Организации
	|Справочник.Сотрудники.Изменение.ГруппыФизическихЛиц
	|Справочник.Сотрудники.Изменение.Организации
	|Справочник.СписаниеДепонированнойЗарплатыПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СписаниеДепонированнойЗарплатыПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СписаниеДепонированнойЗарплатыПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СписаниеДепонированнойЗарплатыПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СправкаНДФЛПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СправкаНДФЛПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СправкаНДФЛПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СправкаНДФЛПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СправкиНДФЛДляПередачиВНалоговыйОрганПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СправкиНДФЛДляПередачиВНалоговыйОрганПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СправкиНДФЛДляПередачиВНалоговыйОрганПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СправкиНДФЛДляПередачиВНалоговыйОрганПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыльПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыльПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыльПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыльПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СреднийЗаработокСЭДОПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СреднийЗаработокСЭДОПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СреднийЗаработокСЭДОПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СреднийЗаработокСЭДОПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ТорговыеТочки.Чтение.Организации
	|Справочник.ТорговыеТочки.Изменение.Организации
	|Справочник.ТранзакцииОбменаСБанками.Чтение.Организации
	|Справочник.ТранзакцииОбменаСБанками.Изменение.Организации
	|Справочник.ТранспортныйКонтейнерЭДОПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ТранспортныйКонтейнерЭДОПрисоединенныеФайлы.Изменение.Организации
	|Справочник.УведомлениеОПравеНаИмущественныйВычетДляНДФЛПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.УведомлениеОПравеНаИмущественныйВычетДляНДФЛПрисоединенныеФайлы.Чтение.Организации
	|Справочник.УведомлениеОПравеНаИмущественныйВычетДляНДФЛПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.УведомлениеОПравеНаИмущественныйВычетДляНДФЛПрисоединенныеФайлы.Изменение.Организации
	|Справочник.УведомлениеОПрекращенииОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.УведомлениеОПрекращенииОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы.Чтение.Организации
	|Справочник.УведомлениеОПрекращенииОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.УведомлениеОПрекращенииОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы.Изменение.Организации
	|Справочник.УведомленияАУСН.Чтение.Организации
	|Справочник.УведомленияАУСН.Изменение.Организации
	|Справочник.УвольнениеПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.УвольнениеПрисоединенныеФайлы.Чтение.Организации
	|Справочник.УвольнениеПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.УвольнениеПрисоединенныеФайлы.Изменение.Организации
	|Справочник.УчетныеЗаписиЭлектроннойПочты.Чтение.Пользователи
	|Справочник.УчетныеЗаписиЭлектроннойПочты.Чтение.УчетныеЗаписиЭлектроннойПочты
	|Справочник.УчетныеЗаписиЭлектроннойПочты.Изменение.Пользователи
	|Справочник.Файлы.Чтение.ВнешниеПользователи
	|Справочник.Файлы.Чтение.НастройкиПрав.Справочник.ПапкиФайлов
	|Справочник.Файлы.Чтение.Объект.БизнесПроцесс.Задание
	|Справочник.Файлы.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаИзменитьЛичныеДанные
	|Справочник.Файлы.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаНалоговыйВычет
	|Справочник.Файлы.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаОтпуск
	|Справочник.Файлы.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаОтсутствиеПоБолезни
	|Справочник.Файлы.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаСправка2НДФЛ
	|Справочник.Файлы.Чтение.Объект.БизнесПроцесс.ОбращениеСотрудника
	|Справочник.Файлы.Чтение.Объект.БизнесПроцесс.УдалитьЗаявкаКабинетСотрудника
	|Справочник.Файлы.Чтение.Объект.Документ.УдалитьЗаявлениеАбонентаСпецоператораСвязи
	|Справочник.Файлы.Чтение.Объект.Задача.ЗадачаИсполнителя
	|Справочник.Файлы.Чтение.Объект.Справочник.Организации
	|Справочник.Файлы.Чтение.Объект.Справочник.ПапкиФайлов
	|Справочник.Файлы.Чтение.Объект.Справочник.ФизическиеЛица
	|Справочник.Файлы.Изменение.ВнешниеПользователи
	|Справочник.Файлы.Изменение.НастройкиПрав.Справочник.ПапкиФайлов
	|Справочник.Файлы.Изменение.Объект.БизнесПроцесс.Задание
	|Справочник.Файлы.Изменение.Объект.БизнесПроцесс.ЗаявкаСотрудникаИзменитьЛичныеДанные
	|Справочник.Файлы.Изменение.Объект.БизнесПроцесс.ЗаявкаСотрудникаНалоговыйВычет
	|Справочник.Файлы.Изменение.Объект.БизнесПроцесс.ЗаявкаСотрудникаОтпуск
	|Справочник.Файлы.Изменение.Объект.БизнесПроцесс.ЗаявкаСотрудникаОтсутствиеПоБолезни
	|Справочник.Файлы.Изменение.Объект.БизнесПроцесс.ЗаявкаСотрудникаСправка2НДФЛ
	|Справочник.Файлы.Изменение.Объект.БизнесПроцесс.ОбращениеСотрудника
	|Справочник.Файлы.Изменение.Объект.БизнесПроцесс.УдалитьЗаявкаКабинетСотрудника
	|Справочник.Файлы.Изменение.Объект.Документ.УдалитьЗаявлениеАбонентаСпецоператораСвязи
	|Справочник.Файлы.Изменение.Объект.Задача.ЗадачаИсполнителя
	|Справочник.Файлы.Изменение.Объект.Справочник.Организации
	|Справочник.Файлы.Изменение.Объект.Справочник.ПапкиФайлов
	|Справочник.Файлы.Изменение.Объект.Справочник.ФизическиеЛица
	|Справочник.ФизическиеЛица.Чтение.ГруппыФизическихЛиц
	|Справочник.ФизическиеЛица.Изменение.ГруппыФизическихЛиц
	|Справочник.ФизическиеЛицаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ФизическиеЛицаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ХодатайствоОБронированииГражданПребывающихВЗапасеПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ХодатайствоОБронированииГражданПребывающихВЗапасеПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ХодатайствоОБронированииГражданПребывающихВЗапасеПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ХодатайствоОБронированииГражданПребывающихВЗапасеПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЭлектронныеПредставленияРегламентированныхОтчетов.Чтение.Организации
	|Справочник.ЭлектронныеПредставленияРегламентированныхОтчетов.Изменение.Организации
	|Документ.АвансовыйОтчет.Чтение.Организации
	|Документ.АвансовыйОтчет.Изменение.Организации
	|Документ.АвансовыйПлатежИностранцаПоНДФЛ.Чтение.ГруппыФизическихЛиц
	|Документ.АвансовыйПлатежИностранцаПоНДФЛ.Чтение.Организации
	|Документ.АвансовыйПлатежИностранцаПоНДФЛ.Изменение.ГруппыФизическихЛиц
	|Документ.АвансовыйПлатежИностранцаПоНДФЛ.Изменение.Организации
	|Документ.АвизоМПЗВходящее.Чтение.Организации
	|Документ.АвизоМПЗВходящее.Изменение.Организации
	|Документ.АвизоМПЗИсходящее.Чтение.Организации
	|Документ.АвизоМПЗИсходящее.Изменение.Организации
	|Документ.АвизоОСВходящее.Чтение.Организации
	|Документ.АвизоОСВходящее.Изменение.Организации
	|Документ.АвизоОСИсходящее.Чтение.Организации
	|Документ.АвизоОСИсходящее.Изменение.Организации
	|Документ.АвизоПрочееВходящее.Чтение.Организации
	|Документ.АвизоПрочееВходящее.Изменение.Организации
	|Документ.АвизоПрочееИсходящее.Чтение.Организации
	|Документ.АвизоПрочееИсходящее.Изменение.Организации
	|Документ.АвизоРасчетыВходящее.Чтение.Организации
	|Документ.АвизоРасчетыВходящее.Изменение.Организации
	|Документ.АвизоРасчетыИсходящее.Чтение.Организации
	|Документ.АвизоРасчетыИсходящее.Изменение.Организации
	|Документ.АктОбОказанииПроизводственныхУслуг.Чтение.Организации
	|Документ.АктОбОказанииПроизводственныхУслуг.Изменение.Организации
	|Документ.АктОбУничтоженииПерсональныхДанных.Чтение.ГруппыФизическихЛиц
	|Документ.АктОбУничтоженииПерсональныхДанных.Чтение.Организации
	|Документ.АктОбУничтоженииПерсональныхДанных.Изменение.ГруппыФизическихЛиц
	|Документ.АктОбУничтоженииПерсональныхДанных.Изменение.Организации
	|Документ.АктОРасхождениях.Чтение.Организации
	|Документ.АктОРасхождениях.Изменение.Организации
	|Документ.АктОРасхожденияхПолученный.Чтение.Организации
	|Документ.АктОРасхожденияхПолученный.Изменение.Организации
	|Документ.АктПроверкиСтраховыхВзносов.Чтение.ГруппыФизическихЛиц
	|Документ.АктПроверкиСтраховыхВзносов.Чтение.Организации
	|Документ.АктПроверкиСтраховыхВзносов.Изменение.ГруппыФизическихЛиц
	|Документ.АктПроверкиСтраховыхВзносов.Изменение.Организации
	|Документ.АктСверкиВзаиморасчетов.Чтение.Организации
	|Документ.АктСверкиВзаиморасчетов.Изменение.Организации
	|Документ.БольничныйЛист.Чтение.ГруппыФизическихЛиц
	|Документ.БольничныйЛист.Чтение.Организации
	|Документ.БольничныйЛист.Изменение.ГруппыФизическихЛиц
	|Документ.БольничныйЛист.Изменение.Организации
	|Документ.БронированиеГражданПребывающихВЗапасе.Чтение.ГруппыФизическихЛиц
	|Документ.БронированиеГражданПребывающихВЗапасе.Чтение.Организации
	|Документ.БронированиеГражданПребывающихВЗапасе.Изменение.ГруппыФизическихЛиц
	|Документ.БронированиеГражданПребывающихВЗапасе.Изменение.Организации
	|Документ.ВводНачальныхОстатков.Чтение.Организации
	|Документ.ВводНачальныхОстатков.Изменение.Организации
	|Документ.ВедомостьНаВыплатуЗарплаты.Чтение.ГруппыФизическихЛиц
	|Документ.ВедомостьНаВыплатуЗарплаты.Чтение.Организации
	|Документ.ВедомостьНаВыплатуЗарплаты.Изменение.ГруппыФизическихЛиц
	|Документ.ВедомостьНаВыплатуЗарплаты.Изменение.Организации
	|Документ.ВедомостьНаВыплатуЗарплатыВБанк.Чтение.ГруппыФизическихЛиц
	|Документ.ВедомостьНаВыплатуЗарплатыВБанк.Чтение.Организации
	|Документ.ВедомостьНаВыплатуЗарплатыВБанк.Изменение.ГруппыФизическихЛиц
	|Документ.ВедомостьНаВыплатуЗарплатыВБанк.Изменение.Организации
	|Документ.ВедомостьНаВыплатуЗарплатыВКассу.Чтение.ГруппыФизическихЛиц
	|Документ.ВедомостьНаВыплатуЗарплатыВКассу.Чтение.Организации
	|Документ.ВедомостьНаВыплатуЗарплатыВКассу.Изменение.ГруппыФизическихЛиц
	|Документ.ВедомостьНаВыплатуЗарплатыВКассу.Изменение.Организации
	|Документ.ВедомостьУплатыАДВ_11.Чтение.Организации
	|Документ.ВедомостьУплатыАДВ_11.Изменение.Организации
	|Документ.ВнесениеСведенийОСобранномУрожаеЗЕРНО.Чтение.Организации
	|Документ.ВнесениеСведенийОСобранномУрожаеЗЕРНО.Изменение.Организации
	|Документ.ВозвратВОборотИСМП.Чтение.Организации
	|Документ.ВозвратМатериаловИзЭксплуатации.Чтение.Организации
	|Документ.ВозвратМатериаловИзЭксплуатации.Изменение.Организации
	|Документ.ВозвратНДФЛ.Чтение.ГруппыФизическихЛиц
	|Документ.ВозвратНДФЛ.Чтение.Организации
	|Документ.ВозвратНДФЛ.Изменение.ГруппыФизическихЛиц
	|Документ.ВозвратНДФЛ.Изменение.Организации
	|Документ.ВозвратОСОтАрендатора.Чтение.Организации
	|Документ.ВозвратОСОтАрендатора.Изменение.Организации
	|Документ.ВозвратТоваровОтПокупателя.Чтение.Организации
	|Документ.ВозвратТоваровОтПокупателя.Изменение.Организации
	|Документ.ВозвратТоваровПоставщику.Чтение.Организации
	|Документ.ВозвратТоваровПоставщику.Изменение.Организации
	|Документ.ВозмещениеБольничныхВЧастиФБ.Чтение.ГруппыФизическихЛиц
	|Документ.ВозмещениеБольничныхВЧастиФБ.Чтение.Организации
	|Документ.ВозмещениеБольничныхВЧастиФБ.Изменение.ГруппыФизическихЛиц
	|Документ.ВозмещениеБольничныхВЧастиФБ.Изменение.Организации
	|Документ.ВосстановлениеНДС.Чтение.Организации
	|Документ.ВосстановлениеНДС.Изменение.Организации
	|Документ.ВосстановлениеНДСПоОбъектамНедвижимости.Чтение.Организации
	|Документ.ВосстановлениеНДСПоОбъектамНедвижимости.Изменение.Организации
	|Документ.ВходящийДокументСЭДОФСС.Чтение.Организации
	|Документ.ВходящийДокументСЭДОФСС.Изменение.Организации
	|Документ.ВходящийЗапросФССДляРасчетаПособия.Чтение.ГруппыФизическихЛиц
	|Документ.ВходящийЗапросФССДляРасчетаПособия.Чтение.Организации
	|Документ.ВходящийЗапросФССДляРасчетаПособия.Изменение.ГруппыФизическихЛиц
	|Документ.ВходящийЗапросФССДляРасчетаПособия.Изменение.Организации
	|Документ.ВыводИзОборотаИСМП.Чтение.Организации
	|Документ.ВыводИзОборотаИСМП.Изменение.Организации
	|Документ.ВыгрузкаРегламентированныхОтчетов.Чтение.Организации
	|Документ.ВыгрузкаРегламентированныхОтчетов.Изменение.Организации
	|Документ.ВыдачаДенежныхДокументов.Чтение.Организации
	|Документ.ВыдачаДенежныхДокументов.Изменение.Организации
	|Документ.ВыкупПредметовЛизинга.Чтение.Организации
	|Документ.ВыкупПредметовЛизинга.Изменение.Организации
	|Документ.ВыплатыСамозанятым.Чтение.Организации
	|Документ.ВыплатыСамозанятым.Изменение.Организации
	|Документ.ВыработкаМатериалов.Чтение.Организации
	|Документ.ВыработкаМатериалов.Изменение.Организации
	|Документ.ВыработкаНМА.Чтение.Организации
	|Документ.ВыработкаНМА.Изменение.Организации
	|Документ.ВыработкаОС.Чтение.Организации
	|Документ.ВыработкаОС.Изменение.Организации
	|Документ.ГТДИмпорт.Чтение.Организации
	|Документ.ГТДИмпорт.Изменение.Организации
	|Документ.ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРР.Чтение.ГруппыФизическихЛиц
	|Документ.ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРР.Чтение.Организации
	|Документ.ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРР.Изменение.ГруппыФизическихЛиц
	|Документ.ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРР.Изменение.Организации
	|Документ.ДепонированиеЗарплаты.Чтение.ГруппыФизическихЛиц
	|Документ.ДепонированиеЗарплаты.Чтение.Организации
	|Документ.ДепонированиеЗарплаты.Изменение.ГруппыФизическихЛиц
	|Документ.ДепонированиеЗарплаты.Изменение.Организации
	|Документ.Доверенность.Чтение.Организации
	|Документ.Доверенность.Изменение.Организации
	|Документ.ДоговорРаботыУслуги.Чтение.ГруппыФизическихЛиц
	|Документ.ДоговорРаботыУслуги.Чтение.Организации
	|Документ.ДоговорРаботыУслуги.Изменение.ГруппыФизическихЛиц
	|Документ.ДоговорРаботыУслуги.Изменение.Организации
	|Документ.ДокументКадровогоЭДО.Чтение.ГруппыФизическихЛиц
	|Документ.ДокументКадровогоЭДО.Чтение.Организации
	|Документ.ДокументКадровогоЭДО.Изменение.ГруппыФизическихЛиц
	|Документ.ДокументКадровогоЭДО.Изменение.Организации
	|Документ.ДокументРасчетовСКонтрагентом.Чтение.Организации
	|Документ.ДокументРасчетовСКонтрагентом.Изменение.Организации
	|Документ.ДопЛистКнигиПокупокДляПередачиВЭлектронномВиде.Чтение.Организации
	|Документ.ДопЛистКнигиПокупокДляПередачиВЭлектронномВиде.Изменение.Организации
	|Документ.ДопЛистКнигиПродажДляПередачиВЭлектронномВиде.Чтение.Организации
	|Документ.ДопЛистКнигиПродажДляПередачиВЭлектронномВиде.Изменение.Организации
	|Документ.ЖурналУчетаСчетовФактурДляПередачиВЭлектронномВиде.Чтение.Организации
	|Документ.ЖурналУчетаСчетовФактурДляПередачиВЭлектронномВиде.Изменение.Организации
	|Документ.ЗавершениеРемонтаОС.Чтение.Организации
	|Документ.ЗавершениеРемонтаОС.Изменение.Организации
	|Документ.ЗаписьКнигиУчетаДоходовИРасходовИП.Чтение.Организации
	|Документ.ЗаписьКнигиУчетаДоходовИРасходовИП.Изменение.Организации
	|Документ.ЗаписьКУДиР.Чтение.Организации
	|Документ.ЗаписьКУДиР.Изменение.Организации
	|Документ.ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП.Чтение.Организации
	|Документ.ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП.Изменение.Организации
	|Документ.ЗапросНаИнформационноеОбслуживаниеНалогоплательщика.Чтение.Организации
	|Документ.ЗапросНаИнформационноеОбслуживаниеНалогоплательщика.Изменение.Организации
	|Документ.ЗапросНаИнформационноеОбслуживаниеСтрахователя.Чтение.Организации
	|Документ.ЗапросНаИнформационноеОбслуживаниеСтрахователя.Изменение.Организации
	|Документ.ЗапросОстатковПартийЗЕРНО.Чтение.Организации
	|Документ.ЗапросОстатковПартийЗЕРНО.Изменение.Организации
	|Документ.ЗапросСреднегоЗаработкаСЭДО.Чтение.ГруппыФизическихЛиц
	|Документ.ЗапросСреднегоЗаработкаСЭДО.Чтение.Организации
	|Документ.ЗапросСреднегоЗаработкаСЭДО.Изменение.ГруппыФизическихЛиц
	|Документ.ЗапросСреднегоЗаработкаСЭДО.Изменение.Организации
	|Документ.ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудников.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудников.Чтение.Организации
	|Документ.ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудников.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудников.Изменение.Организации
	|Документ.ЗаявкаНаКредит.Чтение.Организации
	|Документ.ЗаявкаНаКредит.Изменение.Организации
	|Документ.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников.Чтение.Организации
	|Документ.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников.Изменение.Организации
	|Документ.ЗаявкаНаОткрытиеСчета.Чтение.Организации
	|Документ.ЗаявкаНаОткрытиеСчета.Изменение.Организации
	|Документ.ЗаявкиНаЛьготныйКредит.Чтение.Организации
	|Документ.ЗаявкиНаЛьготныйКредит.Изменение.Организации
	|Документ.ЗаявлениеАбонентаСпецоператораСвязи.Чтение.Организации
	|Документ.ЗаявлениеАбонентаСпецоператораСвязи.Изменение.Организации
	|Документ.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов.Чтение.Организации
	|Документ.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов.Изменение.Организации
	|Документ.ЗаявлениеВФССОВозмещенииРасходовНаПогребение.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеВФССОВозмещенииРасходовНаПогребение.Чтение.Организации
	|Документ.ЗаявлениеВФССОВозмещенииРасходовНаПогребение.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеВФССОВозмещенииРасходовНаПогребение.Изменение.Организации
	|Документ.ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛ.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛ.Чтение.Организации
	|Документ.ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛ.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛ.Изменение.Организации
	|Документ.ЗаявлениеНаФормированиеСправкиОРасчетах.Чтение.Организации
	|Документ.ЗаявлениеНаФормированиеСправкиОРасчетах.Изменение.Организации
	|Документ.ЗаявлениеОВвозеТоваров.Чтение.Организации
	|Документ.ЗаявлениеОВвозеТоваров.Изменение.Организации
	|Документ.ЗаявлениеОЗачетеВСчетПредстоящейОбязанности.Чтение.Организации
	|Документ.ЗаявлениеОЗачетеВСчетПредстоящейОбязанности.Изменение.Организации
	|Документ.ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛ.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛ.Чтение.Организации
	|Документ.ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛ.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛ.Изменение.Организации
	|Документ.ЗаявлениеСотрудникаНаВыплатуПособия.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеСотрудникаНаВыплатуПособия.Чтение.Организации
	|Документ.ЗаявлениеСотрудникаНаВыплатуПособия.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеСотрудникаНаВыплатуПособия.Изменение.Организации
	|Документ.ЗаявленияОПредоставленииСведенийОТрудовойДеятельности.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявленияОПредоставленииСведенийОТрудовойДеятельности.Чтение.Организации
	|Документ.ЗаявленияОПредоставленииСведенийОТрудовойДеятельности.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявленияОПредоставленииСведенийОТрудовойДеятельности.Изменение.Организации
	|Документ.ЗаявленияПоЭлДокументооборотуСПФР.Чтение.Организации
	|Документ.ЗаявленияПоЭлДокументооборотуСПФР.Изменение.Организации
	|Документ.ИзвещениеФСС.Чтение.ГруппыФизическихЛиц
	|Документ.ИзвещениеФСС.Чтение.Организации
	|Документ.ИзвещениеФСС.Изменение.ГруппыФизическихЛиц
	|Документ.ИзвещениеФСС.Изменение.Организации
	|Документ.ИзменениеГрафиковАмортизацииОС.Чтение.Организации
	|Документ.ИзменениеГрафиковАмортизацииОС.Изменение.Организации
	|Документ.ИзменениеОтраженияРасходовПоАренднымПлатежамОС.Чтение.Организации
	|Документ.ИзменениеОтраженияРасходовПоАренднымПлатежамОС.Изменение.Организации
	|Документ.ИзменениеПараметровНачисленияАмортизацииОС.Чтение.Организации
	|Документ.ИзменениеПараметровНачисленияАмортизацииОС.Изменение.Организации
	|Документ.ИзменениеСостоянияОС.Чтение.Организации
	|Документ.ИзменениеСостоянияОС.Изменение.Организации
	|Документ.ИзменениеСпециальногоКоэффициентаНМА.Чтение.Организации
	|Документ.ИзменениеСпециальногоКоэффициентаНМА.Изменение.Организации
	|Документ.ИзменениеСпециальногоКоэффициентаОС.Чтение.Организации
	|Документ.ИзменениеСпециальногоКоэффициентаОС.Изменение.Организации
	|Документ.ИзменениеСпособовОтраженияРасходовПоАмортизацииНМА.Чтение.Организации
	|Документ.ИзменениеСпособовОтраженияРасходовПоАмортизацииНМА.Изменение.Организации
	|Документ.ИзменениеСпособовОтраженияРасходовПоАмортизацииОС.Чтение.Организации
	|Документ.ИзменениеСпособовОтраженияРасходовПоАмортизацииОС.Изменение.Организации
	|Документ.ИзменениеУсловийАренды.Чтение.Организации
	|Документ.ИзменениеУсловийАренды.Изменение.Организации
	|Документ.ИнвентаризацияКассы.Чтение.Организации
	|Документ.ИнвентаризацияКассы.Изменение.Организации
	|Документ.ИнвентаризацияНЗП.Чтение.Организации
	|Документ.ИнвентаризацияНЗП.Изменение.Организации
	|Документ.ИнвентаризацияОС.Чтение.Организации
	|Документ.ИнвентаризацияОС.Изменение.Организации
	|Документ.ИнвентаризацияРасчетовСКонтрагентами.Чтение.Организации
	|Документ.ИнвентаризацияРасчетовСКонтрагентами.Изменение.Организации
	|Документ.ИнвентаризацияТоваровНаСкладе.Чтение.Организации
	|Документ.ИнвентаризацияТоваровНаСкладе.Изменение.Организации
	|Документ.ИсполнительныйЛист.Чтение.ГруппыФизическихЛиц
	|Документ.ИсполнительныйЛист.Чтение.Организации
	|Документ.ИсполнительныйЛист.Изменение.ГруппыФизическихЛиц
	|Документ.ИсполнительныйЛист.Изменение.Организации
	|Документ.ИсходящаяСправкаОЗаработкеДляРасчетаПособий.Чтение.ГруппыФизическихЛиц
	|Документ.ИсходящаяСправкаОЗаработкеДляРасчетаПособий.Чтение.Организации
	|Документ.ИсходящаяСправкаОЗаработкеДляРасчетаПособий.Изменение.ГруппыФизическихЛиц
	|Документ.ИсходящаяСправкаОЗаработкеДляРасчетаПособий.Изменение.Организации
	|Документ.ИсходящееСообщениеОСтраховомСлучаеФСС.Чтение.ГруппыФизическихЛиц
	|Документ.ИсходящееСообщениеОСтраховомСлучаеФСС.Чтение.Организации
	|Документ.ИсходящееСообщениеОСтраховомСлучаеФСС.Изменение.ГруппыФизическихЛиц
	|Документ.ИсходящееСообщениеОСтраховомСлучаеФСС.Изменение.Организации
	|Документ.КадровыйПеревод.Чтение.ГруппыФизическихЛиц
	|Документ.КадровыйПеревод.Чтение.Организации
	|Документ.КадровыйПеревод.Изменение.ГруппыФизическихЛиц
	|Документ.КадровыйПеревод.Изменение.Организации
	|Документ.КассоваяСмена.Чтение.Организации
	|Документ.КассоваяСмена.Изменение.Организации
	|Документ.КнигаПокупокДляПередачиВЭлектронномВиде.Чтение.Организации
	|Документ.КнигаПокупокДляПередачиВЭлектронномВиде.Изменение.Организации
	|Документ.КнигаПродажДляПередачиВЭлектронномВиде.Чтение.Организации
	|Документ.КнигаПродажДляПередачиВЭлектронномВиде.Изменение.Организации
	|Документ.КоммерческоеПредложение.Чтение.Организации
	|Документ.КоммерческоеПредложение.Изменение.Организации
	|Документ.КомплектацияНоменклатуры.Чтение.Организации
	|Документ.КомплектацияНоменклатуры.Изменение.Организации
	|Документ.КонтролируемаяСделка.Чтение.Организации
	|Документ.КонтролируемаяСделка.Изменение.Организации
	|Документ.КорректировкаДолга.Чтение.Организации
	|Документ.КорректировкаДолга.Изменение.Организации
	|Документ.КорректировкаЕНС.Чтение.Организации
	|Документ.КорректировкаЕНС.Изменение.Организации
	|Документ.КорректировкаПоступления.Чтение.Организации
	|Документ.КорректировкаПоступления.Изменение.Организации
	|Документ.КорректировкаРеализации.Чтение.Организации
	|Документ.КорректировкаРеализации.Изменение.Организации
	|Документ.ЛистокСообщенияДляВоенкомата.Чтение.ГруппыФизическихЛиц
	|Документ.ЛистокСообщенияДляВоенкомата.Чтение.Организации
	|Документ.ЛистокСообщенияДляВоенкомата.Изменение.ГруппыФизическихЛиц
	|Документ.ЛистокСообщенияДляВоенкомата.Изменение.Организации
	|Документ.МодернизацияОС.Чтение.Организации
	|Документ.МодернизацияОС.Изменение.Организации
	|Документ.НачислениеДивидендов.Чтение.Организации
	|Документ.НачислениеДивидендов.Изменение.Организации
	|Документ.НачислениеЗарплаты.Чтение.ГруппыФизическихЛиц
	|Документ.НачислениеЗарплаты.Чтение.Организации
	|Документ.НачислениеЗарплаты.Изменение.ГруппыФизическихЛиц
	|Документ.НачислениеЗарплаты.Изменение.Организации
	|Документ.НачислениеНДСпоСМРхозспособом.Чтение.Организации
	|Документ.НачислениеНДСпоСМРхозспособом.Изменение.Организации
	|Документ.НачислениеОценочныхОбязательствПоОтпускам.Чтение.ГруппыФизическихЛиц
	|Документ.НачислениеОценочныхОбязательствПоОтпускам.Чтение.Организации
	|Документ.НачислениеОценочныхОбязательствПоОтпускам.Изменение.ГруппыФизическихЛиц
	|Документ.НачислениеОценочныхОбязательствПоОтпускам.Изменение.Организации
	|Документ.НачислениеПеней.Чтение.Организации
	|Документ.НесоответствиеСведенийОЗастрахованномЛицеСЭДО.Чтение.ГруппыФизическихЛиц
	|Документ.НесоответствиеСведенийОЗастрахованномЛицеСЭДО.Чтение.Организации
	|Документ.НесоответствиеСведенийОЗастрахованномЛицеСЭДО.Изменение.ГруппыФизическихЛиц
	|Документ.НесоответствиеСведенийОЗастрахованномЛицеСЭДО.Изменение.Организации
	|Документ.ОбесценениеЗапасов.Чтение.Организации
	|Документ.ОбесценениеЗапасов.Изменение.Организации
	|Документ.ОбесценениеОС.Чтение.Организации
	|Документ.ОбесценениеОС.Изменение.Организации
	|Документ.ОказаниеУслуг.Чтение.Организации
	|Документ.ОказаниеУслуг.Изменение.Организации
	|Документ.ОперацияБух.Чтение.Организации
	|Документ.ОперацияБух.Изменение.Организации
	|Документ.ОперацияНалоговогоУчетаПоНДФЛ.Чтение.ГруппыФизическихЛиц
	|Документ.ОперацияНалоговогоУчетаПоНДФЛ.Чтение.Организации
	|Документ.ОперацияНалоговогоУчетаПоНДФЛ.Изменение.ГруппыФизическихЛиц
	|Документ.ОперацияНалоговогоУчетаПоНДФЛ.Изменение.Организации
	|Документ.ОперацияПоЕдиномуНалоговомуСчету.Чтение.Организации
	|Документ.ОперацияПоЕдиномуНалоговомуСчету.Изменение.Организации
	|Документ.ОперацияСБилетом.Чтение.Организации
	|Документ.ОперацияСБилетом.Изменение.Организации
	|Документ.ОперацияСПатентом.Чтение.Организации
	|Документ.ОперацияСПатентом.Изменение.Организации
	|Документ.ОперацияУчетаПоСтраховымВзносам.Чтение.ГруппыФизическихЛиц
	|Документ.ОперацияУчетаПоСтраховымВзносам.Чтение.Организации
	|Документ.ОперацияУчетаПоСтраховымВзносам.Изменение.ГруппыФизическихЛиц
	|Документ.ОперацияУчетаПоСтраховымВзносам.Изменение.Организации
	|Документ.ОписьЗаявленийСотрудниковНаВыплатуПособий.Чтение.ГруппыФизическихЛиц
	|Документ.ОписьЗаявленийСотрудниковНаВыплатуПособий.Чтение.Организации
	|Документ.ОписьЗаявленийСотрудниковНаВыплатуПособий.Изменение.ГруппыФизическихЛиц
	|Документ.ОписьЗаявленийСотрудниковНаВыплатуПособий.Изменение.Организации
	|Документ.ОписьОДВ_1.Чтение.Организации
	|Документ.ОписьОДВ_1.Изменение.Организации
	|Документ.ОписьПачекСЗВ_6.Чтение.Организации
	|Документ.ОписьПачекСЗВ_6.Изменение.Организации
	|Документ.ОплатаПлатежнойКартой.Чтение.Организации
	|Документ.ОплатаПлатежнойКартой.Изменение.Организации
	|Документ.ОприходованиеТоваров.Чтение.Организации
	|Документ.ОприходованиеТоваров.Изменение.Организации
	|Документ.ОтветНаЗапросФССДляРасчетаПособия.Чтение.ГруппыФизическихЛиц
	|Документ.ОтветНаЗапросФССДляРасчетаПособия.Чтение.Организации
	|Документ.ОтветНаЗапросФССДляРасчетаПособия.Изменение.ГруппыФизическихЛиц
	|Документ.ОтветНаЗапросФССДляРасчетаПособия.Изменение.Организации
	|Документ.ОтветСтрахователяНаТребованиеПроверкиФСС.Чтение.Организации
	|Документ.ОтветСтрахователяНаТребованиеПроверкиФСС.Изменение.Организации
	|Документ.ОтзывЗаявленийОПредоставленииСведенийОТрудовойДеятельности.Чтение.ГруппыФизическихЛиц
	|Документ.ОтзывЗаявленийОПредоставленииСведенийОТрудовойДеятельности.Чтение.Организации
	|Документ.ОтзывЗаявленийОПредоставленииСведенийОТрудовойДеятельности.Изменение.ГруппыФизическихЛиц
	|Документ.ОтзывЗаявленийОПредоставленииСведенийОТрудовойДеятельности.Изменение.Организации
	|Документ.ОтзывСогласияНаОбработкуПерсональныхДанных.Чтение.ГруппыФизическихЛиц
	|Документ.ОтзывСогласияНаОбработкуПерсональныхДанных.Чтение.Организации
	|Документ.ОтзывСогласияНаОбработкуПерсональныхДанных.Изменение.ГруппыФизическихЛиц
	|Документ.ОтзывСогласияНаОбработкуПерсональныхДанных.Изменение.Организации
	|Документ.ОтменаБронированияГражданПребывающихВЗапасе.Чтение.ГруппыФизическихЛиц
	|Документ.ОтменаБронированияГражданПребывающихВЗапасе.Чтение.Организации
	|Документ.ОтменаБронированияГражданПребывающихВЗапасе.Изменение.ГруппыФизическихЛиц
	|Документ.ОтменаБронированияГражданПребывающихВЗапасе.Изменение.Организации
	|Документ.Отпуск.Чтение.ГруппыФизическихЛиц
	|Документ.Отпуск.Чтение.Организации
	|Документ.Отпуск.Изменение.ГруппыФизическихЛиц
	|Документ.Отпуск.Изменение.Организации
	|Документ.ОтпускБезСохраненияОплаты.Чтение.ГруппыФизическихЛиц
	|Документ.ОтпускБезСохраненияОплаты.Чтение.Организации
	|Документ.ОтпускБезСохраненияОплаты.Изменение.ГруппыФизическихЛиц
	|Документ.ОтпускБезСохраненияОплаты.Изменение.Организации
	|Документ.ОтражениеЗарплатыВБухучете.Чтение.ГруппыФизическихЛиц
	|Документ.ОтражениеЗарплатыВБухучете.Чтение.Организации
	|Документ.ОтражениеЗарплатыВБухучете.Изменение.ГруппыФизическихЛиц
	|Документ.ОтражениеЗарплатыВБухучете.Изменение.Организации
	|Документ.ОтражениеЗарплатыВУчете.Чтение.Организации
	|Документ.ОтражениеЗарплатыВУчете.Изменение.Организации
	|Документ.ОтражениеНачисленияНДС.Чтение.Организации
	|Документ.ОтражениеНачисленияНДС.Изменение.Организации
	|Документ.ОтражениеНДСКВычету.Чтение.Организации
	|Документ.ОтражениеНДСКВычету.Изменение.Организации
	|Документ.ОтчетИСМП.Чтение.Организации
	|Документ.ОтчетИСМП.Изменение.Организации
	|Документ.ОтчетКомиссионераОПродажах.Чтение.Организации
	|Документ.ОтчетКомиссионераОПродажах.Изменение.Организации
	|Документ.ОтчетКомитентуОПродажах.Чтение.Организации
	|Документ.ОтчетКомитентуОПродажах.Изменение.Организации
	|Документ.ОтчетМаркетплейса.Чтение.Организации
	|Документ.ОтчетМаркетплейса.Изменение.Организации
	|Документ.ОтчетОператораСистемыПлатон.Чтение.Организации
	|Документ.ОтчетОператораСистемыПлатон.Изменение.Организации
	|Документ.ОтчетОРозничныхПродажах.Чтение.Организации
	|Документ.ОтчетОРозничныхПродажах.Изменение.Организации
	|Документ.ОтчетПроизводстваЗаСмену.Чтение.Организации
	|Документ.ОтчетПроизводстваЗаСмену.Изменение.Организации
	|Документ.ОформлениеСДИЗЗЕРНО.Чтение.Организации
	|Документ.ОформлениеСДИЗЗЕРНО.Изменение.Организации
	|Документ.ПакетОбменСБанками.Чтение.Организации
	|Документ.ПакетОбменСБанками.Изменение.Организации
	|Документ.Партия.Чтение.Организации
	|Документ.Партия.Изменение.Организации
	|Документ.ПартияМатериаловВЭксплуатации.Чтение.Организации
	|Документ.ПартияМатериаловВЭксплуатации.Изменение.Организации
	|Документ.ПачкаДокументовАДВ_1.Чтение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовАДВ_1.Чтение.Организации
	|Документ.ПачкаДокументовАДВ_1.Изменение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовАДВ_1.Изменение.Организации
	|Документ.ПачкаДокументовАДВ_2.Чтение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовАДВ_2.Чтение.Организации
	|Документ.ПачкаДокументовАДВ_2.Изменение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовАДВ_2.Изменение.Организации
	|Документ.ПачкаДокументовАДВ_3.Чтение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовАДВ_3.Чтение.Организации
	|Документ.ПачкаДокументовАДВ_3.Изменение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовАДВ_3.Изменение.Организации
	|Документ.ПачкаДокументовДСВ_1.Чтение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовДСВ_1.Чтение.Организации
	|Документ.ПачкаДокументовДСВ_1.Изменение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовДСВ_1.Изменение.Организации
	|Документ.ПачкаДокументовСЗВ_6_1.Чтение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСЗВ_6_1.Чтение.Организации
	|Документ.ПачкаДокументовСЗВ_6_1.Изменение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСЗВ_6_1.Изменение.Организации
	|Документ.ПачкаДокументовСЗВ_6_3.Чтение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСЗВ_6_3.Чтение.Организации
	|Документ.ПачкаДокументовСЗВ_6_3.Изменение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСЗВ_6_3.Изменение.Организации
	|Документ.ПачкаДокументовСЗВ_6_4.Чтение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСЗВ_6_4.Чтение.Организации
	|Документ.ПачкаДокументовСЗВ_6_4.Изменение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСЗВ_6_4.Изменение.Организации
	|Документ.ПачкаДокументовСЗВ_К.Чтение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСЗВ_К.Чтение.Организации
	|Документ.ПачкаДокументовСЗВ_К.Изменение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСЗВ_К.Изменение.Организации
	|Документ.ПачкаДокументовСПВ_1.Чтение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСПВ_1.Чтение.Организации
	|Документ.ПачкаДокументовСПВ_1.Изменение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСПВ_1.Изменение.Организации
	|Документ.ПачкаДокументовСПВ_2.Чтение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСПВ_2.Чтение.Организации
	|Документ.ПачкаДокументовСПВ_2.Изменение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСПВ_2.Изменение.Организации
	|Документ.ПачкаРазделов6РасчетаРСВ_1.Чтение.ГруппыФизическихЛиц
	|Документ.ПачкаРазделов6РасчетаРСВ_1.Чтение.Организации
	|Документ.ПачкаРазделов6РасчетаРСВ_1.Изменение.ГруппыФизическихЛиц
	|Документ.ПачкаРазделов6РасчетаРСВ_1.Изменение.Организации
	|Документ.ПереводОСВМалоценноеОборудование.Чтение.Организации
	|Документ.ПереводОСВМалоценноеОборудование.Изменение.Организации
	|Документ.ПередачаЗадолженностиНаФакторинг.Чтение.Организации
	|Документ.ПередачаЗадолженностиНаФакторинг.Изменение.Организации
	|Документ.ПередачаМатериаловВЭксплуатацию.Чтение.Организации
	|Документ.ПередачаМатериаловВЭксплуатацию.Изменение.Организации
	|Документ.ПередачаНМА.Чтение.Организации
	|Документ.ПередачаНМА.Изменение.Организации
	|Документ.ПередачаОборудованияВМонтаж.Чтение.Организации
	|Документ.ПередачаОборудованияВМонтаж.Изменение.Организации
	|Документ.ПередачаОС.Чтение.Организации
	|Документ.ПередачаОС.Изменение.Организации
	|Документ.ПередачаОСВАренду.Чтение.Организации
	|Документ.ПередачаОСВАренду.Изменение.Организации
	|Документ.ПередачаТоваров.Чтение.Организации
	|Документ.ПередачаТоваров.Изменение.Организации
	|Документ.ПеремещениеОС.Чтение.Организации
	|Документ.ПеремещениеОС.Изменение.Организации
	|Документ.ПеремещениеТоваров.Чтение.Организации
	|Документ.ПеремещениеТоваров.Изменение.Организации
	|Документ.ПереоценкаТоваровВРознице.Чтение.Организации
	|Документ.ПереоценкаТоваровВРознице.Изменение.Организации
	|Документ.ПерерасчетНДФЛ.Чтение.ГруппыФизическихЛиц
	|Документ.ПерерасчетНДФЛ.Чтение.Организации
	|Документ.ПерерасчетНДФЛ.Изменение.ГруппыФизическихЛиц
	|Документ.ПерерасчетНДФЛ.Изменение.Организации
	|Документ.ПерерасчетСтраховыхВзносов.Чтение.ГруппыФизическихЛиц
	|Документ.ПерерасчетСтраховыхВзносов.Чтение.Организации
	|Документ.ПерерасчетСтраховыхВзносов.Изменение.ГруппыФизическихЛиц
	|Документ.ПерерасчетСтраховыхВзносов.Изменение.Организации
	|Документ.ПисьмоОбменСБанками.Чтение.Организации
	|Документ.ПисьмоОбменСБанками.Изменение.Организации
	|Документ.ПлатежноеПоручение.Чтение.Организации
	|Документ.ПлатежноеПоручение.Изменение.Организации
	|Документ.ПлатежноеТребование.Чтение.Организации
	|Документ.ПлатежноеТребование.Изменение.Организации
	|Документ.ПогашениеСДИЗЗЕРНО.Чтение.Организации
	|Документ.ПогашениеСДИЗЗЕРНО.Изменение.Организации
	|Документ.ПодготовкаКПередачеОС.Чтение.Организации
	|Документ.ПодготовкаКПередачеОС.Изменение.Организации
	|Документ.ПодключениеКегаКОборудованиюРозливаИСМП.Чтение.Организации
	|Документ.ПодключениеКегаКОборудованиюРозливаИСМП.Изменение.Организации
	|Документ.ПодтверждениеЗачисленияЗарплаты.Чтение.ГруппыФизическихЛиц
	|Документ.ПодтверждениеЗачисленияЗарплаты.Чтение.Организации
	|Документ.ПодтверждениеЗачисленияЗарплаты.Изменение.ГруппыФизическихЛиц
	|Документ.ПодтверждениеЗачисленияЗарплаты.Изменение.Организации
	|Документ.ПодтверждениеНулевойСтавкиНДС.Чтение.Организации
	|Документ.ПодтверждениеНулевойСтавкиНДС.Изменение.Организации
	|Документ.ПодтверждениеОплатыНДСВБюджет.Чтение.Организации
	|Документ.ПодтверждениеОплатыНДСВБюджет.Изменение.Организации
	|Документ.ПодтверждениеОткрытияЛицевыхСчетовСотрудников.Чтение.ГруппыФизическихЛиц
	|Документ.ПодтверждениеОткрытияЛицевыхСчетовСотрудников.Чтение.Организации
	|Документ.ПодтверждениеОткрытияЛицевыхСчетовСотрудников.Изменение.ГруппыФизическихЛиц
	|Документ.ПодтверждениеОткрытияЛицевыхСчетовСотрудников.Изменение.Организации
	|Документ.ПоступлениеВАренду.Чтение.Организации
	|Документ.ПоступлениеВАренду.Изменение.Организации
	|Документ.ПоступлениеДенежныхДокументов.Чтение.Организации
	|Документ.ПоступлениеДенежныхДокументов.Изменение.Организации
	|Документ.ПоступлениеДопРасходов.Чтение.Организации
	|Документ.ПоступлениеДопРасходов.Изменение.Организации
	|Документ.ПоступлениеИзПереработки.Чтение.Организации
	|Документ.ПоступлениеИзПереработки.Изменение.Организации
	|Документ.ПоступлениеНаРасчетныйСчет.Чтение.Организации
	|Документ.ПоступлениеНаРасчетныйСчет.Изменение.Организации
	|Документ.ПоступлениеНМА.Чтение.Организации
	|Документ.ПоступлениеНМА.Изменение.Организации
	|Документ.ПоступлениеТоваровУслуг.Чтение.ВидыОперацийПТиУ
	|Документ.ПоступлениеТоваровУслуг.Чтение.Организации
	|Документ.ПоступлениеТоваровУслуг.Изменение.ВидыОперацийПТиУ
	|Документ.ПоступлениеТоваровУслуг.Изменение.Организации
	|Документ.ПоясненияКДекларацииПоНДС.Чтение.Организации
	|Документ.ПоясненияКДекларацииПоНДС.Изменение.Организации
	|Документ.ПрекращениеАренды.Чтение.Организации
	|Документ.ПрекращениеАренды.Изменение.Организации
	|Документ.ПрекращениеСтандартныхВычетовНДФЛ.Чтение.ГруппыФизическихЛиц
	|Документ.ПрекращениеСтандартныхВычетовНДФЛ.Чтение.Организации
	|Документ.ПрекращениеСтандартныхВычетовНДФЛ.Изменение.ГруппыФизическихЛиц
	|Документ.ПрекращениеСтандартныхВычетовНДФЛ.Изменение.Организации
	|Документ.ПриемНаРаботу.Чтение.ГруппыФизическихЛиц
	|Документ.ПриемНаРаботу.Чтение.Организации
	|Документ.ПриемНаРаботу.Изменение.ГруппыФизическихЛиц
	|Документ.ПриемНаРаботу.Изменение.Организации
	|Документ.ПринятиеКУчетуНМА.Чтение.Организации
	|Документ.ПринятиеКУчетуНМА.Изменение.Организации
	|Документ.ПринятиеКУчетуОС.Чтение.Организации
	|Документ.ПринятиеКУчетуОС.Изменение.Организации
	|Документ.ПриходныйКассовыйОрдер.Чтение.ВидыОперацийПКО
	|Документ.ПриходныйКассовыйОрдер.Чтение.Организации
	|Документ.ПриходныйКассовыйОрдер.Изменение.ВидыОперацийПКО
	|Документ.ПриходныйКассовыйОрдер.Изменение.Организации
	|Документ.ПрочиеКонтролируемыеСделки.Чтение.Организации
	|Документ.ПрочиеКонтролируемыеСделки.Изменение.Организации
	|Документ.ПутевойЛист.Чтение.Организации
	|Документ.ПутевойЛист.Изменение.Организации
	|Документ.РаспознанныйДокумент.Чтение.Организации
	|Документ.РаспознанныйДокумент.Изменение.Организации
	|Документ.РаспределениеНДС.Чтение.Организации
	|Документ.РаспределениеНДС.Изменение.Организации
	|Документ.РасходныйКассовыйОрдер.Чтение.Организации
	|Документ.РасходныйКассовыйОрдер.Изменение.Организации
	|Документ.РасходыНаОнлайнКассыУменьшающиеНалоги.Чтение.Организации
	|Документ.РасходыНаОнлайнКассыУменьшающиеНалоги.Изменение.Организации
	|Документ.РасходыПредпринимателя.Чтение.Организации
	|Документ.РасходыПредпринимателя.Изменение.Организации
	|Документ.РеализацияОтгруженныхТоваров.Чтение.Организации
	|Документ.РеализацияОтгруженныхТоваров.Изменение.Организации
	|Документ.РеализацияТоваровУслуг.Чтение.Организации
	|Документ.РеализацияТоваровУслуг.Изменение.Организации
	|Документ.РеализацияУслугПоПереработке.Чтение.Организации
	|Документ.РеализацияУслугПоПереработке.Изменение.Организации
	|Документ.РегистрацияОплатыОсновныхСредствДляИП.Чтение.Организации
	|Документ.РегистрацияОплатыОсновныхСредствДляИП.Изменение.Организации
	|Документ.РегистрацияОплатыОсновныхСредствДляУСН.Чтение.Организации
	|Документ.РегистрацияОплатыОсновныхСредствДляУСН.Изменение.Организации
	|Документ.РегистрацияСведенийОЗастрахованномЛицеФСС.Чтение.ГруппыФизическихЛиц
	|Документ.РегистрацияСведенийОЗастрахованномЛицеФСС.Чтение.Организации
	|Документ.РегистрацияСведенийОЗастрахованномЛицеФСС.Изменение.ГруппыФизическихЛиц
	|Документ.РегистрацияСведенийОЗастрахованномЛицеФСС.Изменение.Организации
	|Документ.РегистрацияСуммыУбыткаУСН.Чтение.Организации
	|Документ.РегистрацияСуммыУбыткаУСН.Изменение.Организации
	|Документ.РегистрацияТрудовойДеятельности.Чтение.ГруппыФизическихЛиц
	|Документ.РегистрацияТрудовойДеятельности.Чтение.Организации
	|Документ.РегистрацияТрудовойДеятельности.Изменение.ГруппыФизическихЛиц
	|Документ.РегистрацияТрудовойДеятельности.Изменение.Организации
	|Документ.РегистрУчета.Чтение.Организации
	|Документ.РегистрУчета.Изменение.Организации
	|Документ.РегламентированныйОтчет.Чтение.Организации
	|Документ.РегламентированныйОтчет.Изменение.Организации
	|Документ.РегламентнаяОперация.Чтение.Организации
	|Документ.РегламентнаяОперация.Изменение.Организации
	|Документ.РеестрДанныхЭЛНЗаполняемыхРаботодателем.Чтение.Организации
	|Документ.РеестрДанныхЭЛНЗаполняемыхРаботодателем.Изменение.Организации
	|Документ.РеестрДСВ_3.Чтение.ГруппыФизическихЛиц
	|Документ.РеестрДСВ_3.Чтение.Организации
	|Документ.РеестрДСВ_3.Изменение.ГруппыФизическихЛиц
	|Документ.РеестрДСВ_3.Изменение.Организации
	|Документ.РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособий.Чтение.ГруппыФизическихЛиц
	|Документ.РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособий.Чтение.Организации
	|Документ.РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособий.Изменение.ГруппыФизическихЛиц
	|Документ.РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособий.Изменение.Организации
	|Документ.РеестрСЗВ_6_2.Чтение.ГруппыФизическихЛиц
	|Документ.РеестрСЗВ_6_2.Чтение.Организации
	|Документ.РеестрСЗВ_6_2.Изменение.ГруппыФизическихЛиц
	|Документ.РеестрСЗВ_6_2.Изменение.Организации
	|Документ.РеестрСчетовФактурПоставщика.Чтение.Организации
	|Документ.РеестрСчетовФактурПоставщика.Изменение.Организации
	|Документ.РезервыПоОплатеТруда.Чтение.ГруппыФизическихЛиц
	|Документ.РезервыПоОплатеТруда.Чтение.Организации
	|Документ.РезервыПоОплатеТруда.Изменение.ГруппыФизическихЛиц
	|Документ.РезервыПоОплатеТруда.Изменение.Организации
	|Документ.РозничнаяПродажа.Чтение.Организации
	|Документ.РозничнаяПродажа.Изменение.Организации
	|Документ.СведенияДляИсчисленияДоплатыКПенсииСЗВ_ДСО.Чтение.ГруппыФизическихЛиц
	|Документ.СведенияДляИсчисленияДоплатыКПенсииСЗВ_ДСО.Чтение.Организации
	|Документ.СведенияДляИсчисленияДоплатыКПенсииСЗВ_ДСО.Изменение.ГруппыФизическихЛиц
	|Документ.СведенияДляИсчисленияДоплатыКПенсииСЗВ_ДСО.Изменение.Организации
	|Документ.СведенияОбУдержанномНДФЛ.Чтение.Организации
	|Документ.СведенияОбУдержанномНДФЛ.Изменение.Организации
	|Документ.СведенияОбУплатеНалогов.Чтение.Организации
	|Документ.СведенияОбУплатеНалогов.Изменение.Организации
	|Документ.СведенияОДоходахСотрудникаДляСоцВыплат.Чтение.ГруппыФизическихЛиц
	|Документ.СведенияОДоходахСотрудникаДляСоцВыплат.Чтение.Организации
	|Документ.СведенияОДоходахСотрудникаДляСоцВыплат.Изменение.ГруппыФизическихЛиц
	|Документ.СведенияОДоходахСотрудникаДляСоцВыплат.Изменение.Организации
	|Документ.СведенияОЗаработкеСтажеЗастрахованныхЛицСЗВ_ИСХ.Чтение.ГруппыФизическихЛиц
	|Документ.СведенияОЗаработкеСтажеЗастрахованныхЛицСЗВ_ИСХ.Чтение.Организации
	|Документ.СведенияОЗаработкеСтажеЗастрахованныхЛицСЗВ_ИСХ.Изменение.ГруппыФизическихЛиц
	|Документ.СведенияОЗаработкеСтажеЗастрахованныхЛицСЗВ_ИСХ.Изменение.Организации
	|Документ.СведенияОЗастрахованномЛицеФСС.Чтение.ГруппыФизическихЛиц
	|Документ.СведенияОЗастрахованномЛицеФСС.Чтение.Организации
	|Документ.СведенияОЗастрахованномЛицеФСС.Изменение.ГруппыФизическихЛиц
	|Документ.СведенияОЗастрахованномЛицеФСС.Изменение.Организации
	|Документ.СведенияОЗастрахованныхЛицахСЗВ_М.Чтение.ГруппыФизическихЛиц
	|Документ.СведенияОЗастрахованныхЛицахСЗВ_М.Чтение.Организации
	|Документ.СведенияОЗастрахованныхЛицахСЗВ_М.Изменение.ГруппыФизическихЛиц
	|Документ.СведенияОЗастрахованныхЛицахСЗВ_М.Изменение.Организации
	|Документ.СведенияОПриемеПереводеИУвольненииДляВоенкомата.Чтение.ГруппыФизическихЛиц
	|Документ.СведенияОПриемеПереводеИУвольненииДляВоенкомата.Чтение.Организации
	|Документ.СведенияОПриемеПереводеИУвольненииДляВоенкомата.Изменение.ГруппыФизическихЛиц
	|Документ.СведенияОПриемеПереводеИУвольненииДляВоенкомата.Изменение.Организации
	|Документ.СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ.Чтение.ГруппыФизическихЛиц
	|Документ.СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ.Чтение.Организации
	|Документ.СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ.Изменение.ГруппыФизическихЛиц
	|Документ.СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ.Изменение.Организации
	|Документ.СведенияОТрудовойДеятельностиРаботникаСТД_Р.Чтение.ГруппыФизическихЛиц
	|Документ.СведенияОТрудовойДеятельностиРаботникаСТД_Р.Чтение.Организации
	|Документ.СведенияОТрудовойДеятельностиРаботникаСТД_Р.Изменение.ГруппыФизическихЛиц
	|Документ.СведенияОТрудовойДеятельностиРаботникаСТД_Р.Изменение.Организации
	|Документ.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Чтение.ГруппыФизическихЛиц
	|Документ.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Чтение.Организации
	|Документ.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Изменение.ГруппыФизическихЛиц
	|Документ.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Изменение.Организации
	|Документ.СверкаСВоеннымКомиссариатом.Чтение.ГруппыФизическихЛиц
	|Документ.СверкаСВоеннымКомиссариатом.Чтение.Организации
	|Документ.СверкаСВоеннымКомиссариатом.Изменение.ГруппыФизическихЛиц
	|Документ.СверкаСВоеннымКомиссариатом.Изменение.Организации
	|Документ.СверкаСДокументамиВоинскогоУчета.Чтение.ГруппыФизическихЛиц
	|Документ.СверкаСДокументамиВоинскогоУчета.Чтение.Организации
	|Документ.СверкаСДокументамиВоинскогоУчета.Изменение.ГруппыФизическихЛиц
	|Документ.СверкаСДокументамиВоинскогоУчета.Изменение.Организации
	|Документ.СверкаСФНСПоИмущественнымНалогам.Чтение.Организации
	|Документ.СверкаСФНСПоИмущественнымНалогам.Изменение.Организации
	|Документ.СогласиеНаОбработкуПерсональныхДанных.Чтение.ГруппыФизическихЛиц
	|Документ.СогласиеНаОбработкуПерсональныхДанных.Чтение.Организации
	|Документ.СогласиеНаОбработкуПерсональныхДанных.Изменение.ГруппыФизическихЛиц
	|Документ.СогласиеНаОбработкуПерсональныхДанных.Изменение.Организации
	|Документ.СогласиеНаПрисоединениеККЭДО.Чтение.ГруппыФизическихЛиц
	|Документ.СогласиеНаПрисоединениеККЭДО.Чтение.Организации
	|Документ.СогласиеНаПрисоединениеККЭДО.Изменение.ГруппыФизическихЛиц
	|Документ.СогласиеНаПрисоединениеККЭДО.Изменение.Организации
	|Документ.СообщениеОбменСБанками.Чтение.Организации
	|Документ.СообщениеОбменСБанками.Изменение.Организации
	|Документ.СообщениеЭДО.Чтение.Организации
	|Документ.СообщениеЭДО.Изменение.Организации
	|Документ.СписаниеДепонированнойЗарплаты.Чтение.ГруппыФизическихЛиц
	|Документ.СписаниеДепонированнойЗарплаты.Чтение.Организации
	|Документ.СписаниеДепонированнойЗарплаты.Изменение.ГруппыФизическихЛиц
	|Документ.СписаниеДепонированнойЗарплаты.Изменение.Организации
	|Документ.СписаниеМатериаловИзЭксплуатации.Чтение.Организации
	|Документ.СписаниеМатериаловИзЭксплуатации.Изменение.Организации
	|Документ.СписаниеНДС.Чтение.Организации
	|Документ.СписаниеНДС.Изменение.Организации
	|Документ.СписаниеНМА.Чтение.Организации
	|Документ.СписаниеНМА.Изменение.Организации
	|Документ.СписаниеОС.Чтение.Организации
	|Документ.СписаниеОС.Изменение.Организации
	|Документ.СписаниеПартийЗЕРНО.Чтение.Организации
	|Документ.СписаниеПартийЗЕРНО.Изменение.Организации
	|Документ.СписаниеСРасчетногоСчета.Чтение.Организации
	|Документ.СписаниеСРасчетногоСчета.Изменение.Организации
	|Документ.СписаниеТоваров.Чтение.Организации
	|Документ.СписаниеТоваров.Изменение.Организации
	|Документ.СправкаНДФЛ.Чтение.ГруппыФизическихЛиц
	|Документ.СправкаНДФЛ.Чтение.Организации
	|Документ.СправкаНДФЛ.Изменение.ГруппыФизическихЛиц
	|Документ.СправкаНДФЛ.Изменение.Организации
	|Документ.СправкиНДФЛДляПередачиВНалоговыйОрган.Чтение.ГруппыФизическихЛиц
	|Документ.СправкиНДФЛДляПередачиВНалоговыйОрган.Чтение.Организации
	|Документ.СправкиНДФЛДляПередачиВНалоговыйОрган.Изменение.ГруппыФизическихЛиц
	|Документ.СправкиНДФЛДляПередачиВНалоговыйОрган.Изменение.Организации
	|Документ.СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыль.Чтение.ГруппыФизическихЛиц
	|Документ.СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыль.Чтение.Организации
	|Документ.СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыль.Изменение.ГруппыФизическихЛиц
	|Документ.СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыль.Изменение.Организации
	|Документ.СреднийЗаработокСЭДО.Чтение.ГруппыФизическихЛиц
	|Документ.СреднийЗаработокСЭДО.Чтение.Организации
	|Документ.СреднийЗаработокСЭДО.Изменение.ГруппыФизическихЛиц
	|Документ.СреднийЗаработокСЭДО.Изменение.Организации
	|Документ.СтатистикаПерсонала.Чтение.Организации
	|Документ.СтатистикаПерсонала.Изменение.Организации
	|Документ.СчетНаОплатуПокупателю.Чтение.Организации
	|Документ.СчетНаОплатуПокупателю.Изменение.Организации
	|Документ.СчетНаОплатуПоставщика.Чтение.Организации
	|Документ.СчетНаОплатуПоставщика.Изменение.Организации
	|Документ.СчетФактураВыданный.Чтение.Организации
	|Документ.СчетФактураВыданный.Изменение.Организации
	|Документ.СчетФактураПолученный.Чтение.Организации
	|Документ.СчетФактураПолученный.Изменение.Организации
	|Документ.ТаможеннаяДекларацияЭкспорт.Чтение.Организации
	|Документ.ТаможеннаяДекларацияЭкспорт.Изменение.Организации
	|Документ.ТранспортныйКонтейнерЭДО.Чтение.Организации
	|Документ.ТранспортныйКонтейнерЭДО.Изменение.Организации
	|Документ.ТребованиеНакладная.Чтение.Организации
	|Документ.ТребованиеНакладная.Изменение.Организации
	|Документ.УведомлениеОбИмпортеМаркированныхТоваровГИСМ.Чтение.Организации
	|Документ.УведомлениеОбИмпортеМаркированныхТоваровГИСМ.Изменение.Организации
	|Документ.УведомлениеОбИсчисленныхСуммахНалогов.Чтение.Организации
	|Документ.УведомлениеОбИсчисленныхСуммахНалогов.Изменение.Организации
	|Документ.УведомлениеОбОстаткахПрослеживаемыхТоваров.Чтение.Организации
	|Документ.УведомлениеОбОстаткахПрослеживаемыхТоваров.Изменение.Организации
	|Документ.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.Чтение.Организации
	|Документ.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.Изменение.Организации
	|Документ.УведомлениеОбУменьшенииНалогаПоПатенту.Чтение.Организации
	|Документ.УведомлениеОбУменьшенииНалогаПоПатенту.Изменение.Организации
	|Документ.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.Чтение.Организации
	|Документ.УведомлениеОВвозеПрослеживаемыхТоваров.Чтение.Организации
	|Документ.УведомлениеОВвозеПрослеживаемыхТоваров.Изменение.Организации
	|Документ.УведомлениеОКонтролируемыхСделках.Чтение.Организации
	|Документ.УведомлениеОКонтролируемыхСделках.Изменение.Организации
	|Документ.УведомлениеОПеремещенииПрослеживаемыхТоваров.Чтение.Организации
	|Документ.УведомлениеОПеремещенииПрослеживаемыхТоваров.Изменение.Организации
	|Документ.УведомлениеОПолучателеДокументов.Чтение.Организации
	|Документ.УведомлениеОПолучателеДокументов.Изменение.Организации
	|Документ.УведомлениеОПоступленииМаркированныхТоваровГИСМ.Чтение.Организации
	|Документ.УведомлениеОПоступленииМаркированныхТоваровГИСМ.Изменение.Организации
	|Документ.УведомлениеОПравеНаИмущественныйВычетДляНДФЛ.Чтение.ГруппыФизическихЛиц
	|Документ.УведомлениеОПравеНаИмущественныйВычетДляНДФЛ.Чтение.Организации
	|Документ.УведомлениеОПравеНаИмущественныйВычетДляНДФЛ.Изменение.ГруппыФизическихЛиц
	|Документ.УведомлениеОПравеНаИмущественныйВычетДляНДФЛ.Изменение.Организации
	|Документ.УведомлениеОПредоставленииПолномочийПредставителю.Чтение.Организации
	|Документ.УведомлениеОПредоставленииПолномочийПредставителю.Изменение.Организации
	|Документ.УведомлениеОПрекращенииОтпускаПоУходуЗаРебенком.Чтение.ГруппыФизическихЛиц
	|Документ.УведомлениеОПрекращенииОтпускаПоУходуЗаРебенком.Чтение.Организации
	|Документ.УведомлениеОПрекращенииОтпускаПоУходуЗаРебенком.Изменение.ГруппыФизическихЛиц
	|Документ.УведомлениеОПрекращенииОтпускаПоУходуЗаРебенком.Изменение.Организации
	|Документ.УведомлениеОПрекращенииПолномочийПредставителя.Чтение.Организации
	|Документ.УведомлениеОПрекращенииПолномочийПредставителя.Изменение.Организации
	|Документ.УведомлениеОСпецрежимахНалогообложения.Чтение.Организации
	|Документ.УведомлениеОСпецрежимахНалогообложения.Изменение.Организации
	|Документ.УведомлениеОСписанииКиЗГИСМ.Чтение.Организации
	|Документ.УведомлениеОСписанииКиЗГИСМ.Изменение.Организации
	|Документ.Увольнение.Чтение.ГруппыФизическихЛиц
	|Документ.Увольнение.Чтение.Организации
	|Документ.Увольнение.Изменение.ГруппыФизическихЛиц
	|Документ.Увольнение.Изменение.Организации
	|Документ.УдалитьКассовыйЧекКоррекции.Чтение.Организации
	|Документ.УдалитьКассовыйЧекКоррекции.Изменение.Организации
	|Документ.УсловияОплатыПоступления.Чтение.Организации
	|Документ.УсловияОплатыПоступления.Изменение.Организации
	|Документ.УстановкаПорядкаЗакрытияПодразделений.Чтение.Организации
	|Документ.УстановкаПорядкаЗакрытияПодразделений.Изменение.Организации
	|Документ.УточнениеСведенийОКодахМаркировкиИСМП.Чтение.Организации
	|Документ.УточнениеСведенийОКодахМаркировкиИСМП.Изменение.Организации
	|Документ.ФинОтчетВБанк.Чтение.Организации
	|Документ.ФинОтчетВБанк.Изменение.Организации
	|Документ.ФормированиеЗаписейКнигиПокупок.Чтение.Организации
	|Документ.ФормированиеЗаписейКнигиПокупок.Изменение.Организации
	|Документ.ФормированиеЗаписейКнигиПродаж.Чтение.Организации
	|Документ.ФормированиеЗаписейКнигиПродаж.Изменение.Организации
	|Документ.ФормированиеЗаписейРаздела7ДекларацииНДС.Чтение.Организации
	|Документ.ФормированиеЗаписейРаздела7ДекларацииНДС.Изменение.Организации
	|Документ.ФормированиеПартийЗЕРНО.Чтение.Организации
	|Документ.ФормированиеПартийЗЕРНО.Изменение.Организации
	|Документ.ФормированиеПартийИзДругихПартийЗЕРНО.Чтение.Организации
	|Документ.ФормированиеПартийИзДругихПартийЗЕРНО.Изменение.Организации
	|Документ.ФормированиеПартийПриПроизводствеЗЕРНО.Чтение.Организации
	|Документ.ФормированиеПартийПриПроизводствеЗЕРНО.Изменение.Организации
	|Документ.ФормированиеУставногоКапитала.Чтение.Организации
	|Документ.ФормированиеУставногоКапитала.Изменение.Организации
	|Документ.ХодатайствоОБронированииГражданПребывающихВЗапасе.Чтение.ГруппыФизическихЛиц
	|Документ.ХодатайствоОБронированииГражданПребывающихВЗапасе.Чтение.Организации
	|Документ.ХодатайствоОБронированииГражданПребывающихВЗапасе.Изменение.ГруппыФизическихЛиц
	|Документ.ХодатайствоОБронированииГражданПребывающихВЗапасе.Изменение.Организации
	|Документ.ЭлектроннаяСопроводительнаяВедомость.Чтение.Организации
	|Документ.ЭлектроннаяСопроводительнаяВедомость.Изменение.Организации
	|Документ.ЭлектроннаяТранспортнаяНакладная.Чтение.Организации
	|Документ.ЭлектроннаяТранспортнаяНакладная.Изменение.Организации
	|Документ.ЭлектронныйДоговорФрахтования.Чтение.Организации
	|Документ.ЭлектронныйДоговорФрахтования.Изменение.Организации
	|Документ.ЭлектронныйДокументВходящийЭДО.Чтение.Организации
	|Документ.ЭлектронныйДокументВходящийЭДО.Изменение.Организации
	|Документ.ЭлектронныйДокументИсходящийЭДО.Чтение.Организации
	|Документ.ЭлектронныйДокументИсходящийЭДО.Изменение.Организации
	|Документ.ЭлектронныйЗаказЗаявка.Чтение.Организации
	|Документ.ЭлектронныйЗаказЗаявка.Изменение.Организации
	|Документ.ЭлектронныйЗаказНаряд.Чтение.Организации
	|Документ.ЭлектронныйЗаказНаряд.Изменение.Организации
	|Документ.ЭлектронныйПутевойЛист.Чтение.Организации
	|Документ.ЭлектронныйПутевойЛист.Изменение.Организации
	|ЖурналДокументов.АнкетыПерсонифицированногоУчета.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.АнкетыПерсонифицированногоУчета.Чтение.Организации
	|ЖурналДокументов.БронированиеГражданПребывающихВЗапасе.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.БронированиеГражданПребывающихВЗапасе.Чтение.Организации
	|ЖурналДокументов.ВыплатаЗарплаты.Чтение.Организации
	|ЖурналДокументов.ДенежныеДокументы.Чтение.Организации
	|ЖурналДокументов.Деньги.Чтение.Организации
	|ЖурналДокументов.ДобровольноеПенсионноеСтрахованиеПФР.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.ДобровольноеПенсионноеСтрахованиеПФР.Чтение.Организации
	|ЖурналДокументов.Документы.Чтение.Организации
	|ЖурналДокументов.ДокументыОбменаСБанкамиПоЗарплатнымПроектам.Чтение.Организации
	|ЖурналДокументов.ДокументыПоНДФЛ.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.ДокументыПоНДФЛ.Чтение.Организации
	|ЖурналДокументов.ДокументыПоНМА.Чтение.Организации
	|ЖурналДокументов.ДокументыПоОС.Чтение.Организации
	|ЖурналДокументов.ДокументыПоУчетуНДСДляПередачиВЭлектронномВиде.Чтение.Организации
	|ЖурналДокументов.ЖурналОпераций.Чтение.Организации
	|ЖурналДокументов.ЗаявленияНаВычеты.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.ЗаявленияНаВычеты.Чтение.Организации
	|ЖурналДокументов.ЗаявленияОписиИРеестрыНаВыплатуПособий.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.ЗаявленияОписиИРеестрыНаВыплатуПособий.Чтение.Организации
	|ЖурналДокументов.КадровыеДокументы.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.КадровыеДокументы.Чтение.Организации
	|ЖурналДокументов.НачислениеЗарплаты.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.НачислениеЗарплаты.Чтение.Организации
	|ЖурналДокументов.ПараметрыАмортизацииНМА.Чтение.Организации
	|ЖурналДокументов.ПараметрыАмортизацииОС.Чтение.Организации
	|ЖурналДокументов.ПерсонифицированныйУчет.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.ПерсонифицированныйУчет.Чтение.Организации
	|ЖурналДокументов.ПроизводственныеДокументы.Чтение.Организации
	|ЖурналДокументов.ПрослеживаемостьУведомления.Чтение.Организации
	|ЖурналДокументов.РегламентныеОперацииНДС.Чтение.Организации
	|ЖурналДокументов.СверкаКарточекВоинскогоУчета.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.СверкаКарточекВоинскогоУчета.Чтение.Организации
	|ЖурналДокументов.СкладскиеДокументы.Чтение.Организации
	|ЖурналДокументов.ЭлектронныеТрудовыеКнижки.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.ЭлектронныеТрудовыеКнижки.Чтение.Организации
	|ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.Чтение.ДополнительныеСведения
	|РегистрСведений.АктуальностьКомплектаНулевойОтчетности.Чтение.Организации
	|РегистрСведений.АктуальностьКомплектаНулевойОтчетности.Изменение.Организации
	|РегистрСведений.АктуальностьСпискаЗадачБухгалтера.Чтение.Организации
	|РегистрСведений.АктуальностьСпискаЗадачБухгалтера.Изменение.Организации
	|РегистрСведений.АрхивДанныхРегламентированнойОтчетности.Чтение.Организации
	|РегистрСведений.АрхивДанныхРегламентированнойОтчетности.Изменение.Организации
	|РегистрСведений.БазаРаспределенияНДС.Чтение.Организации
	|РегистрСведений.БазаРаспределенияНДС.Изменение.Организации
	|РегистрСведений.БанковскиеДокументыАУСН.Чтение.Организации
	|РегистрСведений.БанковскиеДокументыАУСН.Изменение.Организации
	|РегистрСведений.БанковскиеСчетаИнтеграцииСБанком.Чтение.Организации
	|РегистрСведений.БухучетЗарплатыОрганизаций.Чтение.Организации
	|РегистрСведений.БухучетЗарплатыОрганизаций.Изменение.Организации
	|РегистрСведений.ВариантыПримененияТребованийЗаконодательства.Чтение.Организации
	|РегистрСведений.ВариантыПримененияТребованийЗаконодательства.Изменение.Организации
	|РегистрСведений.ВерсииТитуловЭПД.Чтение.Организации
	|РегистрСведений.ВерсииТитуловЭПД.Изменение.Организации
	|РегистрСведений.ВзаимозависимыеЛица.Чтение.Организации
	|РегистрСведений.ВзаимозависимыеЛица.Изменение.Организации
	|РегистрСведений.ВидыЗанятостиСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ВидыЗанятостиСотрудников.Чтение.Организации
	|РегистрСведений.ВидыЗанятостиСотрудниковИнтервальный.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ВидыЗанятостиСотрудниковИнтервальный.Чтение.Организации
	|РегистрСведений.ВложенияНеформализованныхДокументов.Чтение.Организации
	|РегистрСведений.ВложенияНеформализованныхДокументов.Изменение.Организации
	|РегистрСведений.ВоинскийУчет.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ВоинскийУчет.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ВходящиеСообщенияСЭДОФСС.Чтение.Организации
	|РегистрСведений.ВходящиеСообщенияСЭДОФСС.Изменение.Организации
	|РегистрСведений.ВычетыПредыдущегоМестаРаботыНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ВычетыПредыдущегоМестаРаботыНДФЛ.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ГражданствоФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ГражданствоФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ГрафикиАмортизацииОСБухгалтерскийУчет.Чтение.Организации
	|РегистрСведений.ГрафикиАмортизацииОСБухгалтерскийУчет.Изменение.Организации
	|РегистрСведений.ГрафикиПроцентныхРасходов.Чтение.Организации
	|РегистрСведений.ГрафикиПроцентныхРасходов.Изменение.Организации
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.Задание
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаИзменитьЛичныеДанные
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаНалоговыйВычет
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаОтпуск
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаОтсутствиеПоБолезни
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаСправка2НДФЛ
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.ОбращениеСотрудника
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.УдалитьЗаявкаКабинетСотрудника
	|РегистрСведений.ДанныеЛичногоКабинетаЕНС.Чтение.Организации
	|РегистрСведений.ДанныеЛичногоКабинетаЕНС.Изменение.Организации
	|РегистрСведений.ДанныеПервичныхДокументов.Чтение.Организации
	|РегистрСведений.ДанныеПервичныхДокументов.Изменение.Организации
	|РегистрСведений.ДанныеПоУдержаниямДляПечатиЧеков.Чтение.Организации
	|РегистрСведений.ДанныеПоУдержаниямДляПечатиЧеков.Изменение.Организации
	|РегистрСведений.ДанныеПредметовАренды.Чтение.Организации
	|РегистрСведений.ДанныеПредметовАренды.Изменение.Организации
	|РегистрСведений.ДатыВводаНачальныхОстатков.Чтение.Организации
	|РегистрСведений.ДатыВводаНачальныхОстатков.Изменение.Организации
	|РегистрСведений.ДоговорыУчастниковКонтролируемыхСделок.Чтение.Организации
	|РегистрСведений.ДоговорыУчастниковКонтролируемыхСделок.Изменение.Организации
	|РегистрСведений.ДокументыАУСН.Чтение.Организации
	|РегистрСведений.ДокументыАУСН.Изменение.Организации
	|РегистрСведений.ДокументыИнтеграцииCRM.Чтение.Организации
	|РегистрСведений.ДокументыИнтеграцииСБанком.Чтение.Организации
	|РегистрСведений.ДокументыПереходаНЗПДетализацияПоПродукции.Чтение.Организации
	|РегистрСведений.ДокументыПоНеоблагаемымНДСОперациям.Чтение.Организации
	|РегистрСведений.ДокументыПоНеоблагаемымНДСОперациям.Изменение.Организации
	|РегистрСведений.ДокументыПоТребованиюФНС.Чтение.Организации
	|РегистрСведений.ДокументыПоТребованиюФНС.Изменение.Организации
	|РегистрСведений.ДокументыФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ДокументыФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ДолиСписанияКосвенныхРасходов.Чтение.Организации
	|РегистрСведений.ДолиСписанияКосвенныхРасходов.Изменение.Организации
	|РегистрСведений.ДополнительныеСведения.Чтение.ДополнительныеСведения
	|РегистрСведений.ДополнительныеСведения.Изменение.ДополнительныеСведения
	|РегистрСведений.ДоходыПредыдущегоМестаРаботыНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ДоходыПредыдущегоМестаРаботыНДФЛ.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ЖурналДействийПоЭДО.Чтение.Организации
	|РегистрСведений.ЖурналДействийПоЭДО.Изменение.Организации
	|РегистрСведений.ЖурналЗагрузкиЕНС.Чтение.Организации
	|РегистрСведений.ЖурналЗагрузкиЕНС.Изменение.Организации
	|РегистрСведений.ЖурналЗапросовКСерверамФСС.Чтение.Организации
	|РегистрСведений.ЖурналЗапросовКСерверамФСС.Изменение.Организации
	|РегистрСведений.ЖурналМашиночитаемыхДоверенностей.Чтение.Организации
	|РегистрСведений.ЖурналМашиночитаемыхДоверенностей.Изменение.Организации
	|РегистрСведений.ЖурналНовыхСобытий.Чтение.Организации
	|РегистрСведений.ЖурналНовыхСобытий.Изменение.Организации
	|РегистрСведений.ЖурналНовыхСобытийОбменаСБанками.Чтение.Организации
	|РегистрСведений.ЖурналНовыхСобытийОбменаСБанками.Изменение.Организации
	|РегистрСведений.ЖурналОперацийСФайламиОбменаСБанками.Чтение.Организации
	|РегистрСведений.ЖурналОперацийСФайламиОбменаСБанками.Изменение.Организации
	|РегистрСведений.ЖурналОтправокВКонтролирующиеОрганы.Чтение.Организации
	|РегистрСведений.ЖурналОтправокВКонтролирующиеОрганы.Изменение.Организации
	|РегистрСведений.ЖурналОтчетовСтатусы.Чтение.Организации
	|РегистрСведений.ЖурналОтчетовСтатусы.Изменение.Организации
	|РегистрСведений.ЖурналПереданнойОтчетностиВБанк.Чтение.Организации
	|РегистрСведений.ЖурналПереданнойОтчетностиВБанк.Изменение.Организации
	|РегистрСведений.ЖурналПередачиОтчетностиВБанк.Чтение.Организации
	|РегистрСведений.ЖурналПередачиОтчетностиВБанк.Изменение.Организации
	|РегистрСведений.ЖурналСтатусовФинОтчетностиВБанки.Чтение.Организации
	|РегистрСведений.ЖурналСтатусовФинОтчетностиВБанки.Изменение.Организации
	|РегистрСведений.ЖурналУчетаСчетовФактур.Чтение.Организации
	|РегистрСведений.ЖурналУчетаСчетовФактур.Изменение.Организации
	|РегистрСведений.ЗадачиБухгалтера.Чтение.Организации
	|РегистрСведений.ЗадачиБухгалтера.Изменение.Организации
	|РегистрСведений.ЗадачиБухгалтераНалоговыеПлатежи.Чтение.Организации
	|РегистрСведений.ЗадачиБухгалтераНалоговыеПлатежи.Изменение.Организации
	|РегистрСведений.ЗадачиБухгалтераУведомления.Чтение.Организации
	|РегистрСведений.ЗадачиБухгалтераУведомления.Изменение.Организации
	|РегистрСведений.ЗапросыДляПовторнойОтправкиСЭДО.Чтение.Организации
	|РегистрСведений.ЗапросыДляПовторнойОтправкиСЭДО.Изменение.Организации
	|РегистрСведений.ЗарплатаКадрыДолиСписанияКосвенныхРасходов.Чтение.Организации
	|РегистрСведений.ЗарплатаКадрыДолиСписанияКосвенныхРасходов.Изменение.Организации
	|РегистрСведений.ЗастрахованныеЛицаСЭДО.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ЗастрахованныеЛицаСЭДО.Чтение.Организации
	|РегистрСведений.ЗастрахованныеЛицаСЭДО.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ЗастрахованныеЛицаСЭДО.Изменение.Организации
	|РегистрСведений.ЗаявленияОбОтменеПроверокКонтролирующимиОрганами.Чтение.Организации
	|РегистрСведений.ЗаявленияОбОтменеПроверокКонтролирующимиОрганами.Изменение.Организации
	|РегистрСведений.ЗаявленияОВеденииТрудовыхКнижек.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ЗаявленияОВеденииТрудовыхКнижек.Чтение.Организации
	|РегистрСведений.ЗаявленияОВеденииТрудовыхКнижекОтозванные.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ЗаявленияОВеденииТрудовыхКнижекОтозванные.Чтение.Организации
	|РегистрСведений.ЗаявленияОВеденииТрудовыхКнижекПереданные.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ЗаявленияОВеденииТрудовыхКнижекПереданные.Чтение.Организации
	|РегистрСведений.ЗнаниеЯзыковФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ЗнаниеЯзыковФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ЗначенияПараметровТиповойОперации.Чтение.Организации
	|РегистрСведений.ЗначенияПараметровТиповойОперации.Изменение.Организации
	|РегистрСведений.ЗначенияРеквизитовДокументовЭПД.Чтение.Организации
	|РегистрСведений.ЗначенияРеквизитовДокументовЭПД.Изменение.Организации
	|РегистрСведений.ИзбранныеРегламентированныеОтчеты.Чтение.Организации
	|РегистрСведений.ИзбранныеРегламентированныеОтчеты.Изменение.Организации
	|РегистрСведений.ИмпортТоваровТаможенныйСоюз.Чтение.Организации
	|РегистрСведений.ИмпортТоваровТаможенныйСоюз.Изменение.Организации
	|РегистрСведений.ИПАвансыПокупателей.Чтение.Организации
	|РегистрСведений.ИПАвансыПокупателей.Изменение.Организации
	|РегистрСведений.ИПРасчетНДФЛ.Чтение.Организации
	|РегистрСведений.ИПРасчетНДФЛ.Изменение.Организации
	|РегистрСведений.ИПСведенияОбОплатеОСиНМА.Чтение.Организации
	|РегистрСведений.ИПСведенияОбОплатеОСиНМА.Изменение.Организации
	|РегистрСведений.ИПСтандартныеВычетыНаДетей.Чтение.Организации
	|РегистрСведений.ИПСтандартныеВычетыНаДетей.Изменение.Организации
	|РегистрСведений.ИПСтандартныеВычетыНаНалогоплательщика.Чтение.Организации
	|РегистрСведений.ИПСтандартныеВычетыНаНалогоплательщика.Изменение.Организации
	|РегистрСведений.ИсключенныеОрганизацииОбменаСКО.Чтение.Организации
	|РегистрСведений.ИсключенныеОрганизацииОбменаСКО.Изменение.Организации
	|РегистрСведений.ИспользоватьНесколькоБанковскихСчетовОрганизации.Чтение.Организации
	|РегистрСведений.ИспользоватьНесколькоБанковскихСчетовОрганизации.Изменение.Организации
	|РегистрСведений.ИсторияРегистрацийВНалоговомОргане.Чтение.Организации
	|РегистрСведений.ИсторияРегистрацийВНалоговомОргане.Изменение.Организации
	|РегистрСведений.ИсторияРегистрацийВНалоговомОрганеВторичный.Чтение.Организации
	|РегистрСведений.ИсторияРегистрацийВОрганеПФР.Чтение.Организации
	|РегистрСведений.ИсторияРегистрацийВОрганеПФР.Изменение.Организации
	|РегистрСведений.ИсторияСамостоятельныхКлассификационныхЕдиниц.Чтение.Организации
	|РегистрСведений.ИсторияСамостоятельныхКлассификационныхЕдиниц.Изменение.Организации
	|РегистрСведений.ИсторияСамостоятельныхКлассификационныхЕдиницВторичный.Чтение.Организации
	|РегистрСведений.КадроваяИсторияСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.КадроваяИсторияСотрудников.Чтение.Организации
	|РегистрСведений.КадроваяИсторияСотрудниковИнтервальный.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.КадроваяИсторияСотрудниковИнтервальный.Чтение.Организации
	|РегистрСведений.КалькуляцияРасходовВСчетеНаОплатуПокупателю.Чтение.Организации
	|РегистрСведений.КапитализируемыеРемонтыОС.Чтение.Организации
	|РегистрСведений.КапитализируемыеРемонтыОС.Изменение.Организации
	|РегистрСведений.КассовыеСсылки.Чтение.Организации
	|РегистрСведений.КассовыеСсылки.Изменение.Организации
	|РегистрСведений.КегиНаОборудованииРозливаИСМП.Чтение.Организации
	|РегистрСведений.КегиНаОборудованииРозливаИСМП.Изменение.Организации
	|РегистрСведений.КомпонентыАмортизацииОС.Чтение.Организации
	|РегистрСведений.КомпонентыАмортизацииОС.Изменение.Организации
	|РегистрСведений.КорпоративныеКарты.Чтение.Организации
	|РегистрСведений.КорпоративныеКарты.Изменение.Организации
	|РегистрСведений.КрупнейшийНалогоплательщикИсторияРегистрацийВНалоговомОргане.Чтение.Организации
	|РегистрСведений.ЛимитОстаткаКассыОрганизаций.Чтение.Организации
	|РегистрСведений.ЛимитОстаткаКассыОрганизаций.Изменение.Организации
	|РегистрСведений.ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.Чтение.Организации
	|РегистрСведений.ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.Изменение.Организации
	|РегистрСведений.МероприятияТрудовойДеятельности.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.МероприятияТрудовойДеятельности.Чтение.Организации
	|РегистрСведений.МероприятияТрудовойДеятельностиПрочие.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.МероприятияТрудовойДеятельностиПрочие.Чтение.Организации
	|РегистрСведений.МероприятияТрудовойДеятельностиПрочие.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.МероприятияТрудовойДеятельностиПрочие.Изменение.Организации
	|РегистрСведений.МестаВыплатыЗарплатыСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.МестаВыплатыЗарплатыСотрудников.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.МестонахождениеОСБухгалтерскийУчет.Чтение.Организации
	|РегистрСведений.МестонахождениеОСБухгалтерскийУчет.Изменение.Организации
	|РегистрСведений.МетодыОпределенияПрямыхРасходовПроизводстваВНУ.Чтение.Организации
	|РегистрСведений.МетодыОпределенияПрямыхРасходовПроизводстваВНУ.Изменение.Организации
	|РегистрСведений.НалогиОтчеты.Чтение.Организации
	|РегистрСведений.НалогиОтчеты.Изменение.Организации
	|РегистрСведений.НалоговыеНачисленияАУСН.Чтение.Организации
	|РегистрСведений.НалоговыеНачисленияАУСН.Изменение.Организации
	|РегистрСведений.НастройкаЗаполненияСвободныхСтрокФормСтатистики.Чтение.Организации
	|РегистрСведений.НастройкаЗаполненияСвободныхСтрокФормСтатистики.Изменение.Организации
	|РегистрСведений.НастройкаЗаполненияФормСтатистики.Чтение.Организации
	|РегистрСведений.НастройкаЗаполненияФормСтатистики.Изменение.Организации
	|РегистрСведений.НастройкиВариантаРасчетаКорректировокВВалюте.Чтение.Организации
	|РегистрСведений.НастройкиВариантаРасчетаКорректировокВВалюте.Изменение.Организации
	|РегистрСведений.НастройкиВнутреннегоЭДО.Чтение.Организации
	|РегистрСведений.НастройкиВнутреннегоЭДО.Изменение.Организации
	|РегистрСведений.НастройкиЗарплатаКадры.Чтение.Организации
	|РегистрСведений.НастройкиЗарплатаКадры.Изменение.Организации
	|РегистрСведений.НастройкиИнтеграцииСоСпринтером.Чтение.Организации
	|РегистрСведений.НастройкиИнтеграцииСоСпринтером.Изменение.Организации
	|РегистрСведений.НастройкиИспользованияСтраховыхВзносовПоКлассамУсловийТруда.Чтение.Организации
	|РегистрСведений.НастройкиОбменаЕИС.Чтение.Организации
	|РегистрСведений.НастройкиОбменаЕИС.Изменение.Организации
	|РегистрСведений.НастройкиОбменаМинобороны.Чтение.Организации
	|РегистрСведений.НастройкиОбменаМинобороны.Изменение.Организации
	|РегистрСведений.НастройкиОбменаРПН.Чтение.Организации
	|РегистрСведений.НастройкиОбменаРПН.Изменение.Организации
	|РегистрСведений.НастройкиОбменаРЭЦ.Чтение.Организации
	|РегистрСведений.НастройкиОбменаРЭЦ.Изменение.Организации
	|РегистрСведений.НастройкиОбменаСКлиентомБанка.Чтение.Организации
	|РегистрСведений.НастройкиОбменаСКлиентомБанка.Изменение.Организации
	|РегистрСведений.НастройкиОбменаСУЗ.Чтение.Организации
	|РегистрСведений.НастройкиОбменаСУЗ.Изменение.Организации
	|РегистрСведений.НастройкиОбменаФСРАР.Чтение.Организации
	|РегистрСведений.НастройкиОбменаФСРАР.Изменение.Организации
	|РегистрСведений.НастройкиОбменаФСС.Чтение.Организации
	|РегистрСведений.НастройкиОбменаФСС.Изменение.Организации
	|РегистрСведений.НастройкиОбменаФТС.Чтение.Организации
	|РегистрСведений.НастройкиОбменаФТС.Изменение.Организации
	|РегистрСведений.НастройкиОтправкиОтчетностиВБанк.Чтение.Организации
	|РегистрСведений.НастройкиОтправкиОтчетностиВБанк.Изменение.Организации
	|РегистрСведений.НастройкиОтправкиЭлектронныхДокументов.Чтение.Организации
	|РегистрСведений.НастройкиОтправкиЭлектронныхДокументов.Изменение.Организации
	|РегистрСведений.НастройкиОтправкиЭлектронныхДокументовПоВидам.Чтение.Организации
	|РегистрСведений.НастройкиОтправкиЭлектронныхДокументовПоВидам.Изменение.Организации
	|РегистрСведений.НастройкиПервогоПримененияФСБУ.Чтение.Организации
	|РегистрСведений.НастройкиПервогоПримененияФСБУ.Изменение.Организации
	|РегистрСведений.НастройкиПолученияЭлектронныхДокументов.Чтение.Организации
	|РегистрСведений.НастройкиПолученияЭлектронныхДокументов.Изменение.Организации
	|РегистрСведений.НастройкиПродленияСроковНалоговОтчетов.Чтение.Организации
	|РегистрСведений.НастройкиПродленияСроковНалоговОтчетов.Изменение.Организации
	|РегистрСведений.НастройкиПрямыхВыплатФССОрганизаций.Чтение.Организации
	|РегистрСведений.НастройкиПрямыхВыплатФССОрганизаций.Изменение.Организации
	|РегистрСведений.НастройкиПрямыхВыплатФСССотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.НастройкиПрямыхВыплатФСССотрудников.Чтение.Организации
	|РегистрСведений.НастройкиПрямыхВыплатФСССотрудников.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.НастройкиПрямыхВыплатФСССотрудников.Изменение.Организации
	|РегистрСведений.НастройкиПрямыхВыплатФСССотрудниковПодробности.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.НастройкиПрямыхВыплатФСССотрудниковПодробности.Чтение.Организации
	|РегистрСведений.НастройкиПрямыхВыплатФСССотрудниковПодробности.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.НастройкиПрямыхВыплатФСССотрудниковПодробности.Изменение.Организации
	|РегистрСведений.НастройкиРасчетаНДС.Чтение.Организации
	|РегистрСведений.НастройкиРасчетаНДС.Изменение.Организации
	|РегистрСведений.НастройкиРасчетаРезервовОтпусков.Чтение.Организации
	|РегистрСведений.НастройкиСистемыНалогообложения.Чтение.Организации
	|РегистрСведений.НастройкиСистемыНалогообложения.Изменение.Организации
	|РегистрСведений.НастройкиУчетаЗарплаты.Чтение.Организации
	|РегистрСведений.НастройкиУчетаЗарплаты.Изменение.Организации
	|РегистрСведений.НастройкиУчетаНалогаНаПрибыль.Чтение.Организации
	|РегистрСведений.НастройкиУчетаНалогаНаПрибыль.Изменение.Организации
	|РегистрСведений.НастройкиУчетаНалогаНаПрибыльГруппОбособленныхПодразделений.Чтение.Организации
	|РегистрСведений.НастройкиУчетаНалогаНаПрибыльГруппОбособленныхПодразделений.Изменение.Организации
	|РегистрСведений.НастройкиУчетаНалогаНаПрибыльПостоянные.Чтение.Организации
	|РегистрСведений.НастройкиУчетаНалогаНаПрибыльПостоянные.Изменение.Организации
	|РегистрСведений.НастройкиУчетаНДС.Чтение.Организации
	|РегистрСведений.НастройкиУчетаНДС.Изменение.Организации
	|РегистрСведений.НастройкиУчетаНДФЛ.Чтение.Организации
	|РегистрСведений.НастройкиУчетаНДФЛ.Изменение.Организации
	|РегистрСведений.НастройкиУчетаПособийСоциальногоСтрахования.Чтение.Организации
	|РегистрСведений.НастройкиУчетаСтраховыхВзносов.Чтение.Организации
	|РегистрСведений.НастройкиУчетаСтраховыхВзносов.Изменение.Организации
	|РегистрСведений.НастройкиУчетаСтраховыхВзносовИП.Чтение.Организации
	|РегистрСведений.НастройкиУчетаСтраховыхВзносовИП.Изменение.Организации
	|РегистрСведений.НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.Чтение.Организации
	|РегистрСведений.НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.Изменение.Организации
	|РегистрСведений.НастройкиУчетаУСН.Чтение.Организации
	|РегистрСведений.НастройкиУчетаУСН.Изменение.Организации
	|РегистрСведений.НачислениеАмортизацииНМАСпециальныйКоэффициентНалоговыйУчет.Чтение.Организации
	|РегистрСведений.НачислениеАмортизацииНМАСпециальныйКоэффициентНалоговыйУчет.Изменение.Организации
	|РегистрСведений.НачислениеАмортизацииОСБухгалтерскийУчет.Чтение.Организации
	|РегистрСведений.НачислениеАмортизацииОСБухгалтерскийУчет.Изменение.Организации
	|РегистрСведений.НачислениеАмортизацииОСНалоговыйУчет.Чтение.Организации
	|РегистрСведений.НачислениеАмортизацииОСНалоговыйУчет.Изменение.Организации
	|РегистрСведений.НачислениеАмортизацииОССпециальныйКоэффициентНалоговыйУчет.Чтение.Организации
	|РегистрСведений.НачислениеАмортизацииОССпециальныйКоэффициентНалоговыйУчет.Изменение.Организации
	|РегистрСведений.НМАПриПереходеНаФСБУ14.Чтение.Организации
	|РегистрСведений.НМАПриПереходеНаФСБУ14.Изменение.Организации
	|РегистрСведений.НоменклатураДокументовОФД.Чтение.Организации
	|РегистрСведений.НоменклатураДокументовОФД.Изменение.Организации
	|РегистрСведений.НоменклатурныеГруппыРеализацииПродукцииУслуг.Чтение.Организации
	|РегистрСведений.НоменклатурныеГруппыРеализацииПродукцииУслуг.Изменение.Организации
	|РегистрСведений.НомераЛистовКассовойКниги.Чтение.Организации
	|РегистрСведений.НомераЛистовКассовойКниги.Изменение.Организации
	|РегистрСведений.НумераторПачекПФР.Чтение.Организации
	|РегистрСведений.НумераторПачекПФР.Изменение.Организации
	|РегистрСведений.ОборудованиеПоОрганизациям.Чтение.Организации
	|РегистрСведений.ОборудованиеПоОрганизациям.Изменение.Организации
	|РегистрСведений.ОбъектыСтроительстваОрганизаций.Чтение.Организации
	|РегистрСведений.ОбъектыСтроительстваОрганизаций.Изменение.Организации
	|РегистрСведений.ОбъектыУчетаДокументовЭДО.Чтение.Организации
	|РегистрСведений.ОбъектыУчетаДокументовЭДО.Изменение.Организации
	|РегистрСведений.ОперацииСПрослеживаемымиТоварами.Чтение.Организации
	|РегистрСведений.ОперацииСПрослеживаемымиТоварами.Изменение.Организации
	|РегистрСведений.ОплатаВедомостейНаВыплатуЗарплаты.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ОплатаВедомостейНаВыплатуЗарплаты.Чтение.Организации
	|РегистрСведений.ОплаченныеДоговоры.Чтение.Организации
	|РегистрСведений.ОснованияПолномочийОтветственныхЛиц.Чтение.Организации
	|РегистрСведений.ОснованияПолномочийОтветственныхЛиц.Изменение.Организации
	|РегистрСведений.ОсновныеВариантыПеречисленияСотруднику.Чтение.Организации
	|РегистрСведений.ОсновныеВариантыПеречисленияСотруднику.Изменение.Организации
	|РегистрСведений.ОсновныеДоговорыКонтрагента.Чтение.Организации
	|РегистрСведений.ОсновныеДоговорыКонтрагента.Изменение.Организации
	|РегистрСведений.ОсновныеСотрудникиФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ОсновныеСотрудникиФизическихЛиц.Чтение.Организации
	|РегистрСведений.ОтветственныеЛицаОрганизаций.Чтение.Организации
	|РегистрСведений.ОтветственныеЛицаОрганизаций.Изменение.Организации
	|РегистрСведений.ОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИП.Чтение.Организации
	|РегистрСведений.ОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИП.Изменение.Организации
	|РегистрСведений.ОтветыНаЗапросыИОН.Чтение.Организации
	|РегистрСведений.ОтветыНаЗапросыИОН.Изменение.Организации
	|РегистрСведений.ОтветыНаЗапросыИОС.Чтение.Организации
	|РегистрСведений.ОтветыНаЗапросыИОС.Изменение.Организации
	|РегистрСведений.ОтложенноеОткрытиеЛицевыхСчетовСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ОтложенноеОткрытиеЛицевыхСчетовСотрудников.Чтение.Организации
	|РегистрСведений.ОтложенноеОткрытиеЛицевыхСчетовСотрудников.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ОтложенноеОткрытиеЛицевыхСчетовСотрудников.Изменение.Организации
	|РегистрСведений.ОтражениеВРегламентированномУчетеНастройкиОрганизаций.Чтение.Организации
	|РегистрСведений.ОтражениеВРегламентированномУчетеНастройкиОрганизаций.Изменение.Организации
	|РегистрСведений.ОтчетностьСНарушеннымСрокомПодачи.Чтение.Организации
	|РегистрСведений.ОтчетностьСНарушеннымСрокомПодачи.Изменение.Организации
	|РегистрСведений.ОтчетыПереданныеВСПАРК.Чтение.Организации
	|РегистрСведений.ОтчетыПереданныеВСПАРК.Изменение.Организации
	|РегистрСведений.ОтчитывающиесяПоВзносамОрганизации.Чтение.Организации
	|РегистрСведений.ОчередьОбработкиКадровыхДанныхФСС.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ОчередьОбработкиКадровыхДанныхФСС.Чтение.Организации
	|РегистрСведений.ОчередьОбработкиКадровыхДанныхФСС.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ОчередьОбработкиКадровыхДанныхФСС.Изменение.Организации
	|РегистрСведений.ОчередьСообщенийЗЕРНО.Чтение.Организации
	|РегистрСведений.ОчередьСообщенийИСМП.Чтение.Организации
	|РегистрСведений.ОчередьЧековККТ.Чтение.Организации
	|РегистрСведений.ОчередьЧековККТ.Изменение.Организации
	|РегистрСведений.ОшибочныеРеквизитыКонтрагентов.Чтение.Организации
	|РегистрСведений.ОшибочныеРеквизитыКонтрагентов.Изменение.Организации
	|РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет.Чтение.Организации
	|РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет.Изменение.Организации
	|РегистрСведений.ПараметрыАмортизацииОСНалоговыйУчет.Чтение.Организации
	|РегистрСведений.ПараметрыАмортизацииОСНалоговыйУчет.Изменение.Организации
	|РегистрСведений.ПараметрыНДСПоДоговорам.Чтение.Организации
	|РегистрСведений.ПараметрыНДСПоДоговорам.Изменение.Организации
	|РегистрСведений.ПараметрыТорговыхТочек.Чтение.Организации
	|РегистрСведений.ПараметрыТорговыхТочек.Изменение.Организации
	|РегистрСведений.ПерваяОтчетнаяКампания.Чтение.Организации
	|РегистрСведений.ПерваяОтчетнаяКампания.Изменение.Организации
	|РегистрСведений.ПервоначальныеСведенияНМАБухгалтерскийУчет.Чтение.Организации
	|РегистрСведений.ПервоначальныеСведенияНМАБухгалтерскийУчет.Изменение.Организации
	|РегистрСведений.ПервоначальныеСведенияНМАНалоговыйУчет.Чтение.Организации
	|РегистрСведений.ПервоначальныеСведенияНМАНалоговыйУчет.Изменение.Организации
	|РегистрСведений.ПервоначальныеСведенияНМАНалоговыйУчетУСН.Чтение.Организации
	|РегистрСведений.ПервоначальныеСведенияНМАНалоговыйУчетУСН.Изменение.Организации
	|РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.Чтение.Организации
	|РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.Изменение.Организации
	|РегистрСведений.ПервоначальныеСведенияОСНалоговыйУчет.Чтение.Организации
	|РегистрСведений.ПервоначальныеСведенияОСНалоговыйУчет.Изменение.Организации
	|РегистрСведений.ПервоначальныеСведенияОСНалоговыйУчетУСН.Чтение.Организации
	|РегистрСведений.ПервоначальныеСведенияОСНалоговыйУчетУСН.Изменение.Организации
	|РегистрСведений.ПериодыДействияДоговоровГражданскоПравовогоХарактера.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПериодыДействияДоговоровГражданскоПравовогоХарактера.Чтение.Организации
	|РегистрСведений.ПериодыОбновленияДанныхЕНС.Чтение.Организации
	|РегистрСведений.ПериодыОбновленияДанныхЕНС.Изменение.Организации
	|РегистрСведений.ПлановыеАвансы.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПлановыеАвансы.Чтение.Организации
	|РегистрСведений.ПлановыеАвансыИнтервальный.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПлановыеАвансыИнтервальный.Чтение.Организации
	|РегистрСведений.ПлановыеНачисления.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПлановыеНачисления.Чтение.Организации
	|РегистрСведений.ПлановыеНачисленияИнтервальный.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПлановыеНачисленияИнтервальный.Чтение.Организации
	|РегистрСведений.ПлановыеНачисленияПоДоговорам.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПлановыеНачисленияПоДоговорам.Чтение.Организации
	|РегистрСведений.ПлановыеУдержания.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПлановыеУдержания.Чтение.Организации
	|РегистрСведений.ПодразделенияЗаПределамиРФ.Чтение.Организации
	|РегистрСведений.ПодразделенияЗаПределамиРФ.Изменение.Организации
	|РегистрСведений.ПолучателиПлатежаЗарплатногоПроекта.Чтение.Организации
	|РегистрСведений.ПолучателиПлатежаЗарплатногоПроекта.Изменение.Организации
	|РегистрСведений.ПорядокЗакрытияПодразделенийОрганизаций.Чтение.Организации
	|РегистрСведений.ПорядокЗакрытияПодразделенийОрганизаций.Изменение.Организации
	|РегистрСведений.ПорядокУплатыАкцизов.Чтение.Организации
	|РегистрСведений.ПорядокУплатыАкцизов.Изменение.Организации
	|РегистрСведений.ПорядокУплатыНалоговНаМестах.Чтение.Организации
	|РегистрСведений.ПорядокУплатыНалоговНаМестах.Изменение.Организации
	|РегистрСведений.ПорядокУплатыНалоговПоРегионам.Чтение.Организации
	|РегистрСведений.ПорядокУплатыНалоговПоРегионам.Изменение.Организации
	|РегистрСведений.ПриглашенияКОбменуЭлектроннымиДокументами.Чтение.Организации
	|РегистрСведений.ПриглашенияКОбменуЭлектроннымиДокументами.Изменение.Организации
	|РегистрСведений.ПрименениеСтандартныхВычетовПоНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПрименениеСтандартныхВычетовПоНДФЛВторичный.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПримененныеСтавкиОтложенногоНалога.Чтение.Организации
	|РегистрСведений.ПримененныеСтавкиОтложенногоНалога.Изменение.Организации
	|РегистрСведений.ПроверенныеДокументы.Чтение.Организации
	|РегистрСведений.ПроверенныеДокументы.Изменение.Организации
	|РегистрСведений.ПроверкиЭлектронныхПодписейЭДО.Чтение.Организации
	|РегистрСведений.ПроверкиЭлектронныхПодписейЭДО.Изменение.Организации
	|РегистрСведений.ПрофессииФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПрофессииФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ПроцентЕНВДДляУчетаЗатратНаЗарплату.Чтение.Организации
	|РегистрСведений.ПроцентЕНВДДляУчетаЗатратНаЗарплату.Изменение.Организации
	|РегистрСведений.ПулКодовМаркировкиСУЗ.Чтение.Организации
	|РегистрСведений.РасходыНаОнлайнКассыУменьшающиеНалогПСН.Чтение.Организации
	|РегистрСведений.РасходыНаОнлайнКассыУменьшающиеНалогПСН.Изменение.Организации
	|РегистрСведений.РасчетАмортизации.Чтение.Организации
	|РегистрСведений.РасчетАмортизации.Изменение.Организации
	|РегистрСведений.РасчетАмортизацииГрупповыхОбъектовОС.Чтение.Организации
	|РегистрСведений.РасчетАмортизацииГрупповыхОбъектовОС.Изменение.Организации
	|РегистрСведений.РасчетБазыНормированияПоДоговорамСтрахования.Чтение.Организации
	|РегистрСведений.РасчетБазыНормированияПоДоговорамСтрахования.Изменение.Организации
	|РегистрСведений.РасчетБазыРаспределенияЗатратЭквивалентныеЕдиницы.Чтение.Организации
	|РегистрСведений.РасчетБазыРаспределенияЗатратЭквивалентныеЕдиницы.Изменение.Организации
	|РегистрСведений.РасчетДолейБазыНалогаНаПрибыль.Чтение.Организации
	|РегистрСведений.РасчетДолейБазыНалогаНаПрибыль.Изменение.Организации
	|РегистрСведений.РасчетЗемельногоНалога.Чтение.Организации
	|РегистрСведений.РасчетЗемельногоНалога.Изменение.Организации
	|РегистрСведений.РасчетЗемельногоНалогаДо2020.Чтение.Организации
	|РегистрСведений.РасчетЗемельногоНалогаДо2020.Изменение.Организации
	|РегистрСведений.РасчетНалогаАУСН.Чтение.Организации
	|РегистрСведений.РасчетНалогаАУСН.Изменение.Организации
	|РегистрСведений.РасчетНалогаНаИмущество.Чтение.Организации
	|РегистрСведений.РасчетНалогаНаИмущество.Изменение.Организации
	|РегистрСведений.РасчетНалогаНаИмуществоПоКадастровойСтоимости.Чтение.Организации
	|РегистрСведений.РасчетНалогаНаИмуществоПоКадастровойСтоимости.Изменение.Организации
	|РегистрСведений.РасчетНалогаНаИмуществоПоСреднегодовойСтоимости.Чтение.Организации
	|РегистрСведений.РасчетНалогаНаИмуществоПоСреднегодовойСтоимости.Изменение.Организации
	|РегистрСведений.РасчетНалогаУСН.Чтение.Организации
	|РегистрСведений.РасчетНалогаУСН.Изменение.Организации
	|РегистрСведений.РасчетНачальногоСальдоПрямыхЗатрат.Чтение.Организации
	|РегистрСведений.РасчетНачальногоСальдоПрямыхЗатрат.Изменение.Организации
	|РегистрСведений.РасчетНачисленияНалоговНаЕНС.Чтение.Организации
	|РегистрСведений.РасчетНачисленияНалоговНаЕНС.Изменение.Организации
	|РегистрСведений.РасчетНачисленияПроцентныхРасходов.Чтение.Организации
	|РегистрСведений.РасчетНачисленияПроцентныхРасходов.Изменение.Организации
	|РегистрСведений.РасчетНормированияРасходов.Чтение.Организации
	|РегистрСведений.РасчетНормированияРасходов.Изменение.Организации
	|РегистрСведений.РасчетныеЛисткиКабинетСотрудника.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.РасчетныеЛисткиКабинетСотрудника.Чтение.Организации
	|РегистрСведений.РасчетОбесцененияЗапасов.Чтение.Организации
	|РегистрСведений.РасчетОтложенногоНалога.Чтение.Организации
	|РегистрСведений.РасчетОтложенногоНалога.Изменение.Организации
	|РегистрСведений.РасчетПереоценкиВалютныхСредств.Чтение.Организации
	|РегистрСведений.РасчетПереоценкиВалютныхСредств.Изменение.Организации
	|РегистрСведений.РасчетПереходНаФСБУ6.Чтение.Организации
	|РегистрСведений.РасчетПереходНаФСБУ6.Изменение.Организации
	|РегистрСведений.РасчетПоказателейОтложенногоНалога.Чтение.Организации
	|РегистрСведений.РасчетПоказателейОтложенногоНалога.Изменение.Организации
	|РегистрСведений.РасчетПорядкаПеределов.Чтение.Организации
	|РегистрСведений.РасчетПорядкаПеределов.Изменение.Организации
	|РегистрСведений.РасчетРазницВОценкеАктивовИОбязательств.Чтение.Организации
	|РегистрСведений.РасчетРазницВОценкеАктивовИОбязательств.Изменение.Организации
	|РегистрСведений.РасчетРаспределенияКосвенныхРасходов.Чтение.Организации
	|РегистрСведений.РасчетРаспределенияКосвенныхРасходов.Изменение.Организации
	|РегистрСведений.РасчетРасходаМатериаловПоДаннымПродаж.Чтение.Организации
	|РегистрСведений.РасчетРасходовПоАренде.Чтение.Организации
	|РегистрСведений.РасчетРасходовПоАренде.Изменение.Организации
	|РегистрСведений.РасчетРеализацииОтложенныхКурсовыхРазниц.Чтение.Организации
	|РегистрСведений.РасчетРеализацииОтложенныхКурсовыхРазниц.Изменение.Организации
	|РегистрСведений.РасчетРезерваОтпусков.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.РасчетРезервовПоСомнительнымДолгам.Чтение.Организации
	|РегистрСведений.РасчетРезервовПоСомнительнымДолгам.Изменение.Организации
	|РегистрСведений.РасчетРесурсаВнеоборотныхАктивов.Чтение.Организации
	|РегистрСведений.РасчетРесурсаВнеоборотныхАктивов.Изменение.Организации
	|РегистрСведений.РасчетСебестоимостиПродукции.Чтение.Организации
	|РегистрСведений.РасчетСебестоимостиПродукции.Изменение.Организации
	|РегистрСведений.РасчетСписанияКосвенныхРасходов.Чтение.Организации
	|РегистрСведений.РасчетСписанияКосвенныхРасходов.Изменение.Организации
	|РегистрСведений.РасчетСписанияРБП.Чтение.Организации
	|РегистрСведений.РасчетСписанияРБП.Изменение.Организации
	|РегистрСведений.РасчетСтавкиНалогаНаПрибыльЗаМесяц.Чтение.Организации
	|РегистрСведений.РасчетСтавкиНалогаНаПрибыльЗаМесяц.Изменение.Организации
	|РегистрСведений.РасчетСтоимостиКомпонентовАмортизации.Чтение.Организации
	|РегистрСведений.РасчетСтоимостиКомпонентовАмортизации.Изменение.Организации
	|РегистрСведений.РасчетСтоимостиНалоговыхАктивовИОбязательств.Чтение.Организации
	|РегистрСведений.РасчетСтоимостиНалоговыхАктивовИОбязательств.Изменение.Организации
	|РегистрСведений.РасчетСтоимостиНалоговыхАктивовИОбязательствПослеИзмененияСтавкиНалогаНаПрибыль.Чтение.Организации
	|РегистрСведений.РасчетСтоимостиНалоговыхАктивовИОбязательствПослеИзмененияСтавкиНалогаНаПрибыль.Изменение.Организации
	|РегистрСведений.РасчетСтоимостиОставшихсяМатериаловПриСписанииОС.Чтение.Организации
	|РегистрСведений.РасчетТорговогоСбора.Чтение.Организации
	|РегистрСведений.РасчетТорговогоСбора.Изменение.Организации
	|РегистрСведений.РасчетТорговойНаценкиАТТ.Чтение.Организации
	|РегистрСведений.РасчетТорговойНаценкиАТТ.Изменение.Организации
	|РегистрСведений.РасчетТорговойНаценкиНТТ.Чтение.Организации
	|РегистрСведений.РасчетТорговойНаценкиНТТ.Изменение.Организации
	|РегистрСведений.РасчетТранспортногоНалога.Чтение.Организации
	|РегистрСведений.РасчетТранспортногоНалога.Изменение.Организации
	|РегистрСведений.РасчетыСКонтрагентамиОтложенноеПроведение.Чтение.Организации
	|РегистрСведений.РасчетыСКонтрагентамиОтложенноеПроведение.Изменение.Организации
	|РегистрСведений.РасчетЭффектаИзмененияСтавокНалогаНаПрибыль.Чтение.Организации
	|РегистрСведений.РасчетЭффектаИзмененияСтавокНалогаНаПрибыль.Изменение.Организации
	|РегистрСведений.РасшифровкаКУДиР.Чтение.Организации
	|РегистрСведений.РасшифровкаКУДиР.Изменение.Организации
	|РегистрСведений.РегиональныеОсобенностиЕНВД.Чтение.Организации
	|РегистрСведений.РегиональныеОсобенностиЕНВД.Изменение.Организации
	|РегистрСведений.РегистрацииЗапросовСреднегоЗаработкаСЭДО.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.РегистрацииЗапросовСреднегоЗаработкаСЭДО.Чтение.Организации
	|РегистрСведений.РегистрацииЗапросовСреднегоЗаработкаСЭДО.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.РегистрацииЗапросовСреднегоЗаработкаСЭДО.Изменение.Организации
	|РегистрСведений.РегистрацииИсходящихСообщенийОСтраховыхСлучаяхФСС.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.РегистрацииИсходящихСообщенийОСтраховыхСлучаяхФСС.Чтение.Организации
	|РегистрСведений.РегистрацииИсходящихСообщенийОСтраховыхСлучаяхФСС.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.РегистрацииИсходящихСообщенийОСтраховыхСлучаяхФСС.Изменение.Организации
	|РегистрСведений.РегистрацииОтветовНаЗапросыФССДляРасчетаПособий.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.РегистрацииОтветовНаЗапросыФССДляРасчетаПособий.Чтение.Организации
	|РегистрСведений.РегистрацииОтветовНаЗапросыФССДляРасчетаПособий.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.РегистрацииОтветовНаЗапросыФССДляРасчетаПособий.Изменение.Организации
	|РегистрСведений.РегистрацииУведомленийОПрекращенииОтпускаПоУходуЗаРебенком.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.РегистрацииУведомленийОПрекращенииОтпускаПоУходуЗаРебенком.Чтение.Организации
	|РегистрСведений.РегистрацииУведомленийОПрекращенииОтпускаПоУходуЗаРебенком.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.РегистрацииУведомленийОПрекращенииОтпускаПоУходуЗаРебенком.Изменение.Организации
	|РегистрСведений.РегистрацияЗемельныхУчастков.Чтение.Организации
	|РегистрСведений.РегистрацияЗемельныхУчастков.Изменение.Организации
	|РегистрСведений.РегистрацияПрослеживаемыхТоваров.Чтение.Организации
	|РегистрСведений.РегистрацияПрослеживаемыхТоваров.Изменение.Организации
	|РегистрСведений.РегистрацияТранспортныхСредств.Чтение.Организации
	|РегистрСведений.РегистрацияТранспортныхСредств.Изменение.Организации
	|РегистрСведений.РегулярныеПлатежи.Чтение.Организации
	|РегистрСведений.РегулярныеПлатежи.Изменение.Организации
	|РегистрСведений.РегулярныеСчетаПокупателям.Чтение.Организации
	|РегистрСведений.РегулярныеСчетаПокупателям.Изменение.Организации
	|РегистрСведений.РеестрЭПД.Чтение.Организации
	|РегистрСведений.РеестрЭПД.Изменение.Организации
	|РегистрСведений.РезультатыПроверкиНалоговОтчетовПрошлыхПериодов.Чтение.Организации
	|РегистрСведений.РезультатыПроверкиНалоговОтчетовПрошлыхПериодов.Изменение.Организации
	|РегистрСведений.РезультатыПубликацииДокументовКЭДО.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.РезультатыПубликацииДокументовКЭДО.Чтение.Организации
	|РегистрСведений.РеквизитыПеречисленийПоИсполнительнымЛистам.Чтение.Организации
	|РегистрСведений.РеквизитыПеречисленийПоИсполнительнымЛистам.Изменение.Организации
	|РегистрСведений.РеквизитыУплатыНалоговИПлатежейВБюджет.Чтение.Организации
	|РегистрСведений.РеквизитыУплатыНалоговИПлатежейВБюджет.Изменение.Организации
	|РегистрСведений.РолиСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.РолиСотрудников.Чтение.Организации
	|РегистрСведений.РолиСотрудников.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.РолиСотрудников.Изменение.Организации
	|РегистрСведений.РублевыеСуммыДокументовВВалюте.Чтение.Организации
	|РегистрСведений.РублевыеСуммыДокументовВВалюте.Изменение.Организации
	|РегистрСведений.СведенияДекларацийНаТовары.Чтение.Организации
	|РегистрСведений.СведенияДекларацийНаТовары.Изменение.Организации
	|РегистрСведений.СведенияОбИнвалидностиФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СведенияОбИнвалидностиФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СведенияОбОрганизацииДляКонтролируемыхСделок.Чтение.Организации
	|РегистрСведений.СведенияОбОрганизацииДляКонтролируемыхСделок.Изменение.Организации
	|РегистрСведений.СведенияОбЭЛН.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СведенияОбЭЛН.Чтение.Организации
	|РегистрСведений.СведенияОбЭЛН.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СведенияОбЭЛН.Изменение.Организации
	|РегистрСведений.СведенияОВзносахВПФР.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СведенияОВзносахВПФР.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоЖурнал.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоЖурнал.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоЛицензии.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоЛицензии.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил11Раздел1.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил11Раздел1.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил11Раздел2.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил11Раздел2.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил12Раздел1.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил12Раздел1.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил12Раздел2.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил12Раздел2.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил13Декларация.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил13Декларация.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил14Декларация.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил14Декларация.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил15Поставщики.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил15Поставщики.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил15Производство.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил15Производство.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил16Декларация.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил16Декларация.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил17Декларация.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил17Декларация.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил18Декларация.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил18Декларация.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил19Декларация.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил19Декларация.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил20Декларация.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил20Декларация.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил21Раздел1Поставки.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил21Раздел1Поставки.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил21Раздел2Возвраты.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил21Раздел2Возвраты.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил22Раздел1Поступления.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил22Раздел1Поступления.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил22Раздел2Возвраты.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил22Раздел2Возвраты.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил23Декларация.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил23Декларация.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил24Декларация.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил24Декларация.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил25Раздел1Обороты.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил25Раздел1Обороты.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил25Раздел2Поступления.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил25Раздел2Поступления.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил25Раздел3Возвраты.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил25Раздел3Возвраты.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил26Раздел1Обороты.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил26Раздел1Обороты.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил26Раздел2Поступления.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил26Раздел2Поступления.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил26Раздел3Возвраты.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил26Раздел3Возвраты.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил27Декларация.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил27Декларация.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил28Декларация.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил28Декларация.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил29Поставщики.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил29Поставщики.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил29Производство.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил29Производство.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил30Декларация.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил30Декларация.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил31Декларация.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил31Декларация.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил32Декларация.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил32Декларация.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил33Декларация.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил33Декларация.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил34Декларация.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил34Декларация.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил35Декларация.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил35Декларация.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил36Раздел1Поставки.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил36Раздел1Поставки.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил36Раздел2Возвраты.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил36Раздел2Возвраты.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил37Раздел1Поступления.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил37Раздел1Поступления.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил37Раздел2Возвраты.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил37Раздел2Возвраты.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил38Декларация.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил38Декларация.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил39Раздел1Обороты.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил39Раздел1Обороты.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил39Раздел2Поступления.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил39Раздел2Поступления.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил39Раздел3Возвраты.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил39Раздел3Возвраты.Изменение.Организации
	|РегистрСведений.СведенияТаможенныхДекларацийЭкспорт.Чтение.Организации
	|РегистрСведений.СведенияТаможенныхДекларацийЭкспорт.Изменение.Организации
	|РегистрСведений.СвойстваРНПТ.Чтение.Организации
	|РегистрСведений.СвойстваРНПТ.Изменение.Организации
	|РегистрСведений.СвойстваТранзакцийОбменаСБанками.Чтение.Организации
	|РегистрСведений.СвойстваТранзакцийОбменаСБанками.Изменение.Организации
	|РегистрСведений.СвязанныеОбъектыРаспознаниеДокументов.Чтение.Организации
	|РегистрСведений.СвязанныеОбъектыРаспознаниеДокументов.Изменение.Организации
	|РегистрСведений.СервисСверкиРасчетовДанныеСервиса.Чтение.Организации
	|РегистрСведений.СервисСверкиРасчетовДанныеСервиса.Изменение.Организации
	|РегистрСведений.СервисСверкиРасчетовОбнаруженныеРасхождения.Чтение.Организации
	|РегистрСведений.СервисСверкиРасчетовОбнаруженныеРасхождения.Изменение.Организации
	|РегистрСведений.СервисСверкиРасчетовРеестрДокументов.Чтение.Организации
	|РегистрСведений.СервисСверкиРасчетовРеестрДокументов.Изменение.Организации
	|РегистрСведений.СертификатыОрганизацийДляОбменаСБанками.Чтение.Организации
	|РегистрСведений.СертификатыОрганизацийДляОбменаСБанками.Изменение.Организации
	|РегистрСведений.СинхронизацияДанныхИСМП.Чтение.Организации
	|РегистрСведений.СНИЛСВходящихСообщенийСЭДО.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СНИЛСВходящихСообщенийСЭДО.Чтение.Организации
	|РегистрСведений.СНИЛСВходящихСообщенийСЭДО.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СНИЛСВходящихСообщенийСЭДО.Изменение.Организации
	|РегистрСведений.СобытияКалендаряБухгалтера.Чтение.Организации
	|РегистрСведений.СобытияКалендаряБухгалтера.Изменение.Организации
	|РегистрСведений.СобытияОСОрганизаций.Чтение.Организации
	|РегистрСведений.СобытияОСОрганизаций.Изменение.Организации
	|РегистрСведений.СогласияНаОбработкуПерсональныхДанных.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СогласияНаОбработкуПерсональныхДанных.Чтение.Организации
	|РегистрСведений.СообщенияСРасчетомИмущественныхНалогов.Чтение.Организации
	|РегистрСведений.СообщенияСРасчетомИмущественныхНалогов.Изменение.Организации
	|РегистрСведений.СоответствиеНастроекИнтеграции.Чтение.Организации
	|РегистрСведений.СоответствиеНастроекИнтеграции.Изменение.Организации
	|РегистрСведений.СоответствиеСкладовТорговымТочкам.Чтение.Организации
	|РегистрСведений.СоответствиеСкладовТорговымТочкам.Изменение.Организации
	|РегистрСведений.СостояниеЗаявокНаКредит.Чтение.Организации
	|РегистрСведений.СостояниеЗаявокНаКредит.Изменение.Организации
	|РегистрСведений.СостояниеЗаявокНаОткрытиеСчета.Чтение.Организации
	|РегистрСведений.СостояниеЗаявокНаОткрытиеСчета.Изменение.Организации
	|РегистрСведений.СостояниеНастройкиЗаполненияФормСтатистики.Чтение.Организации
	|РегистрСведений.СостояниеПодключенияКЭДОсПФР.Чтение.Организации
	|РегистрСведений.СостояниеПодключенияКЭДОсПФР.Изменение.Организации
	|РегистрСведений.СостоянияВБракеФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СостоянияВБракеФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СостоянияВыгрузкиНоменклатуры.Чтение.Организации
	|РегистрСведений.СостоянияВыгрузкиНоменклатуры.Изменение.Организации
	|РегистрСведений.СостоянияДокументовЗачисленияЗарплаты.Чтение.Организации
	|РегистрСведений.СостоянияДокументовЗачисленияЗарплаты.Изменение.Организации
	|РегистрСведений.СостоянияДокументовКЭДО.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СостоянияДокументовКЭДО.Чтение.Организации
	|РегистрСведений.СостоянияДокументовОткрытияЛицевыхСчетов.Чтение.Организации
	|РегистрСведений.СостоянияДокументовОткрытияЛицевыхСчетов.Изменение.Организации
	|РегистрСведений.СостоянияДокументовЭДО.Чтение.Организации
	|РегистрСведений.СостоянияДокументовЭДО.Изменение.Организации
	|РегистрСведений.СостоянияИнтеграцииАУСН.Чтение.Организации
	|РегистрСведений.СостоянияИнтеграцииАУСН.Изменение.Организации
	|РегистрСведений.СостоянияИнтеграцииСПлатформойСамозанятые.Чтение.Организации
	|РегистрСведений.СостоянияНМАОрганизаций.Чтение.Организации
	|РегистрСведений.СостоянияНМАОрганизаций.Изменение.Организации
	|РегистрСведений.СостоянияОбновленияЕНС.Чтение.Организации
	|РегистрСведений.СостоянияОбновленияЕНС.Изменение.Организации
	|РегистрСведений.СостоянияОСОрганизаций.Чтение.Организации
	|РегистрСведений.СостоянияОСОрганизаций.Изменение.Организации
	|РегистрСведений.СостоянияПодключенияЕНС.Чтение.Организации
	|РегистрСведений.СостоянияПодключенияЕНС.Изменение.Организации
	|РегистрСведений.СостоянияПоОбъектамУчетаЭДО.Чтение.Организации
	|РегистрСведений.СостоянияПоОбъектамУчетаЭДО.Изменение.Организации
	|РегистрСведений.СпециальностиФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СпециальностиФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СпособПереходаНаФСБУ14.Чтение.Организации
	|РегистрСведений.СпособПереходаНаФСБУ14.Изменение.Организации
	|РегистрСведений.СпособыАмортизацииГрупповыхОбъектовОС.Чтение.Организации
	|РегистрСведений.СпособыАмортизацииГрупповыхОбъектовОС.Изменение.Организации
	|РегистрСведений.СпособыОтраженияРасходовПоАмортизацииНМАБухгалтерскийУчет.Чтение.Организации
	|РегистрСведений.СпособыОтраженияРасходовПоАмортизацииНМАБухгалтерскийУчет.Изменение.Организации
	|РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.Чтение.Организации
	|РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.Изменение.Организации
	|РегистрСведений.СпособыОтраженияРасходовПоАренднымПлатежамОСНалоговыйУчет.Чтение.Организации
	|РегистрСведений.СпособыОтраженияРасходовПоАренднымПлатежамОСНалоговыйУчет.Изменение.Организации
	|РегистрСведений.СпособыОтраженияРасходовПоНалогам.Чтение.Организации
	|РегистрСведений.СпособыОтраженияРасходовПоНалогам.Изменение.Организации
	|РегистрСведений.СредняяЧисленностьРаботниковОрганизаций.Чтение.Организации
	|РегистрСведений.СредняяЧисленностьРаботниковОрганизаций.Изменение.Организации
	|РегистрСведений.СрокиХраненияПерсональныхДанных.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.Чтение.Организации
	|РегистрСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.Изменение.Организации
	|РегистрСведений.СтавкиНалогаНаИмущество.Чтение.Организации
	|РегистрСведений.СтавкиНалогаНаИмущество.Изменение.Организации
	|РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.Чтение.Организации
	|РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.Изменение.Организации
	|РегистрСведений.СтавкиНалогаНаПрибыльВБюджетСубъектовРФ.Чтение.Организации
	|РегистрСведений.СтавкиНалогаНаПрибыльВБюджетСубъектовРФ.Изменение.Организации
	|РегистрСведений.СтандартныеВычетыНаДетейНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СтандартныеВычетыПоНДФЛВторичный.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СтандартныеВычетыФизическихЛицНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СтатусФизическихЛицКакНалогоплательщиковНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СтатусФизическихЛицКакНалогоплательщиковНДФЛ.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СтатусФизическихЛицКакНалогоплательщиковНДФЛВторичный.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СтатусыЗапросовРеестровСчетовФактур.Чтение.Организации
	|РегистрСведений.СтатусыЗапросовРеестровСчетовФактур.Изменение.Организации
	|РегистрСведений.СтатусыЗастрахованныхФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СтатусыЗастрахованныхФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СтатусыОнлайнОплат.Чтение.Организации
	|РегистрСведений.СтатусыОнлайнОплат.Изменение.Организации
	|РегистрСведений.СтатусыОтправки.Чтение.Организации
	|РегистрСведений.СтатусыОтправки.Изменение.Организации
	|РегистрСведений.СтоимостьОбязательстваПоАренде.Чтение.Организации
	|РегистрСведений.СтоимостьОбязательстваПоАренде.Изменение.Организации
	|РегистрСведений.СтроковыеСведенияФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СтроковыеСведенияФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СтруктураСтоимостиЗапасов.Чтение.Организации
	|РегистрСведений.СтруктураСтоимостиЗапасов.Изменение.Организации
	|РегистрСведений.СубъектыДляРасчетаСроковХранения.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СубъектыДляСкрытияПерсональныхДанных.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СчетаБухгалтерскогоУчетаНМА.Чтение.Организации
	|РегистрСведений.СчетаБухгалтерскогоУчетаНМА.Изменение.Организации
	|РегистрСведений.СчетаБухгалтерскогоУчетаОС.Чтение.Организации
	|РегистрСведений.СчетаБухгалтерскогоУчетаОС.Изменение.Организации
	|РегистрСведений.СчетаУчетаНоменклатуры.Чтение.Организации
	|РегистрСведений.СчетаУчетаНоменклатуры.Изменение.Организации
	|РегистрСведений.СчетаУчетаРасчетовСКонтрагентами.Чтение.Организации
	|РегистрСведений.СчетаУчетаРасчетовСКонтрагентами.Изменение.Организации
	|РегистрСведений.СчетНаОплатуПокупателюОплатаСервиса.Чтение.Организации
	|РегистрСведений.СчетНаОплатуПокупателюОплатаСервиса.Изменение.Организации
	|РегистрСведений.СчетчикВыгрузокОтчетностиВБанк.Чтение.Организации
	|РегистрСведений.СчетчикВыгрузокОтчетностиВБанк.Изменение.Организации
	|РегистрСведений.СчетчикиВыгрузок.Чтение.Организации
	|РегистрСведений.СчетчикиВыгрузок.Изменение.Организации
	|РегистрСведений.ТекущаяТарифнаяСтавкаСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ТекущаяТарифнаяСтавкаСотрудников.Чтение.Организации
	|РегистрСведений.ТекущаяТарифнаяСтавкаСотрудников.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ТекущаяТарифнаяСтавкаСотрудников.Изменение.Организации
	|РегистрСведений.ТекущиеКадровыеДанныеСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ТекущиеКадровыеДанныеСотрудников.Чтение.Организации
	|РегистрСведений.ТекущиеКадровыеДанныеСотрудников.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ТекущиеКадровыеДанныеСотрудников.Изменение.Организации
	|РегистрСведений.ТекущиеОтправляемыеТранспортныеКонтейнерыЭДО.Чтение.Организации
	|РегистрСведений.ТерриториальныеУсловияПФР.Чтение.Организации
	|РегистрСведений.ТерриториальныеУсловияПФР.Изменение.Организации
	|РегистрСведений.УдалитьАктуальныеДокументыЭДО.Чтение.Организации
	|РегистрСведений.УдалитьАктуальныеДокументыЭДО.Изменение.Организации
	|РегистрСведений.УменьшениеНалогаНаВзносыПодлежащиеУплате.Чтение.Организации
	|РегистрСведений.УменьшениеНалогаНаВзносыПодлежащиеУплате.Изменение.Организации
	|РегистрСведений.УменьшениеНалогаПоПатенту.Чтение.Организации
	|РегистрСведений.УменьшениеНалогаПоПатенту.Изменение.Организации
	|РегистрСведений.УменьшениеНалогаПСНнаСтраховыеВзносы.Чтение.Организации
	|РегистрСведений.УменьшениеНалогаПСНнаСтраховыеВзносы.Изменение.Организации
	|РегистрСведений.УничтоженныеПерсональныеДанные.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.УполномоченныеЛицаОрганизаций.Чтение.Организации
	|РегистрСведений.УполномоченныеЛицаОрганизаций.Изменение.Организации
	|РегистрСведений.УсловияДоговораГПХ.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.УсловияДоговораГПХ.Чтение.Организации
	|РегистрСведений.УсловияУдержанияПоИсполнительномуДокументу.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.УсловияУдержанияПоИсполнительномуДокументу.Чтение.Организации
	|РегистрСведений.УчетнаяПолитика.Чтение.Организации
	|РегистрСведений.УчетнаяПолитика.Изменение.Организации
	|РегистрСведений.УчетныеЗаписиЭДО.Чтение.Организации
	|РегистрСведений.УчетныеЗаписиЭДО.Изменение.Организации
	|РегистрСведений.ФайлыДокументовРеализацииПолномочийНалоговыхОрганов.Чтение.Организации
	|РегистрСведений.ФайлыДокументовРеализацииПолномочийНалоговыхОрганов.Изменение.Организации
	|РегистрСведений.ФизическиеЛицаПрисоединенныеККЭДО.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ФизическиеПоказателиЕНВД.Чтение.Организации
	|РегистрСведений.ФизическиеПоказателиЕНВД.Изменение.Организации
	|РегистрСведений.ФИОФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ФИОФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ФискальныеОперации.Чтение.Организации
	|РегистрСведений.ХранилищеЭлектронныхПредставленийРегламентированныхОтчетов.Чтение.Организации
	|РегистрСведений.ХранилищеЭлектронныхПредставленийРегламентированныхОтчетов.Изменение.Организации
	|РегистрСведений.ЭлементыАмортизацииГрупповыхОСБухгалтерскийУчет.Чтение.Организации
	|РегистрСведений.ЭлементыАмортизацииГрупповыхОСБухгалтерскийУчет.Изменение.Организации
	|РегистрСведений.ЭлементыАмортизацииНМАБухгалтерскийУчет.Чтение.Организации
	|РегистрСведений.ЭлементыАмортизацииНМАБухгалтерскийУчет.Изменение.Организации
	|РегистрНакопления.АвансовыеПлатежиИностранцевПоНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.АвансовыеПлатежиИностранцевПоНДФЛ.Чтение.Организации
	|РегистрНакопления.БухгалтерскиеВзаиморасчетыССотрудниками.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.БухгалтерскиеВзаиморасчетыССотрудниками.Чтение.Организации
	|РегистрНакопления.ВзаиморасчетыСДепонентами.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ВзаиморасчетыСДепонентами.Чтение.Организации
	|РегистрНакопления.ВзаиморасчетыССотрудниками.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ВзаиморасчетыССотрудниками.Чтение.Организации
	|РегистрНакопления.ВозвратыТоваров.Чтение.Организации
	|РегистрНакопления.ВыпускПродукцииПоДаннымПродаж.Чтение.Организации
	|РегистрНакопления.ВыпускПродукцииУслуг.Чтение.Организации
	|РегистрНакопления.ВыпускПродукцииУслуг.Изменение.Организации
	|РегистрНакопления.ВыработкаМатериалов.Чтение.Организации
	|РегистрНакопления.ВыработкаМатериалов.Изменение.Организации
	|РегистрНакопления.ВыработкаНМА.Чтение.Организации
	|РегистрНакопления.ВыработкаНМА.Изменение.Организации
	|РегистрНакопления.ВыработкаОС.Чтение.Организации
	|РегистрНакопления.ВыработкаОС.Изменение.Организации
	|РегистрНакопления.ЗадолженностьСамозанятыхПоРеестру.Чтение.Организации
	|РегистрНакопления.ЗадолженностьСамозанятыхПоРеестру.Изменение.Организации
	|РегистрНакопления.ЗакупленныеТоварыКомитентов.Чтение.Организации
	|РегистрНакопления.ЗакупленныеТоварыКомитентов.Изменение.Организации
	|РегистрНакопления.ЗарплатаКВыплате.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ЗарплатаКВыплате.Чтение.Организации
	|РегистрНакопления.ЗарплатаКВыплатеАвансом.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ЗарплатаКВыплатеАвансом.Чтение.Организации
	|РегистрНакопления.ИмущественныеВычетыНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ИмущественныеВычетыНДФЛ.Чтение.Организации
	|РегистрНакопления.ИПДоходы.Чтение.Организации
	|РегистрНакопления.ИПДоходы.Изменение.Организации
	|РегистрНакопления.ИПИныеМатериальныеРасходы.Чтение.Организации
	|РегистрНакопления.ИПИныеМатериальныеРасходы.Изменение.Организации
	|РегистрНакопления.ИПМПЗ.Чтение.Организации
	|РегистрНакопления.ИПМПЗ.Изменение.Организации
	|РегистрНакопления.ИПМПЗОбороты.Чтение.Организации
	|РегистрНакопления.ИПМПЗОбороты.Изменение.Организации
	|РегистрНакопления.ИПМПЗОтгруженные.Чтение.Организации
	|РегистрНакопления.ИПМПЗОтгруженные.Изменение.Организации
	|РегистрНакопления.ИППрочиеДоходы.Чтение.Организации
	|РегистрНакопления.ИППрочиеДоходы.Изменение.Организации
	|РегистрНакопления.ИППрочиеРасходы.Чтение.Организации
	|РегистрНакопления.ИППрочиеРасходы.Изменение.Организации
	|РегистрНакопления.ИПРасходыНаОплатуТруда.Чтение.Организации
	|РегистрНакопления.ИПРасходыНаОплатуТруда.Изменение.Организации
	|РегистрНакопления.ИПРБП.Чтение.Организации
	|РегистрНакопления.ИПРБП.Изменение.Организации
	|РегистрНакопления.ИсчисленныеСтраховыеВзносы.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ИсчисленныеСтраховыеВзносы.Чтение.Организации
	|РегистрНакопления.КнигаУчетаДоходовИРасходов.Чтение.Организации
	|РегистрНакопления.КнигаУчетаДоходовИРасходов.Изменение.Организации
	|РегистрНакопления.КнигаУчетаДоходовИРасходовНМА.Чтение.Организации
	|РегистрНакопления.КнигаУчетаДоходовИРасходовНМА.Изменение.Организации
	|РегистрНакопления.КнигаУчетаДоходовИРасходовОС.Чтение.Организации
	|РегистрНакопления.КнигаУчетаДоходовИРасходовОС.Изменение.Организации
	|РегистрНакопления.КнигаУчетаДоходовИРасходовРаздел4.Чтение.Организации
	|РегистрНакопления.КнигаУчетаДоходовИРасходовРаздел4.Изменение.Организации
	|РегистрНакопления.КнигаУчетаДоходовИРасходовРаздел5.Чтение.Организации
	|РегистрНакопления.КнигаУчетаДоходовИРасходовРаздел5.Изменение.Организации
	|РегистрНакопления.КнигаУчетаДоходовПатент.Чтение.Организации
	|РегистрНакопления.КнигаУчетаДоходовПатент.Изменение.Организации
	|РегистрНакопления.КонтролируемыеСделкиОрганизаций.Чтение.Организации
	|РегистрНакопления.КонтролируемыеСделкиОрганизаций.Изменение.Организации
	|РегистрНакопления.НачисленияПоДоговорамГПХ.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.НачисленияПоДоговорамГПХ.Чтение.Организации
	|РегистрНакопления.НачисленияУдержанияПоСотрудникам.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.НачисленияУдержанияПоСотрудникам.Чтение.Организации
	|РегистрНакопления.НачисленияУдержанияПоСотрудникам.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.НачисленияУдержанияПоСотрудникам.Изменение.Организации
	|РегистрНакопления.НачисленияУдержанияПоСотрудникамАвансом.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.НачисленияУдержанияПоСотрудникамАвансом.Чтение.Организации
	|РегистрНакопления.НачисленияУдержанияПоСотрудникамАвансом.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.НачисленияУдержанияПоСотрудникамАвансом.Изменение.Организации
	|РегистрНакопления.НДСАвансыПоДоговорамКомиссии.Чтение.Организации
	|РегистрНакопления.НДСАвансыПоДоговорамКомиссии.Изменение.Организации
	|РегистрНакопления.НДСВключенныйВСтоимость.Чтение.Организации
	|РегистрНакопления.НДСВключенныйВСтоимость.Изменение.Организации
	|РегистрНакопления.НДСЗаписиКнигиПокупок.Чтение.Организации
	|РегистрНакопления.НДСЗаписиКнигиПокупок.Изменение.Организации
	|РегистрНакопления.НДСЗаписиКнигиПродаж.Чтение.Организации
	|РегистрНакопления.НДСЗаписиКнигиПродаж.Изменение.Организации
	|РегистрНакопления.НДСЗаписиРаздела7Декларации.Чтение.Организации
	|РегистрНакопления.НДСЗаписиРаздела7Декларации.Изменение.Организации
	|РегистрНакопления.НДСКосвенныеРасходы.Чтение.Организации
	|РегистрНакопления.НДСКосвенныеРасходы.Изменение.Организации
	|РегистрНакопления.НДСНачисленный.Чтение.Организации
	|РегистрНакопления.НДСНачисленный.Изменение.Организации
	|РегистрНакопления.НДСНеоблагаемыеОперации.Чтение.Организации
	|РегистрНакопления.НДСНеоблагаемыеОперации.Изменение.Организации
	|РегистрНакопления.НДСПоПриобретеннымЦенностям.Чтение.Организации
	|РегистрНакопления.НДСПоПриобретеннымЦенностям.Изменение.Организации
	|РегистрНакопления.НДСПредъявленный.Чтение.Организации
	|РегистрНакопления.НДСПредъявленный.Изменение.Организации
	|РегистрНакопления.НДСПредъявленныйРеализация0.Чтение.Организации
	|РегистрНакопления.НДСПредъявленныйРеализация0.Изменение.Организации
	|РегистрНакопления.НДСРаздельныйУчет.Чтение.Организации
	|РегистрНакопления.НДСРаздельныйУчет.Изменение.Организации
	|РегистрНакопления.НДСРеализация0.Чтение.Организации
	|РегистрНакопления.НДСРеализация0.Изменение.Организации
	|РегистрНакопления.НДСсАвансов.Чтение.Организации
	|РегистрНакопления.НДСсАвансов.Изменение.Организации
	|РегистрНакопления.НДФЛКПеречислению.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.НДФЛКПеречислению.Чтение.Организации
	|РегистрНакопления.НДФЛПеречисленный.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.НДФЛПеречисленный.Чтение.Организации
	|РегистрНакопления.ОплатаСчетов.Чтение.Организации
	|РегистрНакопления.ОплатаСчетов.Изменение.Организации
	|РегистрНакопления.ОплатыНМАДляУСН.Чтение.Организации
	|РегистрНакопления.ОплатыНМАДляУСН.Изменение.Организации
	|РегистрНакопления.ОплатыОСДляУСН.Чтение.Организации
	|РегистрНакопления.ОплатыОСДляУСН.Изменение.Организации
	|РегистрНакопления.ОтложенныеКурсовыеРазницы.Чтение.Организации
	|РегистрНакопления.ОтложенныеКурсовыеРазницы.Изменение.Организации
	|РегистрНакопления.ОтработанноеВремяПоСотрудникам.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ОтработанноеВремяПоСотрудникам.Чтение.Организации
	|РегистрНакопления.ОтработанноеВремяПоСотрудникамАвансом.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ОтработанноеВремяПоСотрудникамАвансом.Чтение.Организации
	|РегистрНакопления.ОтработанноеВремяПоСотрудникамАвансом.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.ОтработанноеВремяПоСотрудникамАвансом.Изменение.Организации
	|РегистрНакопления.ОценочныеОбязательства.Чтение.Организации
	|РегистрНакопления.ОценочныеОбязательстваПоСотрудникам.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ОценочныеОбязательстваПоСотрудникам.Чтение.Организации
	|РегистрНакопления.ПособияПоСоциальномуСтрахованию.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ПособияПоСоциальномуСтрахованию.Чтение.Организации
	|РегистрНакопления.ПособияПоУходуЗаРебенком.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ПособияПоУходуЗаРебенком.Чтение.Организации
	|РегистрНакопления.ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.Чтение.Организации
	|РегистрНакопления.ПрослеживаемыеОсновныеСредства.Чтение.Организации
	|РегистрНакопления.ПрослеживаемыеОсновныеСредства.Изменение.Организации
	|РегистрНакопления.ПрослеживаемыеТовары.Чтение.Организации
	|РегистрНакопления.ПрослеживаемыеТовары.Изменение.Организации
	|РегистрНакопления.ПрослеживаемыеТоварыОтгруженныеВЕАЭС.Чтение.Организации
	|РегистрНакопления.ПрослеживаемыеТоварыОтгруженныеВЕАЭС.Изменение.Организации
	|РегистрНакопления.ПрочиеРасчеты.Чтение.Организации
	|РегистрНакопления.ПрочиеРасчеты.Изменение.Организации
	|РегистрНакопления.РазметкаАУСН.Чтение.Организации
	|РегистрНакопления.РазметкаАУСН.Изменение.Организации
	|РегистрНакопления.РасходыАУСН.Чтение.Организации
	|РегистрНакопления.РасходыАУСН.Изменение.Организации
	|РегистрНакопления.РасходыНаОнлайнКассыУменьшающиеЕНВД.Чтение.Организации
	|РегистрНакопления.РасходыНаОнлайнКассыУменьшающиеЕНВД.Изменение.Организации
	|РегистрНакопления.РасходыНаПлатон.Чтение.Организации
	|РегистрНакопления.РасходыНаПлатон.Изменение.Организации
	|РегистрНакопления.РасходыПриУСН.Чтение.Организации
	|РегистрНакопления.РасходыПриУСН.Изменение.Организации
	|РегистрНакопления.РасходыУменьшающиеНалогПоОтдельнымРежимам.Чтение.Организации
	|РегистрНакопления.РасходыУменьшающиеНалогПоОтдельнымРежимам.Изменение.Организации
	|РегистрНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Чтение.Организации
	|РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Чтение.Организации
	|РегистрНакопления.РасчетыНДФЛАУСН.Чтение.Организации
	|РегистрНакопления.РасчетыНДФЛАУСН.Изменение.Организации
	|РегистрНакопления.РасчетыПоЕдиномуНалоговомуСчету.Чтение.Организации
	|РегистрНакопления.РасчетыПоЕдиномуНалоговомуСчету.Изменение.Организации
	|РегистрНакопления.РасчетыПоНалогамНаЕдиномНалоговомСчете.Чтение.Организации
	|РегистрНакопления.РасчетыПоНалогамНаЕдиномНалоговомСчете.Изменение.Организации
	|РегистрНакопления.РасчетыПоСанкциямНаЕдиномНалоговомСчете.Чтение.Организации
	|РегистрНакопления.РасчетыПоСанкциямНаЕдиномНалоговомСчете.Изменение.Организации
	|РегистрНакопления.РасчетыСФондамиПоСтраховымВзносам.Чтение.Организации
	|РегистрНакопления.РеализацияУслуг.Чтение.Организации
	|РегистрНакопления.РеализацияУслуг.Изменение.Организации
	|РегистрНакопления.РеализованныеТоварыКомитентов.Чтение.Организации
	|РегистрНакопления.РеализованныеТоварыКомитентов.Изменение.Организации
	|РегистрНакопления.СведенияОДоходахНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.СведенияОДоходахНДФЛ.Чтение.Организации
	|РегистрНакопления.СведенияОДоходахСтраховыеВзносы.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.СведенияОДоходахСтраховыеВзносы.Чтение.Организации
	|РегистрНакопления.СрокиИспользованияГрупповыхОбъектовОС.Чтение.Организации
	|РегистрНакопления.СрокиИспользованияГрупповыхОбъектовОС.Изменение.Организации
	|РегистрНакопления.СтраховыеВзносыПереданныеВПФР.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.СтраховыеВзносыПереданныеВПФР.Чтение.Организации
	|РегистрНакопления.СтраховыеВзносыПереданныеВПФР.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.СтраховыеВзносыПереданныеВПФР.Изменение.Организации
	|РегистрНакопления.СтраховыеВзносыПоФизическимЛицам.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.СтраховыеВзносыПоФизическимЛицам.Чтение.Организации
	|РегистрНакопления.УплатаНДФЛНалоговымиАгентамиКРаспределению.Чтение.Организации
	|БизнесПроцесс.Задание.Чтение.Пользователи
	|БизнесПроцесс.Задание.Изменение.Пользователи
	|БизнесПроцесс.ЗаявкаСотрудникаИзменитьЛичныеДанные.Чтение.Пользователи
	|БизнесПроцесс.ЗаявкаСотрудникаИзменитьЛичныеДанные.Изменение.Пользователи
	|БизнесПроцесс.ЗаявкаСотрудникаНалоговыйВычет.Чтение.Пользователи
	|БизнесПроцесс.ЗаявкаСотрудникаНалоговыйВычет.Изменение.Пользователи
	|БизнесПроцесс.ЗаявкаСотрудникаОтпуск.Чтение.Пользователи
	|БизнесПроцесс.ЗаявкаСотрудникаОтпуск.Изменение.Пользователи
	|БизнесПроцесс.ЗаявкаСотрудникаОтсутствиеПоБолезни.Чтение.Пользователи
	|БизнесПроцесс.ЗаявкаСотрудникаОтсутствиеПоБолезни.Изменение.Пользователи
	|БизнесПроцесс.ЗаявкаСотрудникаСправка2НДФЛ.Чтение.Пользователи
	|БизнесПроцесс.ЗаявкаСотрудникаСправка2НДФЛ.Изменение.Пользователи
	|БизнесПроцесс.ОбращениеСотрудника.Чтение.Пользователи
	|БизнесПроцесс.ОбращениеСотрудника.Изменение.Пользователи
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.Задание
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаИзменитьЛичныеДанные
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаНалоговыйВычет
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаОтпуск
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаОтсутствиеПоБолезни
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.ЗаявкаСотрудникаСправка2НДФЛ
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.ОбращениеСотрудника
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.УдалитьЗаявкаКабинетСотрудника
	|Задача.ЗадачаИсполнителя.Чтение.Пользователи
	|Задача.ЗадачаИсполнителя.Изменение.Пользователи
	|РегистрБухгалтерии.Хозрасчетный.Чтение.Организации
	|РегистрБухгалтерии.Хозрасчетный.Изменение.Организации";

КонецПроцедуры

// Возвращает доступность настройки внешних пользователей.
// Вызывается из ПанельАдминистрированияБСП.НастройкиПользователейИПрав.
//
Функция ВнешниеПользователиДоступны() Экспорт
	
	// Функциональность внешних пользователей не поддерживается, доступных для них ролей нет.
	// Поэтому настройка внешних пользователей отключена.
	Возврат Ложь;
	
КонецФункции

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
//
Процедура ЗаполнитьСпискиСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.Справочники.ДокументооборотыОбменаСБанками, Истина);
	Списки.Вставить(Метаданные.Справочники.ТранзакцииОбменаСБанками, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ЖурналОперацийСФайламиОбменаСБанками, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СертификатыОрганизацийДляОбменаСБанками, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПользовательИнтеграции

// Устанавливает пользователю права доступа к API области данных.
// См. РаботаВМоделиСервисаБТСПереопределяемый.УстановитьДоступКAPIОбластиДанных
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - Пользователь, которому нужно установить права.
//
Процедура УстановитьДоступКAPIДляСлужебногоПользователя(Пользователь) Экспорт
	
	// В процедуре устанавливается только роль доступа к API подсистемы "Передача данных" из БТС.
	// Все специфичные роли для интеграции с конкретной учетной системой устанавливаются
	// в УстановитьНастройки модуля менеджера учетной системы (например, НастройкиИнтеграцииСБанками)
	
	Роли = РолиСлужебногоПользователяДляДоступаКAPI();
	УстановитьРолиСлужебногоПользователя(Пользователь, Роли);
	
КонецПроцедуры

// Снимает у пользователя права доступа к API области данных.
// См. РаботаВМоделиСервисаБТСПереопределяемый.УстановитьДоступКAPIОбластиДанных
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - Пользователь, у которого нужно снять права.
//
Процедура СнятьДоступКAPIДляСлужебногоПользователя(Пользователь) Экспорт
	
	// При снятии доступа к API пользователя (когда пользователь отключил в менеджере
	// сервиса доступ к API и предоставил роль обычного служебного пользователя нужно
	// отключить роль доступа к API и заодно дополнительные роли всех учетных систем.
	
	Роли = РолиСлужебногоПользователяДляДоступаКAPI();
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Роли, РолиСлужебногоПользователяИнтеграцииСБанком());
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Роли, РолиСлужебногоПользователяИнтеграцииCRM());
	СнятьРолиСлужебногоПользователя(Пользователь, Роли);
	
КонецПроцедуры

Функция РолиСлужебногоПользователяДляДоступаКAPI()
	
	Роли = Новый Массив;
	
	Роли.Добавить("УдаленныйДоступПередачаДанных");
	
	Возврат Роли;
	
КонецФункции

#КонецОбласти

#Область ИнтеграцияСБанками

// Устанавливает пользователю права доступа к API области данных.
// См. РаботаВМоделиСервисаБТСПереопределяемый.УстановитьДоступКAPIОбластиДанных
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - Пользователь, которому нужно установить права.
//
Процедура УстановитьПраваСлужебногоПользователяИнтеграцииСБанком(Пользователь) Экспорт
	
	Роли = РолиСлужебногоПользователяИнтеграцииСБанком();
	УстановитьРолиСлужебногоПользователя(Пользователь, Роли);
	
КонецПроцедуры

// Снимает у пользователя права доступа к API области данных.
// См. РаботаВМоделиСервисаБТСПереопределяемый.УстановитьДоступКAPIОбластиДанных
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - Пользователь, у которого нужно снять права.
//
Процедура СнятьПраваСлужебногоПользователяИнтеграцииСБанком(Пользователь) Экспорт
	
	Роли = РолиСлужебногоПользователяИнтеграцииСБанком();
	СнятьРолиСлужебногоПользователя(Пользователь, Роли);
	
КонецПроцедуры

Функция РолиСлужебногоПользователяИнтеграцииСБанком()
	
	Роли = Новый Массив;
	
	Роли.Добавить("ДоступКВнешнемуИнтерфейсуМонитораОсновныхПоказателей");
	Роли.Добавить("ДоступКВнешнемуИнтерфейсуСпискаЗадач");
	Роли.Добавить("ДоступКВнешнемуИнтерфейсуБанковскиеСчета");
	Роли.Добавить("ДоступКВнешнемуИнтерфейсуСообщенияРегламентированнойОтчетности");
	Роли.Добавить("ДоступКВнешнемуИнтерфейсуТарифовСтраховыхВзносовИП");
	Роли.Добавить("ДоступКВнешнемуИнтерфейсуСтавокУСН");
		
	Возврат Роли;
	
КонецФункции

#КонецОбласти

#Область СервисСверкиРасчетов

// Устанавливает служебному пользователю права для проведения сверки расчетов в фоне.
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - Пользователь, которому нужно установить права.
//
Процедура УстановитьПраваСлужебногоПользователяСверкиРасчетов(Пользователь) Экспорт
	
	Роли = РолиСлужебногоПользователяСверкиРасчетов();
	УстановитьРолиСлужебногоПользователя(Пользователь, Роли);
	
КонецПроцедуры

Функция РолиСлужебногоПользователяСверкиРасчетов()
	
	Роли = Новый Массив;
	
	Роли.Добавить("БазовыеПраваБСП");
	Роли.Добавить("БазовыеПраваЭД");
	Роли.Добавить("ДобавлениеИзменениеДанныхБухгалтерии");
	Роли.Добавить("ДобавлениеИзменениеНастроекБизнесСеть");
	
	Возврат Роли;
	
КонецФункции

#КонецОбласти

#Область ИнтеграцияCRM

// Устанавливает пользователю права доступа к API области данных.
// См. РаботаВМоделиСервисаБТСПереопределяемый.УстановитьДоступКAPIОбластиДанных
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - Пользователь, которому нужно установить права.
//
Процедура УстановитьПраваСлужебногоПользователяИнтеграцииCRM(Пользователь) Экспорт
	
	Роли = РолиСлужебногоПользователяИнтеграцииCRM();
	УстановитьРолиСлужебногоПользователя(Пользователь, Роли);
	
КонецПроцедуры

// Снимает у пользователя права доступа к API области данных.
// См. РаботаВМоделиСервисаБТСПереопределяемый.УстановитьДоступКAPIОбластиДанных
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - Пользователь, у которого нужно снять права.
//
Процедура СнятьПраваСлужебногоПользователяИнтеграцииCRM(Пользователь) Экспорт
	
	Роли = РолиСлужебногоПользователяИнтеграцииCRM();
	СнятьРолиСлужебногоПользователя(Пользователь, Роли);
	
КонецПроцедуры

Функция РолиСлужебногоПользователяИнтеграцииCRM()
	
	Роли = Новый Массив;
	
	Роли.Добавить("УдаленныйДоступOData");
	
	Возврат Роли;
	
КонецФункции

#КонецОбласти

#Область ПрофилиПользователей

Функция ОписаниеПрофиляГлавныйБухгалтер()
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ГлавныйБухгалтер";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Главный бухгалтер'", Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Идентификатор = "62730c03-81d6-11e0-a42a-be487808c52b"; // Произвольный уникальный идентификатор, присвоенный при разработке.
	
	РазрешитьИспользованиеПрограммы(ОписаниеПрофиля, Истина);
	РазрешитьРедактированиеВсехДанныхБухгалтерии(ОписаниеПрофиля);
	
	// Ниже - до конца процедуры: дополнительные права главного бухгалтера
	
#Область НастройкиПрограммы

	ОписаниеПрофиля.Роли.Добавить("ИзменениеМакетовПечатныхФорм");
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновЭтикеток");
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекБухгалтерии");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСведенийОбОрганизациях");
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДатЗапретаИзменения");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДатЗапретаЗагрузки");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВариантовОтчетов"); // Общих вариантов и вариантов всех пользователей
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПлановОбмена");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПодключаемоеОборудование");
	ОписаниеПрофиля.Роли.Добавить("ПравоИнтерактивногоПереносаГраницыПоследовательности"); // Перенос границы без перепроведения документов
	
	РазрешитьНастройкуИнтеграцииЕГАИС(ОписаниеПрофиля);
	ИнтеграцияГИСМБП.РазрешитьНастройку(ОписаниеПрофиля);
	РазрешитьНастройкуИнтеграцииЗЕРНО(ОписаниеПрофиля);
	РазрешитьНастройкуИнтеграцииСАТУРН(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеМонитораПортала1СИТС"); // Информирование о договоре ИТС и новых версиях программы
	ОписаниеПрофиля.Роли.Добавить("ПодключениеИнтернетПоддержки");
	
#КонецОбласти

#Область АдминистрированиеДанных
	
	ОписаниеПрофиля.Роли.Добавить("РедактированиеРеквизитовОбъектов");// Разрешает редактирование ключевых реквизитов НСИ БСП. Не путать с правом обхода ограничения редактируемых реквизитов объектов.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеГрафиковРаботы"); // Разрешает работу с графиками работы 
	
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		
		// Эта НСИ общая для многих областей. Ее может менять только администратор сервиса.
		// Поэтому в этом профиле права на редактирование не предоставляются.
		// Права на чтение этой НСИ включены в БазовыеПраваБСП, поэтому ЗапретитьРедактированиеОбщихДанных() не применяется.
		
	Иначе
		
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАдресныхСведений");  // Классификатор адресов
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБанков");
		ОписаниеПрофиля.Роли.Добавить("ПолучениеОбновленийКлассификаторов");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКалендарныхГрафиков");
		
	КонецЕсли;
	
	
#КонецОбласти

#Область ПрикладныеНастройки

	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДополнительныхРеквизитовИСведений"); // Настройка наборов свойств
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКурсовВалют");
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
		ОписаниеПрофиля.Роли,
		УчетЗарплаты.РолиНастройки());
	
#КонецОбласти

#Область ПрикладныеФункции

	ОписаниеПрофиля.Роли.Добавить("ЗакрытиеПериода");

#КонецОбласти

#Область Интеграция
	
	// - негосударственные поставщики данных
	
	// библиотека ИнтернетПоддержкаПользователей
	ОписаниеПрофиля.Роли.Добавить("ЗапросНовойСправкиСПАРКРиски"); // предоставляет доступ к функциям сервиса, которые могут тарифицироваться по количеству обращений
	ОписаниеПрофиля.Роли.Добавить("ПереходВВебВерсиюСПАРК"); // предоставляет доступ к функциям сервиса, которые могут тарифицироваться по количеству обращений

	// Право отправки заявок в банки.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаявокНаКредит");
	
	// Право отправки заявок на открытие счета.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаявокНаОткрытиеСчета");
	
	// 1С:ДиректБанк
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекОбменСБанками");

#КонецОбласти

#Область МоиЗадачи

	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМоиЗадачи");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеВыполнениеЗадач");
	
#КонецОбласти

#Область КалькуляцияРасходов
	
	ОписаниеПрофиля.Роли.Добавить("РедактированиеКалькуляцииРасходов");
	
#КонецОбласти
	
	// Работа с 1С:Номенклатурой.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхРаботаСНоменклатурой");
	
	// СБП
	ОписаниеПрофиля.Роли.Добавить("НастройкаПодключенияКСБП");
	// Конец СБП
	
	// ОФД
	ОписаниеПрофиля.Роли.Добавить("НастройкаПодключенияКОФД");
	// Конец ОФД
	
	Возврат ОписаниеПрофиля;
	
КонецФункции

Функция ОписаниеПрофиляБухгалтер()
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Бухгалтер";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Бухгалтер'", Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Идентификатор = "ea55b08d-7d30-11e0-b9a7-20cf30c960bf"; // Произвольный уникальный идентификатор, присвоенный при разработке.
	
	РазрешитьИспользованиеПрограммы(ОписаниеПрофиля, Истина);
	РазрешитьРедактированиеВсехДанныхБухгалтерии(ОписаниеПрофиля);
	
	// Работа с 1С:Номенклатурой.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхРаботаСНоменклатурой");
	
	Возврат ОписаниеПрофиля;

КонецФункции

Функция ОписаниеПрофиляТолькоПросмотр()
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ТолькоПросмотр";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Только просмотр'", Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Идентификатор = "45ce5549-ade3-11e0-9746-00179a3853da"; // Произвольный уникальный идентификатор, присвоенный при разработке.
	
	РазрешитьИспользованиеПрограммы(ОписаниеПрофиля, Ложь);
	
	// Интегральная роль, предоставляющая доступ к большому количеству объектов,
	// хранящих прикладные данные БП.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхБухгалтерии");
	
	// Работа с 1С:Номенклатурой.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхРаботаСНоменклатурой");
	
#Область ПрикладныеДанные

#Область НормативноСправочнаяИнформацияБСП
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКурсовВалют");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦелейРасходаМатериалов");
	
#КонецОбласти

#Область НормативноСправочнаяИнформацияБП

	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбщейБухгалтерскойНСИ"); // Общедоступные классификаторы
	// Права на остальную НСИ БП - в интегральной роли
	
#КонецОбласти

#Область НормативноСправочнаяИнформацияБИП
	
	// библиотека ИнтернетПоддержкаПользователей
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСПАРКРиски"); // предоставляется совместно с ролями, предоставляющими право просмотра контрагентов (интегральная роль ЧтениеДанныхБухгалтерии)
	
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеКоманд1СПАРКРиски"); // Это роль БП, предоставляется совместно с ЧтениеДанныхСПАРКРиски
	
#КонецОбласти

#Область МониторингБанков
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхМониторингБанков");
	
#КонецОбласти

#Область ПервичныеДокументы

	ОписаниеПрофиля.Роли.Добавить("ПросмотрСвязанныеДокументы");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧекКоррекции");
	РазрешитьПросмотрДанныхГосИС(ОписаниеПрофиля);
	РазрешитьПросмотрДанныхИСМП(ОписаниеПрофиля);
	РазрешитьПросмотрДанныхЕГАИС(ОписаниеПрофиля);
	ИнтеграцияГИСМБП.РазрешитьПросмотрДанных(
		ОписаниеПрофиля,
		ИнтеграцияГИСМБП.НовыйОписаниеОбластейДоступа(Истина)); // Просмотр всех данных ГИСМ
	РазрешитьПросмотрДанныхВЕТИС(ОписаниеПрофиля);
	// Права на остальные документы - в интегральной роли
	РазрешитьПросмотрДанныхЗЕРНО(ОписаниеПрофиля);
	РазрешитьПросмотрДанныхСАТУРН(ОписаниеПрофиля);
	РазрешитьЧтениеКегНаОборудованииРозливаИСМП(ОписаниеПрофиля);
	
#КонецОбласти

#Область ЗарплатаКадры

	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
		ОписаниеПрофиля.Роли,
		УчетЗарплаты.РолиПросмотраДанных());
	
#КонецОбласти

#Область РегламентированнаяОтчетность

	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБРО");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхРегламентированнойОтчетности");
	ОписаниеПрофиля.Роли.Добавить("РаботаСЗаявкамиНаЛьготныйКредит");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетностиПереданнойВИнтерфакс");
	
#КонецОбласти

#Область ЭлектроннаяПодписьБСП
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМашиночитаемыхДоверенностей");
	
#КонецОбласти

#Область ОтчетыБСП
	
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеУниверсальногоОтчета");
	
#КонецОбласти

#КонецОбласти // ПрикладныеДанные

#Область Интеграция

	ОписаниеПрофиля.Роли.Добавить("ЧтениеПлановОбмена");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭлектронныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбменСБанками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаршрутовПодписания");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМЧДЭДО");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовЭПД");
	
	// Право обмена данными по технологии 1С:БанкКоннект.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНеразделяемыхДанныхОбменаСБанками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРазделяемыхДанныхОбменаСБанками");
	
	// Право чтения заявок в банки.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаявокНаКредит");

	// Право чтения заявок на открытие счета.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаявокНаОткрытиеСчета");

	// Право чтения отчетов 1С:ФинОтчетности.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФинОтчетностьВБанки");
	
	ОписаниеПрофиля.Роли.Добавить("ПросмотрПротоколовОтправкиВКонтролирующиеОрганы");
	
	// Подключение других приложений к Календарю отчетности.
	ОписаниеПрофиля.Роли.Добавить("ДоступКВнешнемуИнтерфейсуОтчетнойКампанииПодключение");
	
#КонецОбласти

#Область ИнформацияИПоддержка

	РазрешитьВсеКаналыПоддержкиПользователей(ОписаниеПрофиля);

#КонецОбласти

#Область ЭДО

	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыКонтрагентовБЭД");

#КонецОбласти

#Область ЭлектронноеАктированиеЕИС

	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекЭлектронногоАктированияЕИС");

#КонецОбласти

#Область МоиЗадачи
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМоиЗадачи");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеВыполнениеЗадач");
	
#КонецОбласти

#Область КалькуляцияРасходов
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКалькуляцииРасходов");
	
#КонецОбласти
	
#Область ЕдиныйНалоговыйСчетИнтеграция
	
	// ЕдиныйНалоговыйСчетИнтеграция
	Если ОбщегоНазначения.ПодсистемаСуществует("РегламентированнаяОтчетность.ЕдиныйНалоговыйСчет") Тогда
		МодульЕдиныйНалоговыйСчетИнтеграция = ОбщегоНазначения.ОбщийМодуль("ЕдиныйНалоговыйСчетИнтеграция");
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
			ОписаниеПрофиля.Роли,
			МодульЕдиныйНалоговыйСчетИнтеграция.РолиПросмотраДанных());
	КонецЕсли;
	// Конец ЕдиныйНалоговыйСчетИнтеграция
	
#КонецОбласти
	
	
	Возврат ОписаниеПрофиля;
	
КонецФункции

Функция ОписаниеПрофиляМенеджерПоПродажам()
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "МенеджерПоПродажам";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Менеджер по продажам'", Метаданные.ОсновнойЯзык.КодЯзыка);
	
	ОписаниеПрофиля.Идентификатор = "1f75ab92-9e66-11e5-81c6-e0cb4ed5f182"; // Произвольный уникальный идентификатор, присвоенный при разработке.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Описывает полномочия менеджера по продажам.
                                    |В частности, профиль предоставляет доступ к редактированию
                                    |- счетов покупателям
                                    |- накладных на продажу товаров покупателям и актов на оказание услуг
                                    |- возвратов товаров от покупателей
                                    |- данных о контрагентах
                                    |- данных о номенклатуре, включая цены номенклатуры.'");
									
	РазрешитьИспользованиеПрограммы(ОписаниеПрофиля, Истина);

#Область РазделыИнтерфейса

	ОписаниеПрофиля.Роли.Добавить("ПодсистемаПродажи");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаСправочники");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаСклад");

#КонецОбласти

#Область ПрикладныеДанные

#Область НормативноСправочнаяИнформацияБСП

	ОписаниеПрофиля.Роли.Добавить("ЧтениеКурсовВалют");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовКонтактнойИнформации");// Список стран (разделенный), дополнение к ДобавлениеИзменениеКонтрагентов
	
#КонецОбласти

#Область НормативноСправочнаяИнформацияБП

	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбщейБухгалтерскойНСИ"); // Общедоступные классификаторы
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСпискаФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДолжностей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСкладов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтатейДвиженияДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновДоговоров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбъектовВыполненияРабот");
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСпособовДоставки");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБанковскихСчетов"); // позволяет редактировать счета, подчиненные доступным объектам
	
	ОписаниеПрофиля.Роли.Добавить("ПросмотрРасчетовСКонтрагентами"); // позволяет видеть расчеты с контрагентами по месту в формах
		
#КонецОбласти

#Область НормативноСправочнаяИнформацияБИП
	
	// библиотека ИнтернетПоддержкаПользователей
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСПАРКРиски"); // предоставляется совместно с ролями, предоставляющими право просмотра контрагентов (ДобавлениеИзменениеКонтрагентов, ЧтениеКонтрагентов)
	ОписаниеПрофиля.Роли.Добавить("ПостановкаКонтрагентовНаМониторингСПАРКРиски"); // предоставляется совместно с ролями, предоставляющими право добавления контрагентов (ДобавлениеИзменениеКонтрагентов)
	
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДосьеКонтрагента"); // Это роль БИП
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеКомандДосьеКонтрагента"); // Это роль БП, предоставляется совместно с ПросмотрОтчетаДосьеКонтрагента
	
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеКоманд1СПАРКРиски"); // Это роль БП, предоставляется совместно с ЧтениеДанныхСПАРКРиски
	
#КонецОбласти

#Область ПервичныеДокументы

	// Общие права
	ОписаниеПрофиля.Роли.Добавить("ПросмотрСвязанныеДокументы"); // Это роль БСП
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхПервичныхДокументов"); // Роль предоставляется, совместно с правами на конкретные первичные документы
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСроковОплатыДокументов");
	ОписаниеПрофиля.Роли.Добавить("ВыводРеестраДокументов");
	
	// Права на документы конкретных видов
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовПокупателям");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТекстаДополнительныхУсловийВСчетеПокупателю");
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРеализацииТоваровУслуг");
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурВыданных");
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВозвратТоваровОтПокупателя");
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетаОРозничныхПродажах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидыОплатОрганизаций");
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРозничныхПродаж");
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКоммерческихПредложений");
	
	РазрешитьПросмотрДанныхЕГАИС(ОписаниеПрофиля);
	РазрешитьПросмотрДанныхВЕТИС(ОписаниеПрофиля);
	РазрешитьПросмотрДанныхГосИС(ОписаниеПрофиля);
	РазрешитьИнтеграциюИСМП(ОписаниеПрофиля);
	РазрешитьПросмотрДанныхЗЕРНО(ОписаниеПрофиля);
	РазрешитьИнтеграциюСАТУРН(ОписаниеПрофиля);
	
#КонецОбласти

#Область РабочиеМеста

	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиОжидаемаяОплатаОтПокупателей");

#КонецОбласти

#Область Отчеты
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхМонитораРуководителя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПерсонализированныхДанных");
	
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСчетаНеОплаченныеПокупателями");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхБухгалтерскогоУчета");
	// Роль ЧтениеДанныхБухгалтерскогоУчета позволяет получать данные из регистра бухгалтерии.
	// Она необходима для использования отчетов, получающих данные из регистра, доступ к которым назначается ниже:
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиТоваров");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаВаловаяПрибыль");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаПрайсЛист");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаПродажи");

#КонецОбласти

#КонецОбласти

#Область Интеграция

	// Внешние системы
	
	// - бизнес-контрагентов
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаДокументамиБизнесСеть");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБизнесСеть");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭлектронныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовЭПД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыКонтрагентовБЭД");
	
	// ЭлектронноеАктированиеЕИС
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхДокументовЭлектронногоАктированияЕИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекЭлектронногоАктированияЕИС");
	
	// - государства
	
	// -- Маркировка товаров
	ОбластиДоступа = ИнтеграцияГИСМБП.НовыйОписаниеОбластейДоступа(Ложь);
	ОбластиДоступа.Отгрузки    = Истина; // Продавец может передавать в ГИСМ только данные об отгрузке покупателям
	ИнтеграцияГИСМБП.РазрешитьИнтеграцию(ОписаниеПрофиля, ОбластиДоступа);
	
	// - Онлайн оплаты ЮMoney
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменовОнлайнОплаты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбменовОнлайнОплаты");
	ОписаниеПрофиля.Роли.Добавить("ПолучениеПлатежнойСсылкиДляОнлайнОплаты");
	
	// Внутри предприятия

	РазрешитьОбмен1СДокументооборот(ОписаниеПрофиля);
	
	// Это роль БП, предоставляется совместно с ДобавлениеИзменениеУчетныхЗаписейЭлектроннойПочты.
	// Предоставляет доступ к сервисным возможностям для работы с электронной почтой, например,
	// использование подписи в письмах, выбор основной учетной записи и т.п.
	ОписаниеПрофиля.Роли.Добавить("РаботаСЭлектроннойПочтойБП");
	
#КонецОбласти

#Область ИнформацияИПоддержка

	РазрешитьПросмотрНовостей(ОписаниеПрофиля);
	
#КонецОбласти

#Область МоиЗадачи

	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМоиЗадачи");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеВыполнениеЗадач");
	
#КонецОбласти

#Область КалькуляцияРасходов
	
	ОписаниеПрофиля.Роли.Добавить("РедактированиеКалькуляцииРасходов");
	
#КонецОбласти

#Область ПростойИнтерфейс

	ОписаниеПрофиля.Роли.Добавить("ПодсистемаПростойИнтерфейсТовары");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаПростойИнтерфейсДокументы");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаПростойИнтерфейсКонтрагенты");

#КонецОбласти

	// Работа с 1С:Номенклатурой.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхРаботаСНоменклатурой");
	
	Возврат ОписаниеПрофиля;
	
КонецФункции

// Включает в профиль набор ролей и видов доступа, необходимых для интерактировной работы в конфигурации.
// Этот набор - общий для всех пользователей.
//
// Параметры:
//  ОписаниеПрофиля		 - см. УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа() - заполняемая коллекция
//  АктивныйПользователь - Булево - Активный пользователь участвует непосредственно в работе предприятия.
//                                  В том числе, это проявляется в том, что он вносит данные в программу.
//                                  Пассивный - только наблюдает.
//
Процедура РазрешитьИспользованиеПрограммы(ОписаниеПрофиля, АктивныйПользователь)

	// Все прикладные пользователи должны обладать базовыми правами
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
	
	// Минимальный доступ к базовым объектам конфигурации.
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБП");
	
	// Набор ролей, предоставляющий минимальный доступ к базовым объектам библиотек, входящих в состав конфигурации.
	// В соответствии с документацией к соответствующим библиотекам, следующие роли должны быть назначены всем пользователям,
	// имеющим право на интерактивный запуск программы,
	// вне зависимости от полномочий, требующих использовать прикладные функции этих библиотек.
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЭД");  // Библиотека электронного документооборота (с контрагентами и банками)
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИПП"); // Библиотека интернет-поддержки пользователей
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБТС"); // Библиотека технологий сервиса
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБПО"); // Библиотека подключаемого оборудования
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЗарплатаКадры"); // БЗКБ
	
	// В БП для всех профилей применяется ограничение доступа к данным по организациям.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации");
	
	// Это роли БСП
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГлобальныхДополнительныхОтчетовИОбработок");// роль конфигурации, дополнительная к ЧтениеДополнительныхОтчетовИОбработок
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСнимковОтчетов");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафиковРаботы");
	
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");  // Персональные настройки разного рода
	
	// Роли, включающие "Мои задачи"
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМоиЗадачи");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеВыполнениеЗадач");
	
	Если АктивныйПользователь Тогда
		
		ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена"); // БСП
		ОписаниеПрофиля.Роли.Добавить("РедактированиеПечатныхФорм");    // БСП
		
		ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновЭтикеток");
		
		// Общепринятые способы интеграции
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУчетныхЗаписейЭлектроннойПочты");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРассылокОтчетов");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСерверовDSS");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУчетныхЗаписейСерверовDSS");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСервисаDSS");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеПодключаемогоОборудования"); // ввод и вывод данных с помощью подключаемого оборудования
		ОписаниеПрофиля.Роли.Добавить("УправлениеФискальнымУстройством"); 
		ОписаниеПрофиля.Роли.Добавить("ОтправкаSMS");
		
		// Работа с мобильными приложениями
		ОписаниеПрофиля.Роли.Добавить("ЧтениеПлановОбменаСМобильнымиПриложениями");
		ОписаниеПрофиля.Роли.Добавить("ЗагрузкаКассовыхЧековПодотчетныхЛиц");
		
		// Это роли БТС, позволяющие подписывать документы в модели сервиса
		ОписаниеПрофиля.Роли.Добавить("ИспользованиеЭлектроннойПодписиВМоделиСервиса");
			
#Область СБП
		
		ОписаниеПрофиля.Роли.Добавить("ПереводыСБПc2b");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекПодключенияКСБП");
		
#КонецОбласти 

	КонецЕсли;
	
КонецПроцедуры

Процедура РазрешитьРедактированиеВсехДанныхБухгалтерии(ОписаниеПрофиля)
	
	// Интегральная роль, предоставляющая доступ к большому количеству объектов,
	// хранящих прикладные данные БП
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхБухгалтерии");
	
#Область АдминистрированиеДанных

	// см. также ЗапретитьРедактированиеОбщихДанных()
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбщейБухгалтерскойНСИ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНеразделяемыхДанныхРегламентированнойОтчетности");
		
#КонецОбласти

#Область ПрикладныеДанные

#Область НормативноСправочнаяИнформацияБСП

	ОписаниеПрофиля.Роли.Добавить("ЧтениеКурсовВалют");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовКонтактнойИнформации");// Список стран (разделенный)
	
#КонецОбласти

#Область НормативноСправочнаяИнформацияБП

	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбщейБухгалтерскойНСИ"); // Общедоступные классификаторы
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБанковскихСчетов"); // позволяет редактировать счета, подчиненные доступным объектам
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЦелейРасходаМатериалов"); 
	// Права на остальную НСИ БП - в интегральной роли
	
#КонецОбласти

#Область НормативноСправочнаяИнформацияБИП
	
	// библиотека ИнтернетПоддержкаПользователей
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСПАРКРиски"); // предоставляется совместно с ролями, предоставляющими право просмотра контрагентов (интегральная роль ДобавлениеИзменениеДанныхБухгалтерии)
	ОписаниеПрофиля.Роли.Добавить("ПостановкаКонтрагентовНаМониторингСПАРКРиски"); // предоставляется совместно с ролями, предоставляющими право добавления контрагентов (интегральная роль ДобавлениеИзменениеДанныхБухгалтерии)
	
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДосьеКонтрагента");      // Это роль БИП
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеКомандДосьеКонтрагента"); // Это роль БП, предоставляется совместно с ПросмотрОтчетаДосьеКонтрагента
	
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеКоманд1СПАРКРиски"); // Это роль БП, предоставляется совместно с ЧтениеДанныхСПАРКРиски
	
#КонецОбласти

#Область МониторингБанков
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхМониторингБанков");
	
#КонецОбласти

#Область ПервичныеДокументы

	ОписаниеПрофиля.Роли.Добавить("ПросмотрСвязанныеДокументы");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеПечатныхФорм");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЧекКоррекции");
	
	// Права на первичные документы БП - в интегральной роли
	
#КонецОбласти

#Область ЗарплатаКадры

	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
		ОписаниеПрофиля.Роли,
		УчетЗарплаты.РолиРедактированияДанных());

#КонецОбласти

#Область РегламентированнаяОтчетность

	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБРО");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРазделяемыхДанныхРегламентированнойОтчетности");
	ОписаниеПрофиля.Роли.Добавить("ОтправкаОтчетностиВИнтерфакс");
	
#КонецОбласти

#Область ЭлектроннаяПодписьБСП
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМашиночитаемыхДоверенностей");
	
#КонецОбласти

#Область ОтчетыБСП
	
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеУниверсальногоОтчета");
	
#КонецОбласти

#Область КалькуляцияРасходов
	
	ОписаниеПрофиля.Роли.Добавить("РедактированиеКалькуляцииРасходов");
	
#КонецОбласти

#КонецОбласти // ПрикладныеДанные

#Область Интеграция

	// Внешние системы
	
	// - бизнес-контрагентов
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекБизнесСеть");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаДокументамиБизнесСеть");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБизнесСеть");
	
	// 1С:ДиректБанк
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаОбменСБанками");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбменСБанками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменСБанками");
	
	// ЭДО
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовЭПД");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНоменклатурыКонтрагентовБЭД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаршрутовПодписания");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭлектронныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовЭПД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекЭлектронногоВзаимодействия");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМЧДЭДО");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМЧДОрганизацийЭДО");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМЧДКонтрагентовЭДО");
	
	// ЭлектронноеВзаимодействие.ЭлектронноеАктированиеЕИС
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхДокументовЭлектронногоАктированияЕИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекЭлектронногоАктированияЕИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхДокументовЭлектронногоАктированияЕИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекЭлектронногоАктированияЕИС");
	
	// - сервисы интернет-поддеркжи
	ОписаниеПрофиля.Роли.Добавить("ПодключениеСервисовСопровождения");
	
		
	// - государства
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеСервиса1СТакском");
	ОписаниеПрофиля.Роли.Добавить("ПравоНаЗащищенныйДокументооборотСКонтролирующимиОрганами");
	
	РазрешитьИнтеграциюЕГАИС(ОписаниеПрофиля);
	ИнтеграцияГИСМБП.РазрешитьИнтеграцию(
		ОписаниеПрофиля,
		ИнтеграцияГИСМБП.НовыйОписаниеОбластейДоступа(Истина)); // Редактирование всех данных ГИСМ
	РазрешитьИнтеграциюВЕТИС(ОписаниеПрофиля);
	РазрешитьИнтеграциюГосИС(ОписаниеПрофиля);
	РазрешитьИнтеграциюИСМП(ОписаниеПрофиля);
	РазрешитьИнтеграциюЗЕРНО(ОписаниеПрофиля);
	РазрешитьИнтеграциюСАТУРН(ОписаниеПрофиля);
	
	РазрешитьИзменениеДобавлениеКегНаОборудованииРозливаИСМП(ОписаниеПрофиля);
	РазрешитьЧтениеКегНаОборудованииРозливаИСМП(ОписаниеПрофиля);
	// - подключаемое оборудование
	ОписаниеПрофиля.Роли.Добавить("УправлениеЭквайринговымТерминалом");
	
	// - Google
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеСинхронизацииСКалендаремGoogle");
	
	// - Онлайн оплаты ЮMoney
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменовОнлайнОплаты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбменовОнлайнОплаты");
	ОписаниеПрофиля.Роли.Добавить("ПолучениеПлатежнойСсылкиДляОнлайнОплаты");

	// - Право обмена данными по технологии 1С:БанкКоннект.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНеразделяемыхДанныхОбменаСБанками");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНеразделяемыхДанныхОбменаСБанками");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРазделяемыхДанныхОбменаСБанками");
	
	// - Право отправки отчетов 1С:ФинОтчетности.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеФинОтчетностьВБанки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМашиночитаемыхДоверенностей");
	
	// Внутри предприятия
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПлановОбмена");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеСинхронизацииДанных"); // Позволяет выгрузить почти все данные
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбменаСИнтернетМагазином");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеМобильногоПриложения");
	ОбменДаннымиСВнешнимиСистемамиБПИнтеграцияПодсистем.РазрешитьВыполнениеЗагрузкиДанныхВнешнихСистем(ОписаниеПрофиля);
	
	РазрешитьОбмен1СДокументооборот(ОписаниеПрофиля);
	
	// РаспознавнаиеДокументов
	ОписаниеПрофиля.Роли.Добавить("РаспознаваниеДокументов");
	// Конец РаспознаваниеДокументов
	
	// Разрешение другим приложениям подключаться к Календарю отчетности этого приложения.
	ОписаниеПрофиля.Роли.Добавить("ДоступКВнешнемуИнтерфейсуОтчетнойКампанииПодключение");
	
#КонецОбласти

#Область ИнформацияИПоддержка

	РазрешитьВсеКаналыПоддержкиПользователей(ОписаниеПрофиля);
	
#КонецОбласти
	
#Область СБП
	
	ОписаниеПрофиля.Роли.Добавить("ПереводыСБПc2b");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекПодключенияКСБП");
	
#КонецОбласти

#Область ОФД

	ОписаниеПрофиля.Роли.Добавить("ДанныеДокументовОФД");
	
#КонецОбласти 

#Область ЕдиныйНалоговыйСчетИнтеграция
	
	// ЕдиныйНалоговыйСчетИнтеграция
	Если ОбщегоНазначения.ПодсистемаСуществует("РегламентированнаяОтчетность.ЕдиныйНалоговыйСчет") Тогда
		МодульЕдиныйНалоговыйСчетИнтеграция = ОбщегоНазначения.ОбщийМодуль("ЕдиныйНалоговыйСчетИнтеграция");
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
			ОписаниеПрофиля.Роли,
			МодульЕдиныйНалоговыйСчетИнтеграция.РолиРедактированияДанных());
	КонецЕсли;
	// Конец ЕдиныйНалоговыйСчетИнтеграция
	
#КонецОбласти
	
КонецПроцедуры

Процедура РазрешитьВсеКаналыПоддержкиПользователей(ОписаниеПрофиля)
	
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОписанияИзмененийПрограммы");
	ОписаниеПрофиля.Роли.Добавить("ИнтеграцияСКоннект");
	РазрешитьПросмотрНовостей(ОписаниеПрофиля);
	
	// Подключение к сервисам 1С:ИТС - привилегия пользователя с полными правами,
	// обладающего информацией о заключенных договорах поддержки.
	
КонецПроцедуры

Процедура РазрешитьПросмотрНовостей(ОписаниеПрофиля)
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНовостей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНовостейРазделов"); // Это роль БП, которая предоставляется совместно с ЧтениеНовостей
	
КонецПроцедуры

Процедура РазрешитьОбмен1СДокументооборот(ОписаниеПрофиля)
	
	// ИнтеграцияС1СДокументооборотом
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБИД");
	КонецЕсли;
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

#Область ЕГАИС

#КонецОбласти

#Область ВЕТИС

Процедура РазрешитьИнтеграциюВЕТИС(ОписаниеПрофиля)
	
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВетеринарноСопроводительныхДокументовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаболеванийУсловийРегионализацииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросовСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИнвентаризацийПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИсходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНазначенийГрузовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбъединенийЗаписейСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроизводственныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеХозяйствующихСубъектовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоответствияНоменклатурыВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаписейСкладскогоЖурналаВРезервеВЕТИС");

КонецПроцедуры

Процедура РазрешитьИнтеграциюГосИС(ОписаниеПрофиля)
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШтрихкодовУпаковокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШтрихкодовУпаковокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУточнениеСведенийОКодахМаркировкиИСМП");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУточнениеСведенийОКодахМаркировкиИСМП");
	
КонецПроцедуры

Процедура РазрешитьИнтеграциюИСМП(ОписаниеПрофиля)
	
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИСМП");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельАдминистрированияИСМП");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПроверкаИПодборТабачнойПродукцииМОТП");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПроверкаИПодборПродукцииИСМП");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменаИСМП");
	ОписаниеПрофиля.Роли.Добавить("ПовторнаяПечатьКодовМаркировкиИСМП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМаркировкаТоваровИСМП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыводИзОборотаИСМП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказНаЭмиссиюКодовМаркировкиСУЗ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПеремаркировкаТоваровИСМП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСписаниеКодовМаркировкиИСМП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтгрузкаТоваровИСМП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВозвратВОборотИСМП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПриемкаТоваровИСМП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтветственныхЗаАктуализациюТокеновАвторизацииИСМП");
	ОписаниеПрофиля.Роли.Добавить("РазрешитьКодыМаркировкиСОшибкамиПроверкиНаККТ");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиРезультатыСверкиКодовМаркировкиТОРГ2ИСМП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУточнениеСведенийОКодахМаркировкиИСМП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетИСМП");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСписокКИНаБалансеИСМП");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСведенияОбОтклоненияхИСМП");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетИСМП");

КонецПроцедуры

Процедура РазрешитьПросмотрДанныхВЕТИС(ОписаниеПрофиля)
	
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВетеринарноСопроводительныхДокументовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаболеванийУсловийРегионализацииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаписейСкладскогоЖурналаВРезервеВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗапросовСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнвентаризацийПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИсходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначенийГрузовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбъединенийЗаписейСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводственныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоответствияНоменклатурыВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеХозяйствующихСубъектовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаАнализРасхожденийПриИнвентаризацииПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаАнализРасхожденийПриОтгрузкеПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаАнализРасхожденийПриПоступленииПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаАнализРасхожденийПриПроизводствеПродукцииВЕТИС");
	
КонецПроцедуры

#КонецОбласти

Процедура РазрешитьНастройкуИнтеграцииЕГАИС(ОписаниеПрофиля)
	
	// Следует использовать совместно с РазрешитьИнтеграциюЕГАИС() или РазрешитьПросмотрДанныхЕГАИС()
	
	ОписаниеПрофиля.Роли.Добавить("НастройкаСинхронизацииСЕГАИС");
	
КонецПроцедуры

Процедура РазрешитьИнтеграциюЕГАИС(ОписаниеПрофиля)
	
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовПостановкиНаБалансЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовСписанияЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗагрузкиОстатковЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификатораАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификатораОрганизацийЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСправокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИсходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВозвратовИзРегистра2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПередачВРегистр2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЧековЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЧековЕГАИСНаВозврат");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспортныхНакладныхЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковАлкогольнойПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗапросовЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросовАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиСопоставлениеКлассификаторовЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПомощникКорректировкиОстатковЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовОбИмпортеЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовОПроизводствеЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУведомленийОПланируемомИмпортеЕГАИС");
	
КонецПроцедуры

Процедура РазрешитьПросмотрДанныхЕГАИС(ОписаниеПрофиля)
	
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовПостановкиНаБалансЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовСписанияЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗагрузкиОстатковЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗапросовЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковАлкогольнойПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСправокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИсходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПередачВРегистр2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовИзРегистра2ЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековЕГАИСНаВозврат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗапросовАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификатораАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификатораОрганизацийЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаАнализРасхожденийПриДвиженииАлкогольнойПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТранспортныхНакладныхЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаАнализРасхожденийПриПоступленииАлкогольнойПродукции");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаАнализРасхожденийПриОтгрузкеАлкогольнойПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОбИмпортеЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОПроизводствеЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУведомленийОПланируемомИмпортеЕГАИС");
	
КонецПроцедуры

Процедура РазрешитьПросмотрДанныхГосИС(ОписаниеПрофиля)
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШтрихкодовУпаковокТоваров");
	
КонецПроцедуры

Процедура РазрешитьПросмотрДанныхИСМП(ОписаниеПрофиля)
	
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИСМП");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаркировкаТоваровИСМП");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыводИзОборотаИСМП");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПеремаркировкаТоваровИСМП");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказНаЭмиссиюКодовМаркировкиСУЗ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСписаниеКодовМаркировкиИСМП");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтгрузкаТоваровИСМП");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратВОборотИСМП");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриемкаТоваровИСМП");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаАнализРасхожденийПриВыводеИзОборотаИСМП");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаАнализРасхожденийПриМаркировкеТоваровИСМП");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаКодыМаркировкиДляДекларацииИСМП");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУточнениеСведенийОКодахМаркировкиИСМП");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСписокКИНаБалансеИСМП");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСведенияОбОтклоненияхИСМП");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетИСМП");
	
КонецПроцедуры

Функция ОписаниеПрофиляКладовщик()
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Кладовщик";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Кладовщик'", Метаданные.ОсновнойЯзык.КодЯзыка);
	
	ОписаниеПрофиля.Идентификатор = "280617ef-9b1e-407b-9a66-ac2193387bff"; // Произвольный уникальный идентификатор, присвоенный при разработке.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Описывает полномочия кладовщика.
                                    |В частности, профиль предоставляет доступ к редактированию
                                    |- накладных от поставщиков
                                    |- возвратов товаров поставщикам
                                    |- данных о номенклатуре
                                    |- расходов материалов
                                    |- перемещений и комплектаций
                                    |- данных инвентаризации
                                    |- выпуска продукции.'");
									
	РазрешитьИспользованиеПрограммы(ОписаниеПрофиля, Истина);

#Область РазделыИнтерфейса

	ОписаниеПрофиля.Роли.Добавить("ПодсистемаСправочники");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаСклад");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаПокупки");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаПроизводство");
	
#КонецОбласти

#Область ПрикладныеДанные

#Область НормативноСправочнаяИнформацияБСП

	ОписаниеПрофиля.Роли.Добавить("ЧтениеКурсовВалют");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовКонтактнойИнформации");// Список стран (разделенный), дополнение к ДобавлениеИзменениеКонтрагентов
	
#КонецОбласти

#Область НормативноСправочнаяИнформацияБП
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСпискаФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДолжностей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСкладов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБанковскихСчетов");
	
#КонецОбласти

#Область ПервичныеДокументы

	// Общие права
	ОписаниеПрофиля.Роли.Добавить("ПросмотрСвязанныеДокументы"); // Это роль БСП
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхПервичныхДокументов"); // Роль предоставляется, совместно с правами на конкретные первичные документы
	ОписаниеПрофиля.Роли.Добавить("ВыводРеестраДокументов");
	
	// Права на документы конкретных видов
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПоступленийТоваровУслуг");
	
	// Для кладовщика добавляем вид доступа на основании видов операций поступления товаров и услуг 
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыОперацийПТиУ", "Предустановленный");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ВидыОперацийПТиУ",
		"Перечисление.ВидыОперацийПоступлениеТоваровУслуг.Товары");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ВидыОперацийПТиУ",
		"Перечисление.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ВидыОперацийПТиУ",
		"Перечисление.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетовПоставщиков");
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурПолученных");
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВозвратовТоваровПоставщику");
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПеремещенийТоваров");
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТребованийНакладных");
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКомплектацийНоменклатуры");
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИнвентаризацийТоваровНаСкладе");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОприходованийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСписанийТоваров");
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовПроизводстваЗаСмену");
	
	РазрешитьПросмотрДанныхЕГАИС(ОписаниеПрофиля);
	РазрешитьПросмотрДанныхВЕТИС(ОписаниеПрофиля);
	РазрешитьПросмотрДанныхГосИС(ОписаниеПрофиля);
	
#Область ИнтеграцияИСМП
	
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИСМП");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПроверкаИПодборТабачнойПродукцииМОТП");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПроверкаИПодборПродукцииИСМП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМаркировкаТоваровИСМП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыводИзОборотаИСМП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПеремаркировкаТоваровИСМП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПриемкаТоваровИСМП");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиРезультатыСверкиКодовМаркировкиТОРГ2ИСМП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУточнениеСведенийОКодахМаркировкиИСМП");
	
#КонецОбласти
	
#КонецОбласти

#Область Отчеты
	
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиТоваров");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДвижениеТоваров");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаМатериалыВыданныеСотрудникам");
	
#КонецОбласти

#КонецОбласти

#Область Интеграция

	// Внешние системы
	
	// - бизнес-контрагентов
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаСКонтрагентами");
	
	// ЭлектронноеАктированиеЕИС
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхДокументовЭлектронногоАктированияЕИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекЭлектронногоАктированияЕИС");
	
	// Внутри предприятия

	РазрешитьОбмен1СДокументооборот(ОписаниеПрофиля);
	
	// Это роль БП, предоставляется совместно с ДобавлениеИзменениеУчетныхЗаписейЭлектроннойПочты.
	// Предоставляет доступ к сервисным возможностям для работы с электронной почтой, например,
	// использование подписи в письмах, выбор основной учетной записи и т.п.
	ОписаниеПрофиля.Роли.Добавить("РаботаСЭлектроннойПочтойБП");
	
#КонецОбласти

#Область ИнформацияИПоддержка

	РазрешитьПросмотрНовостей(ОписаниеПрофиля);
	
#КонецОбласти

#Область МоиЗадачи

	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМоиЗадачи");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеВыполнениеЗадач");
	
#КонецОбласти

#Область СчетаИПроводки
	
	// Некоторые функции требуют доступ к регистру бухгалтерии (например, подбор по остаткам) и плану счетов (если
	// включена видимость счетов учета).
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхБухгалтерскогоУчета");
	
#КонецОбласти

#Область ПростойИнтерфейс

	ОписаниеПрофиля.Роли.Добавить("ПодсистемаПростойИнтерфейсТовары");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаПростойИнтерфейсДокументы");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаПростойИнтерфейсКонтрагенты");

#КонецОбласти

	// Работа с 1С:Номенклатурой.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхРаботаСНоменклатурой");
	
	Возврат ОписаниеПрофиля;
	
КонецФункции

#КонецОбласти

#Область ЗЕРНО

Процедура РазрешитьНастройкуИнтеграцииЗЕРНО(ОписаниеПрофиля)
	
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменаЗЕРНО");
	
КонецПроцедуры

Процедура РазрешитьИнтеграциюЗЕРНО(ОписаниеПрофиля)
	
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтветственныхПодписаниеСообщенийЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеФормированиеПартийЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОформлениеСДИЗЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСобранныйУрожайЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСписаниеПартийЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПогашениеСДИЗЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеФормированиеПартийИзДругихПартийЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросОстатковПартийЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеФормированиеПартийПриПроизводствеЗЕРНО");
	
КонецПроцедуры

Процедура РазрешитьПросмотрДанныхЗЕРНО(ОписаниеПрофиля)
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗапросОстатковПартийЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОформлениеСДИЗЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПогашениеСДИЗЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСобранныйУрожайЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСписаниеПартийЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФормированиеПартийЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФормированиеПартийИзДругихПартийЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФормированиеПартийПриПроизводствеЗЕРНО");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаАнализРасхожденийПриДвиженииЗЕРНО");
	
КонецПроцедуры

#КонецОбласти

#Область САТУРН
Процедура РазрешитьНастройкуИнтеграцииСАТУРН(ОписаниеПрофиля)
	
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваСАТУРН");
	
КонецПроцедуры

Процедура РазрешитьИнтеграциюСАТУРН(ОписаниеПрофиля)
	
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваСАТУРН");
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовИнвентаризацииСАТУРН");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовПримененияСАТУРН");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросовОстатковПартийСАТУРН");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИмпортаПродукцииСАТУРН");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНакладныхСАТУРН");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПлановПримененияСАТУРН");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроизводственныхОперацийСАТУРН");
	
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменаСАТУРН");
	
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаАнализРасхожденийПриДвиженииСАТУРН");

КонецПроцедуры

Процедура РазрешитьПросмотрДанныхСАТУРН(ОписаниеПрофиля)
	
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаАнализРасхожденийПриДвиженииСАТУРН");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовИнвентаризацииСАТУРН");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовПримененияСАТУРН");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗапросовОстатковПартийСАТУРН");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИмпортаПродукцииСАТУРН");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНакладныхСАТУРН");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПлановПримененияСАТУРН");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводственныхОперацийСАТУРН");
	
КонецПроцедуры

#КонецОбласти


#Область ПивоНаРозлив

Процедура РазрешитьИзменениеДобавлениеКегНаОборудованииРозливаИСМП(ОписаниеПрофиля)
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКегиНаОборудованииРозливаИСМП");
	
КонецПроцедуры

Процедура РазрешитьЧтениеКегНаОборудованииРозливаИСМП(ОписаниеПрофиля)
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКегиНаОборудованииРозливаИСМП");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьРолиСлужебногоПользователя(Пользователь, Роли)
	
	СвойстваПользователя = СвойстваПользователя(Пользователь);
	Если СвойстваПользователя = Неопределено Тогда
		ЗаписьЖурналаРегистрации(ИнтеграцияСБанкамиКлиентСервер.ИмяСобытияЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.Пользователи, Пользователь, 
			СтрШаблон(НСтр("ru = 'Для %1 не найден пользователь информационной базы'"), Пользователь));
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СвойстваПользователя.Роли, Роли, Истина);
	СвойстваДляЗаписи = Новый Структура("Роли", СвойстваПользователя.Роли);
	Пользователи.УстановитьСвойстваПользователяИБ(СвойстваПользователя.УникальныйИдентификатор, СвойстваДляЗаписи);
	
КонецПроцедуры

Процедура СнятьРолиСлужебногоПользователя(Пользователь, Роли)
	
	СвойстваПользователя = СвойстваПользователя(Пользователь);
	Если СвойстваПользователя = Неопределено Тогда
		ЗаписьЖурналаРегистрации(ИнтеграцияСБанкамиКлиентСервер.ИмяСобытияЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.Пользователи, Пользователь, 
			СтрШаблон(НСтр("ru = 'Для %1 не найден пользователь информационной базы'"), Пользователь));
		Возврат;
	КонецЕсли;
	
	РолиПользователя = ОбщегоНазначенияКлиентСервер.РазностьМассивов(СвойстваПользователя.Роли, Роли);
	СвойстваДляЗаписи = Новый Структура("Роли", РолиПользователя);
	Пользователи.УстановитьСвойстваПользователяИБ(СвойстваПользователя.УникальныйИдентификатор, СвойстваДляЗаписи);
	
КонецПроцедуры

Функция СвойстваПользователя(Пользователь)
	
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИдентификаторПользователяИБ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователь, "ИдентификаторПользователяИБ");
	Если ЗначениеЗаполнено(ИдентификаторПользователяИБ) Тогда
		Возврат Пользователи.СвойстваПользователяИБ(ИдентификаторПользователяИБ);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ИнтегральныеРолиВсеДанныеБухгалтерии()
	
	// В конфигурации применяются два подхода к описанию профилей:
	// - интегральные роли - это устаревший подход, от которого в будущих версиях планируем постепенно отказаться
	// - атомарные роли - современный подход, детально описанный в стандартах разработки.
	
	// Сейчас эти подходы в конфигурации сочетаются.
	
	// Интегральные роли предоставляют право на множество объектов, слабо связанных друг с другом.
	// Часто интегральные роли предоставляют и часть базовых прав.
	
	// Функция описывает перечень интегральных ролей и, для каждой из них - перечень атомарных, содержащих только те права, 
	// которые уже есть в интегральной роли.
	
	ВытесняемыеРоли = Новый Массив;
	
	ОписаниеРолей = Новый Структура;
	ОписаниеРолей.Вставить("ЧтениеДанныхБухгалтерии",              ВытесняемыеРоли);
	ОписаниеРолей.Вставить("ДобавлениеИзменениеДанныхБухгалтерии", ВытесняемыеРоли);
	
	ВытесняемыеРоли.Добавить("БазовыеПраваБП"); // Базовые права включены в соответствующую единую роль
	ВытесняемыеРоли.Добавить("ЧтениеНовостейРазделов");// Право на все команды включено в единую роль
	
	Возврат ОписаниеРолей;
	
КонецФункции

// Описывает соответствие атомарных ролей просмотра и редактирования одних и тех же данных.
// Содержит только часть таких пар ролей, такую, которая позволяет упростить описание профилей.
//
Функция РолиПросмотраРедактирования()
	
	РолиПросмотраРедактирования = Новый ТаблицаЗначений;
	РолиПросмотраРедактирования.Колонки.Добавить("РольПросмотра",      Новый ОписаниеТипов("Строка"));
	РолиПросмотраРедактирования.Колонки.Добавить("РольРедактирования", Новый ОписаниеТипов("Строка"));
	РолиПросмотраРедактирования.Колонки.Добавить("ОбщиеДанные",        Новый ОписаниеТипов("Булево"));
	
	НоваяСтрока = РолиПросмотраРедактирования.Добавить();
	НоваяСтрока.РольПросмотра      = "ЧтениеПлановОбмена";
	НоваяСтрока.РольРедактирования = "ДобавлениеИзменениеПлановОбмена";
	
	НоваяСтрока = РолиПросмотраРедактирования.Добавить();
	НоваяСтрока.РольПросмотра      = "ЧтениеКурсовВалют";
	НоваяСтрока.РольРедактирования = "ДобавлениеИзменениеКурсовВалют";
	
	НоваяСтрока = РолиПросмотраРедактирования.Добавить();
	НоваяСтрока.РольПросмотра      = "ЧтениеПодключаемогоОборудования";
	НоваяСтрока.РольРедактирования = "ДобавлениеИзменениеПодключаемоеОборудование";
	
	НоваяСтрока = РолиПросмотраРедактирования.Добавить();
	НоваяСтрока.РольПросмотра      = "ЧтениеШаблоновЭтикеток";
	НоваяСтрока.РольРедактирования = "ДобавлениеИзменениеШаблоновЭтикеток";
	
	НоваяСтрока = РолиПросмотраРедактирования.Добавить();
	НоваяСтрока.РольПросмотра      = "ЧтениеГрафиковРаботы";
	НоваяСтрока.РольРедактирования = "ДобавлениеИзменениеГрафиковРаботы";
	
	НоваяСтрока = РолиПросмотраРедактирования.Добавить();
	НоваяСтрока.РольПросмотра      = "ЧтениеОбщейБухгалтерскойНСИ";
	НоваяСтрока.РольРедактирования = "ДобавлениеИзменениеОбщейБухгалтерскойНСИ";
	НоваяСтрока.ОбщиеДанные        = Истина;
	
	НоваяСтрока = РолиПросмотраРедактирования.Добавить();
	НоваяСтрока.РольПросмотра      = "ЧтениеНеразделяемыхДанныхОбменаСБанками";
	НоваяСтрока.РольРедактирования = "ДобавлениеИзменениеНеразделяемыхДанныхОбменаСБанками";
	НоваяСтрока.ОбщиеДанные        = Истина;
	
	// Отдельной роли для чтения общих (неразделяемых) данных регламентированной отчетности в БРО нет.
	// Права на чтение этих данных предоставляются одновременно с правами на чтение разделяемых данных.
	НоваяСтрока = РолиПросмотраРедактирования.Добавить();
	НоваяСтрока.РольПросмотра      = "ЧтениеДанныхРегламентированнойОтчетности";
	НоваяСтрока.РольРедактирования = "ДобавлениеИзменениеНеразделяемыхДанныхРегламентированнойОтчетности";
	НоваяСтрока.ОбщиеДанные        = Истина;
	
	Возврат РолиПросмотраРедактирования;
	
КонецФункции

Процедура ВытеснитьРолиИнтегральнымиРолями(ОписанияПрофилей)
	
	ИнтегральныеРоли = ИнтегральныеРолиВсеДанныеБухгалтерии();
	ДополнитьИнтегральныеРолиДобавлениеИзменениеБанковскихСчетов(ИнтегральныеРоли);
	
	// Чтобы упростить описание ролей, атомарные роли включаются в профили там, где это уместно.
	// Вместе с тем, не следует давать одному пользователю атомарную и интегральную роль,
	// предоставляющие права к одному и тому же объекту.
	// Поэтому из профиля, содержащего интегральную роль, исключим "вытесненные" им атомарные.
	
	Для Каждого ОписаниеПрофиля Из ОписанияПрофилей Цикл
		
		Для Каждого ОписаниеИнтегральнойРоли Из ИнтегральныеРоли Цикл
			
			Если ОписаниеПрофиля.Роли.Найти(ОписаниеИнтегральнойРоли.Ключ) = Неопределено Тогда
				Продолжить; // Интегральная роль не назначена
			КонецЕсли;
			
			Для Каждого ИмяВытесненнойРоли Из ОписаниеИнтегральнойРоли.Значение Цикл
				
				ИндексВытесненнойРоли = ОписаниеПрофиля.Роли.Найти(ИмяВытесненнойРоли);
				Если ИндексВытесненнойРоли = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				ОписаниеПрофиля.Роли.Удалить(ИндексВытесненнойРоли);
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ИсключитьИзбыточныеРолиПросмотра(ОписанияПрофилей)
	
	// Иногда при описании профиля удобнее, понятнее предоставить и право просмотра (скажем, в составе общих прав для нескольких профилей)
	// и право редактирования - как дополнительное право конкретного профиля.
	// Однако, с точки зрения исполнения профиля это избыточно.
	// Поэтому избыточные роли просмотра следует избегать там, где это возможно.
	
	РолиПросмотраРедактирования = РолиПросмотраРедактирования();
	
	Для Каждого ОписаниеПрофиля Из ОписанияПрофилей Цикл
		
		Для Каждого ПараРолейПросмотрРедактирование Из РолиПросмотраРедактирования Цикл
			
			РольРедактирования = ОписаниеПрофиля.Роли.Найти(ПараРолейПросмотрРедактирование.РольРедактирования);
			Если РольРедактирования = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			РольПросмотра = ОписаниеПрофиля.Роли.Найти(ПараРолейПросмотрРедактирование.РольПросмотра);
			Если РольПросмотра = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			// Есть одновременно роль просмотра и редактирования.
			// Роль просмотра - избыточная.
			ОписаниеПрофиля.Роли.Удалить(РольПросмотра);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗапретитьРедактированиеОбщихДанных(ОписанияПрофилей)
	
	// Если в информационной базе используются разделители, то только администратор базы может редактировать общие данные.
	// У прикладных пользователей редактирование следует запретить, предоставив права на чтение.
	
	Если Не ОбщегоНазначения.РазделениеВключено() Тогда
		Возврат;
	КонецЕсли;
	
	РолиПросмотраРедактирования = РолиПросмотраРедактирования();
	
	Для Каждого ОписаниеПрофиля Из ОписанияПрофилей Цикл
		
		Для Каждого ПараРолейПросмотрРедактирование Из РолиПросмотраРедактирования Цикл
			
			Если Не ПараРолейПросмотрРедактирование.ОбщиеДанные Тогда
				Продолжить;
			КонецЕсли;
			
			РольРедактирования = ОписаниеПрофиля.Роли.Найти(ПараРолейПросмотрРедактирование.РольРедактирования);
			Если РольРедактирования = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			// Эту роль следует исключить из профиля, предоставив взамен роль на чтение этих данных.
			ОписаниеПрофиля.Роли.Удалить(РольРедактирования);
			
			РольПросмотра = ОписаниеПрофиля.Роли.Найти(ПараРолейПросмотрРедактирование.РольПросмотра);
			Если РольПросмотра <> Неопределено Тогда
				// Роль просмотра уже есть в профиле, добавлять ее не надо
				Продолжить;
			КонецЕсли;
			
			ОписаниеПрофиля.Роли.Добавить(ПараРолейПросмотрРедактирование.РольПросмотра);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнитьИнтегральныеРолиДобавлениеИзменениеБанковскихСчетов(ИнтегральныеРоли)
	
	// Справочник БанковскиеСчета подчинен разным владельцам - Организации и Контрагенты - права на редактирование которых
	// включены в разные роли.
	
	// В конфигурации реализована роль ДобавлениеИзменениеБанковскихСчетов, предоставляющая право редактирования счетов,
	// подчиненных только тем владельцам, к редактированию которых у пользователя есть доступ.
	
	// При этом для отдельных пользователей важно предоставить доступ к редактированию банковских счетов организаций,
	// несмотря на то, что права на редактирование организаций у них нет.
	
	// Поэтому право редактирования банковских счетов включено в роль ДобавлениеИзменениеСведенийОбОрганизациях.
	
	// Таким образом, интегральная роль ДобавлениеИзменениеСведенийОбОрганизациях включает права,
	// предоставляемые ролью ДобавлениеИзменениеБанковскихСчетов, поэтому одновременно две роли предоставлять не следует.
	
	ИнтегральныеРоли.Вставить("ДобавлениеИзменениеСведенийОбОрганизациях", Новый Массив);
	ВытесняемыеРоли = ИнтегральныеРоли.ДобавлениеИзменениеСведенийОбОрганизациях;
	ВытесняемыеРоли.Добавить("ДобавлениеИзменениеБанковскихСчетов");
	
КонецПроцедуры

#КонецОбласти

