#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбновлениеИнформационнойБазы

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсиюAPI_1_0_7(Параметры) Экспорт
	Возврат;
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсиюAPI_1_0_7(Параметры) Экспорт
	
	Параметры.ПрогрессВыполнения.ВсегоОбъектов = 1;
	МетаданныеОбъекта                          = Метаданные.Константы.НастройкиОбменаЗЕРНО;
	ПолноеИмяОбъекта                           = МетаданныеОбъекта.ПолноеИмя();
	ПараметрыОтметкиВыполнения                 = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ОбработанныхОбъектов                       = 0;
	Менеджер                                   = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмяОбъекта);
	ПараметрыОптимизации                       = ИнтеграцияЗЕРНО.ПараметрыОптимизации();
	Параметры.ОбработкаЗавершена               = Истина;
	
	Если Менеджер.Получить().Получить() <> Неопределено Тогда
		
		Параметры.ОбработкаЗавершена = Ложь;
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			Блокировка.Заблокировать();
			
			ПараметрыОптимизации.ВерсияAPI = "1.0.7";
			ИнтеграцияЗЕРНОСлужебный.ЗаписатьПараметрыОптимизации(ПараметрыОптимизации);
			
			ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Менеджер, ПараметрыОтметкиВыполнения);
			
			ОбработанныхОбъектов = ОбработанныхОбъектов + 1;
			
			Параметры.ОбработкаЗавершена = Истина;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ТекстСообщения = НСтр("ru = 'Не удалось обработать константу ""Настройки обмена ФГИС ""Зерно"" по причине:'") 
				+ Символы.ПС + ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,
				МетаданныеОбъекта,, ТекстСообщения);
			
		КонецПопытки;
		
		Если ОбработанныхОбъектов > 0 Тогда
			ТекстСообщения = НСтр("ru = 'Обработана константа ""Настройки обмена ФГИС ""Зерно"".'");
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Информация,
				МетаданныеОбъекта,, ТекстСообщения);
		КонецЕсли;
	
	КонецЕсли;
	
	Параметры.ПрогрессВыполнения.ОбработаноОбъектов = Параметры.ПрогрессВыполнения.ОбработаноОбъектов + ОбработанныхОбъектов;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
