#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
	
// Возвращает массив видов расходов, которые в налоговом учете нормируются,
// потому что для них главой 25 НК РФ предусмотрены ограничения сумм
// 
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.ВидыРасходовНУ - Нормируемые расходы
//
Функция НормируемыеРасходы() Экспорт
	
	НормируемыеРасходы = НормируемыеРасходыОплатаТруда();
	НормируемыеРасходы.Добавить(ПредставительскиеРасходы);
	НормируемыеРасходы.Добавить(РасходыНаРекламуНормируемые);
	
	Возврат НормируемыеРасходы;
	
КонецФункции

// Возвращает массив видов расходов, относящихся к оплате труда, которые в налоговом учете нормируются,
// потому что для них главой 25 НК РФ предусмотрены ограничения сумм
//
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.ВидыРасходовНУ
//
Функция НормируемыеРасходыОплатаТруда() Экспорт

	НормируемыеРасходыОплатаТруда = Новый Массив;
	НормируемыеРасходыОплатаТруда.Добавить(Перечисления.ВидыРасходовНУ.ДобровольноеЛичноеСтрахование);
	НормируемыеРасходыОплатаТруда.Добавить(Перечисления.ВидыРасходовНУ.ДобровольноеЛичноеСтрахованиеНаСлучайСмертиИлиУтратыРаботоспособности);
	НормируемыеРасходыОплатаТруда.Добавить(Перечисления.ВидыРасходовНУ.ДобровольноеСтрахованиеПоДоговорамДолгосрочногоСтрахованияЖизниРаботников);
	НормируемыеРасходыОплатаТруда.Добавить(Перечисления.ВидыРасходовНУ.РасходыНаВозмещениеЗатратРаботниковПоУплатеПроцентов);

	Возврат НормируемыеРасходыОплатаТруда;
	
КонецФункции

#КонецОбласти

#КонецЕсли
