#Область ПрограммныйИнтерфейс

// Находит баннер по идентификатору.
//
// Параметры:
//  Идентификатор - Строка - идентификатор баннера.
//  ЭтоИдентификаторПереопределяемогоБаннера - Булево - признак завершения выполнения метода.
//
Процедура ИдентификаторБаннера(Идентификатор, ЭтоИдентификаторПереопределяемогоБаннера) Экспорт
	
КонецПроцедуры  

// Вызывает форму, которую нужно открыть при нажатии на гиперссылку в баннере.
// Параметры:
// 		НавигационнаяСсылка - Строка
// 		СтандартнаяОбработка - Булево
// 		Баннер - Произвольный - см. ПерсонализированныеПредложенияСервисов.НовыйБаннерДляСписка()
// 		Форма - Форма, в которой произошло нажатие на навигационную ссылку
//
Процедура ПерейтиПоСсылкеБаннера(НавигационнаяСсылка, СтандартнаяОбработка, Баннер, Форма) Экспорт
	
КонецПроцедуры

#КонецОбласти

