#Область ПрограммныйИнтерфейс

#Область ОпределениеТипов

// Функция описание типа договора.
//
// Параметры:
//	ЗначениеКонтрагента - СправочникСсылка.Контрагенты, СправочникСсылка.Организации, Неопределено - 
//		Ссылка для определения типа контрагента, договоры которого необходимо получить.
//
// Возвращаемое значение:
//	ОписаниеТипов - Описание типов справочник, содержащих договоры.
//
Функция ПолучитьОписаниеТиповДоговора() Экспорт
	
	Возврат Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов");
	
КонецФункции

// Функция возвращает тип банковского счета организации.
//
// Возвращаемое значение:
//	Тип - Тип справочника с банковскими счетами организации.
//
Функция ТипЗначенияБанковскогоСчетаОрганизации() Экспорт
	
	Возврат Тип("СправочникСсылка.БанковскиеСчета");

КонецФункции

// Функция ПолучитьОписаниеТиповБанковскогоСчетаОрганизации ОписаниеТипов
// для банковских счетов организаций.
//
// Возвращаемое значение:
//	ОписаниеТипов - Описание типов справочника с банковскими счетами организаций.
//
Функция ПолучитьОписаниеТиповБанковскогоСчетаОрганизации() Экспорт

	Возврат Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчета");	

КонецФункции // ПолучитьОписаниеТиповБанковскогоСчетаОрганизации()

// Функция ПолучитьОписаниеТиповНоменклатурнойГруппы возвращает 
// тип для номенклатурной группы.
//
// Возвращаемое значение:
//	ОписаниеТипов - Описание типа справочника для вида субконто "Номенклатурные группы".
//
Функция ПолучитьОписаниеТиповНоменклатурнойГруппы() Экспорт

	Возврат Новый ОписаниеТипов("СправочникСсылка.НоменклатурныеГруппы");

КонецФункции

// Функция ОписаниеТиповПодразделения возвращает 
// описание типов для справочника подразделений.
//
// Возвращаемое значение:
//	ОписаниеТипов - Описание типов справочника для подразделений.
//
Функция ОписаниеТиповПодразделения() Экспорт

	Возврат Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций");

КонецФункции

// Функция возвращает тип для справочника подразделений.
//
// Возвращаемое значение:
//	Тип - Тип справочника подразделений.
//
Функция ТипПодразделения() Экспорт
	
	Возврат Тип("СправочникСсылка.ПодразделенияОрганизаций");

КонецФункции

// Функция возвращает тип для справочника основные средства.
//
// Возвращаемое значение:
//	Тип - Тип справочника с основными средствами.
//
Функция ТипОсновныеСредства() Экспорт

	Возврат Тип("СправочникСсылка.ОсновныеСредства");

КонецФункции

#КонецОбласти

#Область ОпределениеХарактераОперации

// Функция проверяет, является ли переданный по ссылке документ документом реализации отгруженных товаров.
//
Функция ДокументЯвляетсяРеализациейОтгруженныхТоваров(СсылкаНаДокумент) Экспорт

	Возврат ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.РеализацияОтгруженныхТоваров");	
	
КонецФункции

// Функция проверяет, является ли переданный по ссылке документ документом реализации прочего имущества (не товаров)
//
Функция ДокументЯвляетсяРеализациейПрочегоИмущества(СсылкаНаДокумент) Экспорт

	Возврат ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ПередачаОС");
	
КонецФункции

// Функция ДокументЯвляетсяРеализацией возвращает Истина, если переданный по ссылке документ
// является документом реализации (товаров, услуг, ОС, НМА).
//
// Параметры:
//	СсылкаНаДокумент - ДокументСсылка.* - Проверяемый документ.
//
// Возвращаемое значение:
//	Булево - Истина, если документ является реализацией.
//
Функция ДокументЯвляетсяРеализацией(СсылкаНаДокумент) Экспорт

	ТипДокумента = ТипЗнч(СсылкаНаДокумент);

	Возврат ТипДокумента = Тип("ДокументСсылка.АктОбОказанииПроизводственныхУслуг")
			ИЛИ ТипДокумента = Тип("ДокументСсылка.КорректировкаРеализации")
			ИЛИ ТипДокумента = Тип("ДокументСсылка.ОказаниеУслуг")
			ИЛИ ТипДокумента = Тип("ДокументСсылка.ОтчетКомитентуОПродажах")
			ИЛИ ТипДокумента = Тип("ДокументСсылка.ОтчетОРозничныхПродажах")
			ИЛИ ТипДокумента = Тип("ДокументСсылка.ПередачаНМА")
			ИЛИ ТипДокумента = Тип("ДокументСсылка.ПередачаОС")
			ИЛИ ТипДокумента = Тип("ДокументСсылка.РеализацияТоваровУслуг")
			ИЛИ ТипДокумента = Тип("ДокументСсылка.РеализацияУслугПоПереработке");

КонецФункции

// Функция проверяет, является ли переданный по ссылке документ отчетом комитенту.
//
Функция ДокументЯвляетсяОтчетомКомитенту(СсылкаНаДокумент) Экспорт

	Возврат ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах");	
	
КонецФункции

// Функция проверяет, является ли переданный по ссылке документ поступление доп.расходов.
//
Функция ДокументЯвляетсяПоступлениемДопРасходов(СсылкаНаДокумент) Экспорт

	Возврат ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ПоступлениеДопРасходов");	
	
КонецФункции

// Функция ЭтоРегламентнаяОперация возвращает Истина, если переданный по ссылке документ
// является документом регламентной операции.
//
Функция ЭтоРегламентнаяОперация(СсылкаНаДокумент) Экспорт

	Возврат ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.РегламентнаяОперация");

КонецФункции

#КонецОбласти

#Область ИменаРеквизитов

// Функция ПолучитьИмяРеквизитаКонтрагентДоговора имя реквизита в справочнике
// ДоговорыКонтрагентов, в котором храниться ссылка на контрагента-владельца.
//
// Возвращаемое значение:
//	Строка - Имя реквизита Контрагент в договоре.
//
Функция ПолучитьИмяРеквизитаКонтрагентДоговора() Экспорт

	Возврат "Владелец";

КонецФункции

// Функция ПолучитьИмяРеквизитаВидДоговора имя реквизита в справочнике
// ДоговорыКонтрагентов, по которому определяется вид договора.
//
// Возвращаемое значение:
//	Строка - Имя реквизита, определяющего вид договора.
//
Функция ПолучитьИмяРеквизитаВидДоговора() Экспорт

	Возврат "ВидДоговора";

КонецФункции

// Функция ПолучитьИмяРеквизитаНоменклатурнаяГруппаНоменклатуры возвращает 
// имя реквизита НоменклатурнаяГруппа в справочнике Номенклатура.
//
// Возвращаемое значение:
//	Строка - Имя реквизита номенклатуры, определяющего номенклатурную группу.
//
Функция ПолучитьИмяРеквизитаНоменклатурнаяГруппаНоменклатуры() Экспорт

	Возврат "НоменклатурнаяГруппа";

КонецФункции

// Функция возвращает имя справочника, являющегося субконто "НоменклатурныеГруппы".
//
// Возвращаемое значение:
//	Строка - Имя справочника, используемого в субконто "Номенклатурные группы".
//
Функция ПолучитьИмяСправочникаНоменклатурныеГруппы() Экспорт

	Возврат "НоменклатурныеГруппы";

КонецФункции

// Функция возвращает строку с именем реквизита в справочнике подразделений,
// определяющего владельца подразделения, либо пустую строку, если справочник 
// подразделений не является подчиненным справочником.
//
// Возвращаемое значение:
//	Строка - Имя реквизита организации в справочнике подразделений.
//
Функция ИмяРеквизитаОрганизацияПодразделения() Экспорт
	
	Возврат "Владелец";

КонецФункции

#КонецОбласти

#Область Сообщения

// Функция возвращает строку с навигационной ссылкой на журнал документов по ОС.
//
Функция ПолучитьНавигационнуюСсылкуНаЖурналДокументыПоОС() Экспорт

	Возврат "e1cib/list/ЖурналДокументов.ДокументыПоОС";

КонецФункции

// Функция возвращает строку с навигационной ссылкой на журнал документов по НМА.
//
Функция ПолучитьНавигационнуюСсылкуНаЖурналДокументыПоНМА() Экспорт

	Возврат "e1cib/list/ЖурналДокументов.ДокументыПоНМА";

КонецФункции

// Функция возвращает строку с навигационной ссылкой для открытия учетной политики организации.
//
Функция ПолучитьНавигационнуюСсылкуНаУчетнуюПолитику() Экспорт

	Возврат "e1cib/list/РегистрСведений.УчетнаяПолитика";

КонецФункции

// Функция возвращает строку с навигационной ссылкой для открытия учетной политики по налогу на прибыль организации.
//
Функция ПолучитьНавигационнуюСсылкуНаУчетнуюПолитикуПоНалогуНаПрибыль() Экспорт

	Возврат "e1cib/list/РегистрСведений.НастройкиУчетаНалогаНаПрибыль";

КонецФункции

// Функция возвращает строку с навигационной ссылкой для открытия учетной политики по налогу на прибыль организации.
//
Функция ПолучитьНавигационнуюСсылкуНаУчетнуюПолитикуПоНДФЛ() Экспорт

	Возврат "e1cib/list/РегистрСведений.НастройкиУчетаНДФЛ";

КонецФункции

///////////////////////////////////////////////////////////////////////////////
// МЕЖОТЧЕТНЫЙ ПЕРИОД

// Вызывается из библиотеки при необходимости получить признак использования межотчетного периода.
// См.: БухгалтерскийУчетКлиентСервер.ИспользуетсяМежотчетныйПериод()
//
Процедура ПриОпределенииИспользованияМежотчетногоПериода(ИспользуетсяМежотчетныйПериод) Экспорт
	
	ИспользуетсяМежотчетныйПериод = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область НастройкаСубконто

// Процедура дополняет список параметров субконто, чтобы установить параметры выбора.
// 
// Параметры:
//  СписокПараметров - Структура - Список параметров
//  Объект - Структура, ЛюбаяСсылка - Данные, откуда будем брать параметры 
//  ШаблонИмяПоляОбъекта - Строка - Шаблон имя поля объекта
//
Процедура ДополнитьСписокПараметровСубконто(СписокПараметров, Объект, ШаблонИмяПоляОбъекта) Экспорт

КонецПроцедуры

// Процедура дополняет список параметров субконто, чтобы установить параметры выбора.
// 
// Параметры:
//  МассивПараметров - Массив - Массив параметров, в которых устанавливаются параметры выбора
//  СписокПараметров - Структура - Список параметров
//  ТипПоляОбъекта - Тип - Тип поля объекта, который проверяем для установки субконто
//
Процедура ДополнитьПараметрыВыбораПолейСубконто(МассивПараметров, СписокПараметров, ТипПоляОбъекта) Экспорт

КонецПроцедуры

#КонецОбласти

#КонецОбласти