///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = ОбработкаНовостейКлиент.ВсеОповещения().ИзменилсяСтатусОперации Тогда
		Если (Источник = ЭтотОбъект.УникальныйИдентификатор) ИЛИ (Источник = "*") Тогда
			Элементы.ДекорацияСостояниеОперации.Заголовок = Параметр;
		КонецЕсли;
	ИначеЕсли ИмяСобытия = ОбработкаНовостейКлиент.ВсеОповещения().ОперацияЗавершена Тогда
		Если (Источник = ЭтотОбъект.УникальныйИдентификатор) ИЛИ (Источник = "*") Тогда
			ЭтотОбъект.Закрыть(Истина);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЭтотОбъект.ТолькоПросмотр = Истина;

	ЭтотОбъект.Заголовок                          = Параметры.Заголовок;
	Элементы.ДекорацияСостояниеОперации.Заголовок = Параметры.СостояниеОперации;

КонецПроцедуры

#КонецОбласти
