#Область СлужебныйПрограммныйИнтерфейс

// Возвращает пустую структуру, которую нужно передать в качестве параметра в
// ЗагрузкаВыпискиПоБанковскомуСчету.РаспознатьОперациюДляДокумента
//
// Возвращаемое значение:
//  Структура - см. ЗагрузкаВыпискиПоБанковскомуСчету.НовыйПараметрыДокументаДляРаспознаванияОперации
//
Функция НовыйПараметрыДокументаДляРаспознаванияОперации() Экспорт
	
	Возврат ЗагрузкаВыпискиПоБанковскомуСчету.НовыйПараметрыДокументаДляРаспознаванияОперации();
	
КонецФункции

#КонецОбласти