#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", НСтр("ru = 'История движений'"));
	ПараметрыФормы.Вставить("Номенклатура", ПараметрКоманды);
	
	ПараметрыОткрытия = ОбщегоНазначенияБПКлиентСервер.ПараметрыОткрытияФормыСОжиданием(ПараметрыВыполненияКоманды);
	ПараметрыОткрытия.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаИсторияДвижений";
	ПараметрыОткрытия.Заголовок = ПараметрыФормы.Заголовок;
	
	ОбщегоНазначенияБПКлиент.ОткрытьФормуСОжиданием(ПараметрыОткрытия, ПараметрыФормы, Истина);

КонецПроцедуры

#КонецОбласти