///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "ИнтернетПоддержкаПользователей.СистемаБыстрыхПлатежей.БазоваяФункциональностьСБП".
// ОбщийМодуль.СистемаБыстрыхПлатежейКлиентПереопределяемый.
//
// Переопределяемые клиентские процедуры работы с Системой быстрых платежей:
//  - программное заполнение сообщения отправки платежной ссылки;
//  - обработка событий формы QR-кода СБП.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область РаботаССообщениями

// Заполняет параметры сообщения электронной почты, отправляемого без шаблона.
// Применяется в случае, если шаблоны сообщений не используются.
// 
// Параметры:
//  ПараметрыСообщения - Структура - Параметры сообщения электронной почты:
//    * Получатель - СписокЗначений - Список адресов электронной почты.
//    * Предмет - Произвольный - Ссылка на основание платежа.
//    * Тема - Строка - Тема сообщения.
//    * Текст - Строка - Текст сообщения.
//  ПараметрыОперации - Структура - Содержит дополнительные параметры для формирования текста сообщения:
//    * НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКСистемеБыстрыхПлатежей -
//      настройка подключения к Системе быстрых платежей.
//    * ПлатежнаяСсылка - Строка - Платежная ссылка, отправляемая в сообщении.
//    * СуммаСсылкиСБП - Число - Сумма платежной ссылки, отправляемой в сообщении.
//
//@skip-warning
Процедура ПриЗаполненииПараметровСообщенияБезШаблонаСБП(ПараметрыСообщения, ПараметрыОперации) Экспорт
	
	ИнтеграцияССБПБПКлиент.ПриЗаполненииПараметровСообщенияБезШаблонаСБП(ПараметрыСообщения, ПараметрыОперации);
	
КонецПроцедуры

#КонецОбласти

#Область ФормаОтображенияQRКода

// Определяет алгоритм, выполняющийся при открытии формы QR кода на форме подготовки платежной ссылки СБП.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма отображения QR-кода.
//  ДанныеПлатежнойСсылки - Структура - содержит в себе описание платежной ссылки:
//    * ПлатежнаяСсылка - Строка - ссылка сформированная по данным документа операции.
//    * QRКод - ДвоичныеДанные - данные изображения QR-кода.
//    * ОснованиеПлатежа - ОпределяемыйТип.ДокументОперацииСБП - документ, который отражает
//      оплату в информационной базе.
//  ОповещениеПослеЗавершенияНастройкиФормы - ОписаниеОповещения - оповещение,
//    вызывает метод "ПриОтображенииQRКода", рекомендуется использовать для подключения оборудования.
//    Свойство "ДополнительныеПараметры" имеет тип Структура, для передачи параметров в переопределяемый метод
//    ПереводыСБПc2bКлиентПереопределяемый.ПриОтображенииQRКода.
//
Процедура ПриОткрытииФормыQRКода(
		Форма,
		ДанныеПлатежнойСсылки,
		ОповещениеПослеЗавершенияНастройкиФормы) Экспорт
	
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(
		Неопределено,
		Форма,
		"ДисплейПокупателя");
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", Форма);
	
	ВыполнитьОбработкуОповещения(ОповещениеПослеЗавершенияНастройкиФормы, ДополнительныеПараметры);
	
КонецПроцедуры

// Определяет алгоритм, выполняющийся при отображении QR кода на форме подготовки платежной ссылки СБП.
//
// Параметры:
//  ДанныеПлатежнойСсылки - Структура - содержит описание платежной ссылки и основания платежа:
//    * ПлатежнаяСсылка - Строка - ссылка сформированная по данным документа операции.
//    * QRКод - ДвоичныеДанные - данные изображения QR-кода.
//    * ОснованиеПлатежа - ОпределяемыйТип.ДокументОперацииСБП - документ, который отражает
//      оплату в информационной базе.
//  Параметры - Структура - описание параметров переданных из метода
//   ПереводыСБПc2bКлиентПереопределяемый.ПриОткрытииФормыQRКода.
//
// Пример:
//  Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ПоддержкаОборудования.ПодключаемоеОборудование.ДисплеиПокупателя") Тогда
//
//     МодульОборудованиеДисплеиПокупателяКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ОборудованиеДисплеиПокупателяКлиент");
//
//       Если МодульОборудованиеДисплеиПокупателяКлиент.ПодключенныеДисплеиПокупателяВыводятQRКод() Тогда
//
//         ПараметрыОперации = МодульОборудованиеДисплеиПокупателяКлиент.ПараметрыОперацииДисплейПокупателя();
//         ПараметрыОперации.ЗначениеQRКода = ДанныеПлатежнойСсылки.ПлатежнаяСсылка;
//         ПараметрыОперации.КартинкаQRКода = Base64Строка(ДанныеПлатежнойСсылки.ПлатежнаяСсылка);
//
//         МодульОборудованиеДисплеиПокупателяКлиент.НачатьВыводQRКодаНаДисплейПокупателя(
//           Неопределено,
//           Новый УникальныйИдентификатор,
//           Неопределено,
//           ПараметрыОперации);
//
//         КонецЕсли;
//  КонецЕсли;
//
Процедура ПриОтображенииQRКода(
		ДанныеПлатежнойСсылки,
		Параметры) Экспорт
	
	Если ОборудованиеДисплеиПокупателяКлиент.ПодключенныеДисплеиПокупателяВыводятQRКод() Тогда
		
		ПараметрыОперации = ОборудованиеДисплеиПокупателяКлиент.ПараметрыОперацииДисплейПокупателя();
		ПараметрыОперации.СтрокиТекста   = НСтр("ru = 'Отсканируйте для оплаты'");
		ПараметрыОперации.ЗначениеQRКода = ДанныеПлатежнойСсылки.ПлатежнаяСсылка;
		
		ОборудованиеДисплеиПокупателяКлиент.НачатьВыводQRКодаНаДисплейПокупателя(
			Неопределено,
			Параметры.Форма,
			Неопределено,
			ПараметрыОперации);
		
	КонецЕсли
	
КонецПроцедуры

// Определяет алгоритм, выполняющийся при нажатии команды на форме QR-кода.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма отображения QR-кода.
//  Команда - КомандаФормы - выполняемая команда.
//  ДанныеПлатежнойСсылки - Структура - параметры выполнения команды:
//    * ПлатежнаяСсылка - Строка - ссылка сформированная по данным документа операции.
//    * QRКод - ДвоичныеДанные - данные изображения QR-кода.
//    * ОснованиеПлатежа - ОпределяемыйТип.ДокументОперацииСБП - документ, который отражает
//      оплату в информационной базе.
//
Процедура ПриОбработкеНажатияКоманды(
		Форма,
		Команда,
		ДанныеПлатежнойСсылки) Экспорт
	
	
КонецПроцедуры

// Определяет алгоритм, выполняющийся при закрытии формы отображения QR-кода.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма отображения QR-кода.
//
Процедура ПриЗакрытииФормыQRКода(Форма) Экспорт
	
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, Форма);
	
КонецПроцедуры

#КонецОбласти

#Область ФормаПодключениеКассовойСсылки

// Определяет алгоритм, выполняющийся при открытии подключения кассовой ссылки.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма подключения кассовой ссылки.
//  Отказ - Булево - признак отказа от открытия формы.
//
Процедура ПриОткрытииФормыПодключенияСсылки(
		Форма,
		Отказ) Экспорт
	
	
	
КонецПроцедуры

// Определяет алгоритм, выполняющийся при открытии подключения кассовой ссылки.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма подключения кассовой ссылки.
//  ИмяСобытия - Строка - может быть использовано для идентификации сообщений
//    принимающими их формами.
//  Параметр - Произвольный - могут быть переданы любые необходимые данные для обработки.
//  Источник - Произвольный - источник события, например, в качестве источника может быть
//   указана другая форма.
//  Подключить - Булево - если устанавливается значение Истина, будет выполнена попытка
//   подключения ссылки.
//
Процедура ОбработкаОповещенияФормыПодключенияСсылки(
		Форма,
		ИмяСобытия,
		Параметр,
		Источник,
		Подключить) Экспорт
	
	
	
КонецПроцедуры

// Определяет алгоритм, выполняющийся при закрытии формы подключения кассовой ссылки.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма подключения кассовой ссылки.
//  ЗавершениеРаботы - Булево - признак завершения работы.
//
Процедура ПриЗакрытииФормыПодключенияСсылки(
		Форма,
		ЗавершениеРаботы) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
