// Содержимое модуля отличается в версиях ПРОФ и КОРП.
// В версии ПРОФ отсутствует:
// - тело экспортных процедур (остаются только сигнатуры методов)
// - неэкспортные процедуры и все функции.
// Поэтому не допускается реализация в модуле экспортных функций: вместо них следует использовать процедуры с возвращаемым параметром.

Процедура ПечатьРегламентированногоОтчета(Ссылка, ИмяМакетаДляПечати, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.УведомлениеОКонтролируемыхСделках") Тогда
		
		СтандартнаяОбработка = Ложь;
		Если Не ЗначениеЗаполнено(Ссылка) Тогда 
			Возврат;
		КонецЕсли;
		
		ПараметрыПечати = Новый Структура("Уведомление", Ссылка);
		ОткрытьФорму("Документ.УведомлениеОКонтролируемыхСделках.Форма.ФормаПечатиУведомления", ПараметрыПечати);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыгрузкаРегламентированногоОтчета(Ссылка) Экспорт
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.УведомлениеОКонтролируемыхСделках") Тогда
		
		ПараметрыФормы = Новый Структура("Уведомление", Ссылка);
		ОткрытьФорму("Обработка.ПомощникПодготовкиУведомленияОКонтролируемыхСделках.Форма.Форма", ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СозданиеРегламентированногоОтчета(Организация, Тип, СтандартнаяОбработка) Экспорт
	
	Если Тип = Тип("ДокументСсылка.УведомлениеОКонтролируемыхСделках") Тогда
		
		ПараметрыФормы = Новый Структура("Организация", Организация);
		ОткрытьФорму("Обработка.ПомощникПодготовкиУведомленияОКонтролируемыхСделках.Форма.Форма", ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура НалоговыеОрганыГруппОбособленныхПодразделений(Форма, Команда) Экспорт
	
	ОткрытьФорму("РегистрСведений.НастройкиУчетаНалогаНаПрибыльГруппОбособленныхПодразделений.Форма.ИФНСОтветственныхПодразделений",
		Новый Структура("Организация", Форма.ГоловнаяОрганизация),
		,
		Форма.ГоловнаяОрганизация);
	
КонецПроцедуры

Процедура СоздатьАвизоПоМПЗВходящее(СтруктураПараметров, Форма) Экспорт
	
	ОткрытьФорму("Документ.АвизоМПЗВходящее.ФормаОбъекта", СтруктураПараметров, Форма);
	
КонецПроцедуры

Процедура СоздатьАвизоПоМПЗИсходящее(СтруктураПараметров, Форма) Экспорт
	
	ОткрытьФорму("Документ.АвизоМПЗИсходящее.ФормаОбъекта", СтруктураПараметров, Форма);
	
КонецПроцедуры

// См. РегламентированнаяОтчетностьКлиентПереопределяемый.ДобавитьПрикладныеФормыОтправкаОтчетов
Процедура ДобавитьПрикладныеФормыОтправкаОтчетов(ИменаФорм) Экспорт
	
	ИменаФорм.Добавить("Обработка.ДекларацииНалогНаПрибыльОбособленныеПодразделения.Форма.Форма");
	
КонецПроцедуры