////////////////////////////////////////////////////////////////////////////////
// Подсистема "Электронный документооборот с контролирующими органами".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Срабатывает после записи объекта ДокументРеализацииПолномочийНалоговыхОрганов, когда уже записаны его файлы.
//
// Параметры:
//  Ссылка	 - ДокументСсылка.ДокументРеализацииПолномочийНалоговыхОрганов - Входящее сообщение от ФНС
//  Файлы	 - Массив структур - Массив описания вложений документа - структура 
//       * Адрес - Строка - Адрес во временном хранилище
//       * ИмяФайла - Строка - Имя файла с расширением
//
Процедура ПослеЗаписиДокументаРеализацииПолномочийНалоговыхОрганов(Ссылка, Файлы) Экспорт
	СверкаСФНСПоИмущественнымНалогам.ПослеЗаписиДокументаРеализацииПолномочийНалоговыхОрганов(Ссылка, Файлы);
КонецПроцедуры

// Определяет наличие в конфигурации-потребителе механизма сверки имущественных налогов.
//
// Параметры:
//  РеализованаСверка - Булево - параметр будет установлен в Истина, если в конфигурации предусмотрена сверка
//
Процедура ПроверитьРеализованаСверкаИмущественныхНалогов(РеализованаСверка) Экспорт
	РеализованаСверка = Истина;
КонецПроцедуры

// Указывает, поддерживает ли конфигурация тариф Промо ЕНС
//
// Параметры:
//  Поддерживает - Булево - Если конфигурация поддерживает тариф Промо ЕНС, то присваивать Поддерживает = Истина
//
Процедура КонфигурацияПоддерживаетТарифПромоЕНС(Поддерживает) Экспорт

	Поддерживает = Истина;

КонецПроцедуры

// Указывает, поддерживает ли конфигурация возможность оформления платежных поручений
//
// Параметры:
//  ПоддерживаетСоздание - Булево
//  ПоддерживаетВыгрузку - Булево
//
Процедура КонфигурацияПоддерживаетПлатежныеПоручения(ПоддерживаетСоздание, ПоддерживаетВыгрузку) Экспорт
	
	ПоддерживаетСоздание = Истина;
	ПоддерживаетВыгрузку = Истина;
	
КонецПроцедуры

// Формирует документы вида "Платежное поручение" на основе переданных реквизитов
//
// Параметры:
//  ДокументКонтролирующегоОргана - Ссылка - ссылка на объект основание (справочник)
//  РеквизитыПлатежныхПоручений - Массив из Структура
//      * Организация - СправочникСсылка.Организации - плательщик
//      * КодНО - Строка - код налогового органа
//      * ИНН - Строка - ИНН организации, полученный в результате обработки исходных данных
//      * КПП - Строка - КПП организации
//      * Сумма - Число - сумма платежного поручения
//      * КБК - Строка - код бюджетной классификации
//      * ОКТМО - Строка
//      * Статус - Строка - статус платежного поручения
//      * УИН - Строка - идентификатор платежа
//      * БИК - Строка - код банка получателя
//      * БанкНаименование - Строка - наименование банка получателя
//      * КоррСчет - Строка - корреспондентский счет банка получателя
//      * РасчетныйСчет - Строка - расчетный счет получателя
//      * ИННПолучателя - Строка - ИНН получателя платежа
//      * КПППолучателя - Строка - КПП получателя платежа
//      * НаименованиеПолучателя - Строка - наименование получателя
//  МассивПлатежныхПоручений - Массив из Ссылка - ссылки на сформированные документы платежей в потребителе
//  ТекстОшибки - Строка - описание ошибки, если не удалось сфомировать документы
//
Процедура СформироватьПлатежныеПоручения(ДокументКонтролирующегоОргана, РеквизитыПлатежныхПоручений, МассивПлатежныхПоручений, ТекстОшибки) Экспорт
	
	МассивПлатежныхПоручений = Документы.ПлатежноеПоручение.СформироватьПлатежныеПорученияВБюджет(
		РеквизитыПлатежныхПоручений, ТекстОшибки);
	
КонецПроцедуры

// Определяет, нужно ли скрывать элементы создания заявлений ЕГРЮЛ и ЕГРИП в форме 1С-Отчетность
//
// Параметры:
//  Скрыть	 - Булево - По умолчанию = Ложь
//
Процедура СкрытьЗаявленияЕГРЮЛ_ЕГРИП(Скрыть) Экспорт
КонецПроцедуры

#КонецОбласти