///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2018, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
// @strict-types

#Область ПрограммныйИнтерфейс

// Формирует список шаблонов заданий очереди.
// @skip-warning ПустойМетод - переопределяемый метод.
//
// Параметры:
//  ШаблоныЗаданий - Массив Из Строка - В параметр следует добавить имена предопределенных
//   неразделенных регламентных заданий, которые должны использоваться в качестве
//   шаблонов для заданий очереди.
//
Процедура ПриПолученииСпискаШаблонов(ШаблоныЗаданий) Экспорт
	
	ЗарплатаКадры.ПриПолученииСпискаШаблоновОчередиЗаданий(ШаблоныЗаданий);
	
	// ЭлектронноеВзаимодействие
	ЭлектронноеВзаимодействие.ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	// Конец ЭлектронноеВзаимодействие
	
	ОбщегоНазначенияБРО.ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	
	// РаспознаваниеДокументов
	РаспознаваниеДокументов.ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	// КонецРаспознаваниеДокументов
	
	ИнтеграцияАУСН.ПриПолученииСпискаШаблоновОчередиЗаданий(ШаблоныЗаданий);
	
	МенеджерОборудования.ПриПолученииСпискаШаблонов(ШаблоныЗаданий); 
	
	// ГосИС
	ИнтеграцияЕГАИС.ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	
	ИнтеграцияВЕТИС.ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	
	ИнтеграцияИСМП.ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	
	ИнтеграцияЗЕРНО.ПриПолученииСпискаШаблонов(ШаблоныЗаданий); 
	
	ИнтеграцияСАТУРН.ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
    //Конец ГосИС
	
	// РекламныйСервис
	РекламныйСервис.ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	// Конец РекламныйСервис
	
КонецПроцедуры

// Заполняет соответствие имен методов их псевдонимам для вызова из очереди заданий.
// @skip-warning ПустойМетод - переопределяемый метод.
//
// Параметры:
//  СоответствиеИменПсевдонимам - Соответствие из КлючИЗначение:
//    * Ключ - Строка - псевдоним метода, например "ОчиститьОбластьДанных".
//    * Значение - Строка - Имя метода для вызова, например "РаботаВМоделиСервиса.ОчиститьОбластьДанных".
//        В качестве значения можно указать Неопределено, в этом случае считается что имя 
//        совпадает с псевдонимом.
//
Процедура ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам) Экспорт
	
	ОбщегоНазначенияБРО.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	ЗарплатаКадры.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.ОбновлениеЗадачБухгалтера.ИмяМетода);
	СоответствиеИменПсевдонимам.Вставить(ИнтеграцияСБанками.ИмяМетодаФоновойАктуализации());
	
	ОбменДаннымиСВнешнимиСистемамиБПИнтеграцияПодсистем.ЗарегистрироватьРегламентноеЗаданиеОчередиЗаданий(СоответствиеИменПсевдонимам);
	
	РегистрыСведений.КассовыеЧекиПодотчетныхЛицЗапросыДетальныхДанных.ЗарегистрироватьМетодОчередиЗаданий(
		СоответствиеИменПсевдонимам);
		
	ШинаМобильныхПриложений.ЗарегистрироватьМетодОчередиЗаданий(СоответствиеИменПсевдонимам);
	
	// ЭлектронноеВзаимодействие
	ЭлектронноеВзаимодействие.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	// Конец ЭлектронноеВзаимодействие
	
	СоответствиеИменПсевдонимам.Вставить("ИнтернетПоддержкаПользователейБП.УстановитьВидимостьНовостейРазделов");
	
	УниверсальныйОбменСБанками.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	
	// РаспознаваниеДокументов
	РаспознаваниеДокументов.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	// КонецРаспознаваниеДокументов
	
	ОплатаСервисаПлатежнаяСистемаЮKassaБП.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	
	ИнтеграцияАУСН.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.ПроверкаРНПТ.ИмяМетода);
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.ОбменССервисомСверкиРасчетов.ИмяМетода);
	
	МенеджерОборудования.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	
	// Регламентные задания ГосИС
	
	ИнтеграцияСАТУРН.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	ИнтеграцияЕГАИС.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	ИнтеграцияВЕТИС.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	ИнтеграцияИСМП.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	ИнтеграцияЗЕРНО.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);

	// Конец Регламентые задания ГосИС

	УчетКассовыхЧековПодотчетныхЛиц.ЗарегистрироватьМетодОчередиЗаданий(СоответствиеИменПсевдонимам);
	
	// РекламныйСервис
	РекламныйСервис.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	// Конец РекламныйСервис
	
	ЗадачиБухгалтераСтатистика.ЗарегистрироватьМетодОчередиЗаданий(СоответствиеИменПсевдонимам);
	
КонецПроцедуры

// Заполняет соответствие методов обработчиков ошибок псевдонимам методов, при возникновении
// ошибок в которых они вызываются.
// @skip-warning ПустойМетод - переопределяемый метод.
//
// Параметры:
//  ОбработчикиОшибок - Соответствие из КлючИЗначение:
//    * Ключ - Строка - Псевдоним метода, например ОчиститьОбластьДанных.
//    * Значение - Строка - Имя метода - обработчика ошибок, для вызова при возникновении ошибки. 
//        Обработчик ошибок вызывается в случае завершения выполнения исходного задания
//        с ошибкой. Обработчик ошибок вызывается в той же области данных, что и исходное задание.
//        Метод обработчика ошибок считается разрешенным к вызову механизмами очереди.
//        Параметры обработчика ошибок:
//          ПараметрыЗадания - Структура - параметры задания очереди.
//          Параметры
//          НомерПопытки
//          КоличествоПовторовПриАварийномЗавершении
//          ДатаНачалаПоследнегоЗапуска.
//
Процедура ПриОпределенииОбработчиковОшибок(ОбработчикиОшибок) Экспорт
КонецПроцедуры

// Формирует таблицу регламентных заданий с признаком использования в модели сервиса.
// @skip-warning ПустойМетод - переопределяемый метод.
// 
// Параметры:
//  ТаблицаИспользования - ТаблицаЗначений - описание:
//	* РегламентноеЗадание - Строка - имя регламентного задания.
//  * Использование - Булево - признак использования.
//
Процедура ПриОпределенииИспользованияРегламентныхЗаданий(ТаблицаИспользования) Экспорт
КонецПроцедуры

#КонецОбласти
