
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыОткрытия = ОбщегоНазначенияБПКлиентСервер.ПараметрыОткрытияФормыСОжиданием(ПараметрыВыполненияКоманды);
	ПараметрыОткрытия.Заголовок = НСтр("ru = 'Поступление в аренду'");
	ПараметрыОткрытия.ИмяФормы = "Документ.ПоступлениеВАренду.ФормаСписка";
	ПараметрыОткрытия.Уникальность = "ФормаСписка_ПоступлениеВАренду";
	ПараметрыОткрытия.ЗамерПроизводительности = "СозданиеФормыСпискаПоступлениеВАренду";
	
	Отбор = Новый Структура;
	Отбор.Вставить("ВидОперации", 
		ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВАренду.ПоступлениеВАренду"));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", ПараметрыОткрытия.Заголовок);
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	ОбщегоНазначенияБПКлиент.ОткрытьФормуСОжиданием(ПараметрыОткрытия, ПараметрыФормы);
	
КонецПроцедуры
