#Область ПрограммныйИнтерфейс
// Возвращает данные по идентификатору данных и переданным параметрам.
//
// Параметры:
//  ИсключаемыеБаннеры - Массив - ожидается его заполнение идентификаторами исключаемых из показа баннеров.
//  Организация - СправочникСсылка.Организации - Организация, условие для исключение баннера.
//  ТекущаяДата - Дата - Дата, условие для исключение баннера.
//  
Процедура ЗаполнитьМассивИсключаемыхБаннеров(ИсключаемыеБаннеры, Организация, ТекущаяДата) Экспорт
	
	
	
КонецПроцедуры

// Возвращает данные по идентификатору данных и переданным параметрам.
//
// Параметры:
//  СписокБаннеров - Таблица - описания баннеров.
//  Размещение - Строка - Идентификатор формы по которой нужно показать баннер. см. функции ИмяРазмещения...().
//
Процедура ПодключитьБаннеры(СписокБаннеров, Размещение) Экспорт
	
КонецПроцедуры

// Возвращает данные по идентификатору данных и переданным параметрам.
//
// Параметры:
//  Запрос - Запрос, который дополняется выборками к баннерам.
//  СтруктураБаннеров - Структура - идентификатор и описание баннера.
//  НомераТаблиц - Структура - указывает на индексы таблиц результата запроса.
//  ДанныеБаннеров - Структура - собирает данные из обращений к базе данных.
//  СтруктураПараметров - Структура - параметры обращения к подсистеме баннеров.
//
Процедура ПолучитьДанныеБаннеров(Запрос, СтруктураБаннеров, НомераТаблиц, ДанныеБаннеров, СтруктураПараметров) Экспорт
	
	
КонецПроцедуры

// Находит баннер по идентификатору.
//
// Параметры:
//  Идентификатор - Строка - идентификатор баннера.
//  ЭтоИдентификаторПереопределяемогоБаннера - Булево - признак завершения выполнения метода.
//
Процедура ИдентификаторБаннера(Идентификатор, ЭтоИдентификаторПереопределяемогоБаннера) Экспорт
	
	
КонецПроцедуры

// Проверяет условия вывода баннера на форму.
//
// Параметры:
//  ДанныеБаннера - Структура - собирает данные из обращений к базе данных.
//  Баннер - Структура - описание баннера.
//  Идентификатор - Строка - идентификатор баннера.
//  ВыполняетсяУсловиеПереопределяемогоБаннера - Булево - признак завершения выполнения метода.
//
Процедура ВыполняетсяУсловиеБаннера(ДанныеБаннера, Баннер, Идентификатор, ВыполняетсяУсловиеПереопределяемогоБаннера) Экспорт
	
	
	
КонецПроцедуры

// Заполняет выводимые баннером данные.
//
// Параметры:
//  ДанныеБаннера - Структура - собирает данные из обращений к базе данных.
//  Баннер - Строка таблицы - описание баннера.
//
Процедура ЗаполнитьДанныеБаннера(ДанныеБаннера, Баннер) Экспорт
	
	
	
КонецПроцедуры

// Дополняет массив разделов по индентификаторам баннеров.
//
// Параметры:
//  МассивРазделов - Массив - разделы баннеров.
//  МассивИдентификаторовБаннеров - Массив - идентификаторы баннеров. 
//
Процедура РазделыПерсонализированныхДанных(МассивРазделов, МассивИдентификаторовБаннеров) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

