
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Владелец = Параметры.Владелец;
	СписокВидовСчетов.Добавить("БанковскийСчет", НСтр("ru = 'Банковский счет'"));
	СписокВидовСчетов.Добавить("СчетЦифровогоРубля", НСтр("ru = 'Кошелек цифрового рубля'"));

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийСпискаФормы

&НаКлиенте
Процедура СписокВидовСчетовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтрокаСписка = СписокВидовСчетов.НайтиПоИдентификатору(ВыбраннаяСтрока);
	ВыбранныйВид = СтрокаСписка.Значение;
	
	Результат = Новый Структура("ЦифровойСчет", Ложь);
	
	Если ВыбранныйВид = "СчетЦифровогоРубля" Тогда
		Результат.ЦифровойСчет = Истина;
	КонецЕсли;
	
	Закрыть(Результат);

КонецПроцедуры

#КонецОбласти
