#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РедактированиеНастроек = Справочники.НастройкиУчетаЗатрат.ПрименитьПараметрыФормыНастроек(ЭтотОбъект, Счет);
	
	ЗаполнитьСодержимоеФормы(РедактированиеНастроек);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	РезультатФормы = Неопределено;
	
	Если Модифицированность Тогда
		РезультатФормы = УстановитьВыполненныеНастройки(АдресРедактированиеНастроек, ВариантУчетаТранспортныхРасходов, Счет);
	КонецЕсли;
	
	Закрыть(РезультатФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСодержимоеФормы(РедактированиеНастроек)
	
	ВариантУчетаТранспортныхРасходов = РедактированиеНастроек.Настройки.Закрытие[Счет].НеРаспределятьЗатратыНаДоставку;
	
	УстановитьЗаголовокВариантУчета(Элементы.ЗаголовокГруппыПереключателей, Счет);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьЗаголовокВариантУчета(ЗаголовокПереключателей, Счет)
	
	ЗаголовокПереключателей.Заголовок = СтрШаблон(
		НСтр("ru = 'На счете %1 затраты на доставку товаров от поставщика включаются в состав расходов на продажу:'"),
		ПланыСчетов.Хозрасчетный.ПолноеПредставлениеСчета(Счет));
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция УстановитьВыполненныеНастройки(Знач АдресРедактированиеНастроек, Знач ВариантУчетаТранспортныхРасходов, Знач Счет)
	
	РедактированиеНастроек = Справочники.НастройкиУчетаЗатрат.НачатьУстановкуВыполненныхНастроек(АдресРедактированиеНастроек);
	
	РедактированиеНастроек.Настройки.Закрытие[Счет].НеРаспределятьЗатратыНаДоставку = ВариантУчетаТранспортныхРасходов;
	
	Возврат Справочники.НастройкиУчетаЗатрат.ЗавершитьУстановкуВыполненныхНастроек(
		АдресРедактированиеНастроек,
		РедактированиеНастроек);
	
КонецФункции

#КонецОбласти
