
#Область СлужебныйПрограммныйИнтерфейс

Функция ПодготовитьДанныеКЗагрузкеНаСервере(ПараметрыОтчета, УникальныйИдентификатор) Экспорт
	
	Результат = ДлительныеОперации.ЗапуститьВыполнениеВФоне(УникальныйИдентификатор, "ОбменСМаркетплейс.ЗагрузитьОтчетОПродажах", 
		ПараметрыОтчета, НСтр("ru = 'Загрузка отчета из маркетплейс'"));
		
	Возврат Результат;
	
КонецФункции

Функция ДоступенОбменСМаркетплейс() Экспорт
	
	Если РольДоступна("ПолныеПрава") Или РольДоступна("ДобавлениеИзменениеДанныхБухгалтерии") Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти
