///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Обработать данные операции.
// 
// Параметры:
//  Параметры - см. ЭлектронныеСертификатыНСПККлиентСервер.ПараметрыВыполненияОперацииНаСервере
//  РезультатВыполнения - Структура
Процедура ОбработатьДанныеОперации(Знач Параметры, РезультатВыполнения) Экспорт
	
	РезультатВыполнения = ЭлектронныеСертификатыНСПК.ОбработатьРезультатВыполненияНаСервере(Параметры);
		
КонецПроцедуры

// Обработать данные товарной позиции, на сервере, для использования в Web-клиенте
//
// Параметры:
//  ТоварныеПозиции - Массив из Структура
//
// Возвращаемое значение:
//  Строка
Функция ПолучитьJSONТоварныеПозиции(ТоварныеПозиции) Экспорт
	
	Возврат ЭлектронныеСертификатыНСПККлиентСервер.ПолучитьJSONТоварныеПозиции(ТоварныеПозиции);
	
КонецФункции

#КонецОбласти
