
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция СвойстваСчета(Счет) Экспорт
	
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Счет, "Организация");
	
	СвойстваСчета = РегистрыСведений.СчетНаОплатуПокупателюОплатаСервиса.СоздатьМенеджерЗаписи();
	СвойстваСчета.Организация = Организация;
	СвойстваСчета.СчетНаОплатуПокупателю = Счет;
	СвойстваСчета.Прочитать();
	
	Возврат СвойстваСчета;
	
КонецФункции

#КонецОбласти

#КонецЕсли
