#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает источник разметки АУСН, используемый по умолчанию
//
// Возвращаемое значение:
//  ПеречислениеСсылка.ИсточникиРазметкиАУСН - источник
Функция ИсточникПоУмолчанию() Экспорт
	
	Возврат Перечисления.ИсточникиРазметкиАУСН.Программа;
	
КонецФункции

// Возвращает идентификатор источника АУСН
//
// Параметры:
//  Источник - ПеречислениеСссылка.ИсточникиРазметкиАУСН
//
// Возвращаемое значение:
//  Число - числовой идентификатор источника
//
Функция Идентификатор(Источник) Экспорт
	
	Если Не ЗначениеЗаполнено(Источник) Тогда
		Источник = ИсточникПоУмолчанию();
	КонецЕсли;
	
	ВсеИсточники = ВсеИсточники();
	Идентификатор = ВсеИсточники.Получить(Источник);
	Если Не ЗначениеЗаполнено(Идентификатор) Тогда
		Идентификатор = 0;
	КонецЕсли;
	
	Возврат Идентификатор;
	
КонецФункции


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВсеИсточники()
	
	Источники = Новый Соответствие;
	Источники.Вставить(Программа, 1);
	Источники.Вставить(Банк, 2);
	
	Возврат Источники; 
	
КонецФункции

#КонецОбласти


#КонецЕсли