#Область ПрограммныйИнтерфейс

#Область ФормированиеЗаписейРаздела7ДекларацииНДС

// В процедуре отбираются необлагаемые НДС операции и подтверждающие документы
//
// Параметры:
//	СтруктураПараметров - Структура - Организация, дата.
//	ДанныеДляЗаполнения - Структура - две таблицы: НеоблагаемыеНДСОперации, ПодтверждающиеДокументы.
//  АдресХранилища - Строка - адрес временного хранилища для помещения результата выполнения.
//
Процедура ЗапросПоДаннымЗаполнения7РазделаДекларацииПоНДС(СтруктураПараметров, ДанныеДляЗаполнения, АдресХранилища) Экспорт
	
	НеоблагаемыеНДСОперации = ДанныеДляЗаполнения.НеоблагаемыеНДСОперации;
	ПодтверждающиеДокументы = ДанныеДляЗаполнения.ПодтверждающиеДокументы;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", СтруктураПараметров.Организация);
	Запрос.УстановитьПараметр("ДатаГраница", Новый Граница(КонецДня(СтруктураПараметров.Дата), ВидГраницы.Включая));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НДСНеоблагаемыеОперацииОстатки.Организация КАК Организация,
	|	НДСНеоблагаемыеОперацииОстатки.КодОперации КАК КодОперации,
	|	НДСНеоблагаемыеОперацииОстатки.Контрагент КАК Контрагент,
	|	НДСНеоблагаемыеОперацииОстатки.ДокументРеализации КАК ДокументРеализации,
	|	СУММА(НДСНеоблагаемыеОперацииОстатки.СуммаРеализацииБезНДСОстаток) КАК СуммаРеализацииБезНДСОстаток,
	|	СУММА(НДСНеоблагаемыеОперацииОстатки.СуммаПриобретенияБезНДСОстаток) КАК СуммаПриобретенияБезНДСОстаток,
	|	СУММА(НДСНеоблагаемыеОперацииОстатки.СуммаНДСНеПодлежащаяВычетуОстаток) КАК СуммаНДСНеПодлежащаяВычетуОстаток,
	|	НДСНеоблагаемыеОперацииОстатки.ДокументРеализации.Дата
	|ПОМЕСТИТЬ НеоблагаемыеОперацииПредварительная
	|ИЗ
	|	РегистрНакопления.НДСНеоблагаемыеОперации.Остатки(&ДатаГраница, Организация = &Организация) КАК НДСНеоблагаемыеОперацииОстатки
	|ГДЕ
	|	НДСНеоблагаемыеОперацииОстатки.СуммаРеализацииБезНДСОстаток > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	НДСНеоблагаемыеОперацииОстатки.ДокументРеализации,
	|	НДСНеоблагаемыеОперацииОстатки.Контрагент,
	|	НДСНеоблагаемыеОперацииОстатки.КодОперации,
	|	НДСНеоблагаемыеОперацииОстатки.Организация,
	|	НДСНеоблагаемыеОперацииОстатки.ДокументРеализации.Дата
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Контрагент,
	|	ДокументРеализации,
	|	КодОперации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НеоблагаемыеОперацииПредварительная.ДокументРеализации КАК ДокументРеализации,
	|	НеоблагаемыеОперацииПредварительная.КодОперации КАК КодОперации,
	|	НеоблагаемыеОперацииПредварительная.Контрагент КАК Контрагент,
	|	НеоблагаемыеОперацииПредварительная.СуммаРеализацииБезНДСОстаток КАК СуммаРеализации,
	|	НеоблагаемыеОперацииПредварительная.СуммаПриобретенияБезНДСОстаток КАК СуммаПриобретения,
	|	НеоблагаемыеОперацииПредварительная.СуммаНДСНеПодлежащаяВычетуОстаток КАК НДС,
	|	ДокументыПоНеоблагаемымНДСОперациям.ТипПодтверждающегоДокумента КАК ТипДокумента,
	|	ДокументыПоНеоблагаемымНДСОперациям.НомерДокумента КАК НомерДокумента,
	|	ДокументыПоНеоблагаемымНДСОперациям.ДатаДокумента КАК ДатаДокумента,
	|	ВЫБОР
	|		КОГДА ДокументыПоНеоблагаемымНДСОперациям.ТипПодтверждающегоДокумента = ЗНАЧЕНИЕ(Справочник.ТипыДокументов.Договор)
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ПорядокДокументов,
	|	ДокументыПоНеоблагаемымНДСОперациям.КодОперации.Код КАК КодОперацииКод,
	|	ДокументыПоНеоблагаемымНДСОперациям.КодОперации.Наименование КАК КодОперацииНаименование,
	|	ВЫБОР
	|		КОГДА ДокументыПоНеоблагаемымНДСОперациям.КодОперации.ВключаетсяВРеестрПодтверждающихДокументов
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ВключаетсяВРеестрСортировка,
	|	ВЫБОР
	|		КОГДА ДокументыПоНеоблагаемымНДСОперациям.КодОперации.ОперацияНеПодлежитНалогообложению
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК СТ149Сортировка
	|ИЗ
	|	НеоблагаемыеОперацииПредварительная КАК НеоблагаемыеОперацииПредварительная
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыПоНеоблагаемымНДСОперациям КАК ДокументыПоНеоблагаемымНДСОперациям
	|		ПО НеоблагаемыеОперацииПредварительная.Организация = ДокументыПоНеоблагаемымНДСОперациям.Организация
	|			И НеоблагаемыеОперацииПредварительная.Контрагент = ДокументыПоНеоблагаемымНДСОперациям.Контрагент
	|			И НеоблагаемыеОперацииПредварительная.ДокументРеализации = ДокументыПоНеоблагаемымНДСОперациям.ДокументРеализации
	|			И НеоблагаемыеОперацииПредварительная.КодОперации = ДокументыПоНеоблагаемымНДСОперациям.КодОперации
	|
	|УПОРЯДОЧИТЬ ПО
	|	СТ149Сортировка,
	|	ВключаетсяВРеестрСортировка,
	|	КодОперацииКод,
	|	КодОперацииНаименование,
	|	НеоблагаемыеОперацииПредварительная.ДокументРеализацииДата,
	|	ПорядокДокументов
	|ИТОГИ
	|	МАКСИМУМ(СуммаРеализации),
	|	МАКСИМУМ(СуммаПриобретения),
	|	МАКСИМУМ(НДС),
	|	МАКСИМУМ(ТипДокумента),
	|	МАКСИМУМ(НомерДокумента),
	|	МАКСИМУМ(ДатаДокумента)
	|ПО
	|	КодОперации,
	|	Контрагент,
	|	ДокументРеализации";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда 
		ДанныеДляЗаполнения.Вставить("НеоблагаемыеНДСОперации",         НеоблагаемыеНДСОперации);
		ДанныеДляЗаполнения.Вставить("ПодтверждающиеДокументы",         ПодтверждающиеДокументы);
		ПоместитьВоВременноеХранилище(ДанныеДляЗаполнения, АдресХранилища);
		Возврат;
	КонецЕсли;
	
	ВыборкаПоКодам = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПоКодам.Следующий() Цикл
		
		ВыборкаПоКонтрагентам = ВыборкаПоКодам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоКонтрагентам.Следующий() Цикл
			
			ВыборкаПоДокументам = ВыборкаПоКонтрагентам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоДокументам.Следующий() Цикл
				
				КлючСтроки = Новый УникальныйИдентификатор;
				
				СтрокаНеоблагаемыеНДСОперации = НеоблагаемыеНДСОперации.Добавить();
				СтрокаНеоблагаемыеНДСОперации.КодОперации = ВыборкаПоДокументам.КодОперации;
				СтрокаНеоблагаемыеНДСОперации.ДокументРеализации = ВыборкаПоДокументам.ДокументРеализации;
				СтрокаНеоблагаемыеНДСОперации.Контрагент = ВыборкаПоДокументам.Контрагент;
				СтрокаНеоблагаемыеНДСОперации.СуммаРеализации = ВыборкаПоДокументам.СуммаРеализации;
				СтрокаНеоблагаемыеНДСОперации.СуммаПриобретения = ВыборкаПоДокументам.СуммаПриобретения;
				СтрокаНеоблагаемыеНДСОперации.НДСПрямой= ВыборкаПоДокументам.НДС;
				СтрокаНеоблагаемыеНДСОперации.КлючСтроки = КлючСтроки;
				
				ВыборкаПоСтрокам = ВыборкаПоДокументам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				ИндексДокумента = 0;
				ПодтверждающиеДокументыПредставление = "";
				КоличествоПодтверждающихДокументов = ВыборкаПоСтрокам.Количество();
				Пока ВыборкаПоСтрокам.Следующий() Цикл
					Если ЗначениеЗаполнено(ВыборкаПоСтрокам.ТипДокумента) Тогда 
						СтрокаПодтверждающиеДокументы = ПодтверждающиеДокументы.Добавить();
						СтрокаПодтверждающиеДокументы.ТипДокумента   = ВыборкаПоСтрокам.ТипДокумента;
						СтрокаПодтверждающиеДокументы.НомерДокумента = ВыборкаПоСтрокам.НомерДокумента;
						СтрокаПодтверждающиеДокументы.ДатаДокумента  = ВыборкаПоСтрокам.ДатаДокумента;
						СтрокаПодтверждающиеДокументы.КлючСтроки     = КлючСтроки;
						Если ИндексДокумента = 2 Тогда
							ПодтверждающиеДокументыПредставление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
								НСтр("ru = '%1 и еще %2'"),
								ПодтверждающиеДокументыПредставление, 
								КоличествоПодтверждающихДокументов - 2);
							
						ИначеЕсли ИндексДокумента < 2 Тогда
							ПодтверждающиеДокументыПредставление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
								НСтр("ru = '%1%2%3 №%4 от %5'"),
								ПодтверждающиеДокументыПредставление, 
								?(ЗначениеЗаполнено(ПодтверждающиеДокументыПредставление), ";", ""),
								Строка(ВыборкаПоСтрокам.ТипДокумента),
								ВыборкаПоСтрокам.НомерДокумента,
								Формат(ВыборкаПоСтрокам.ДатаДокумента,"ДЛФ=D"));
						КонецЕсли;
						ИндексДокумента = ИндексДокумента + 1;
					КонецЕсли;
				КонецЦикла;
				Если КоличествоПодтверждающихДокументов = 0 Тогда
					СтрокаНеоблагаемыеНДСОперации.ПодтверждающиеДокументыПредставление = "<...>";
				Иначе
					СтрокаНеоблагаемыеНДСОперации.ПодтверждающиеДокументыПредставление = ПодтверждающиеДокументыПредставление;
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Отдельно распределим включенный в стоимость НДС по кодам операций
	МассивКоэффициентов = НеоблагаемыеНДСОперации.ВыгрузитьКолонку("СуммаРеализации");
	РаспределитьНДСПоКодамРаздела7(СтруктураПараметров, НеоблагаемыеНДСОперации, МассивКоэффициентов);
	
КонецПроцедуры

// В процедуре распределяется НДС по кодам операции
//
// Параметры:
//	СтруктураПараметров - Структура - Организация, дата.
//	НеоблагаемыеНДСОперации - ТаблицаЗначений - таблица необлагаемых операций
//	МассивКоэффициентов - ТаблицаЗначений - колонка СуммаРеализации таблицы НеоблагаемыеНДСОперации
//
Процедура РаспределитьНДСПоКодамРаздела7(СтруктураПараметров, НеоблагаемыеНДСОперации, МассивКоэффициентов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", СтруктураПараметров.Организация);
	Запрос.УстановитьПараметр("ДатаГраница", Новый Граница(КонецДня(СтруктураПараметров.Дата), ВидГраницы.Включая));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(НДСНеоблагаемыеОперацииОстатки.СуммаНДСНеПодлежащаяВычетуОстаток) КАК НДС,
	|	НДСНеоблагаемыеОперацииОстатки.ДокументРеализации
	|ИЗ
	|	РегистрНакопления.НДСНеоблагаемыеОперации.Остатки(
	|			&ДатаГраница,
	|			Организация = &Организация
	|				И КодОперации = ЗНАЧЕНИЕ(Справочник.КодыОперацийРаздела7ДекларацииПоНДС.ПустаяСсылка)) КАК НДСНеоблагаемыеОперацииОстатки
	|ГДЕ
	|	НДСНеоблагаемыеОперацииОстатки.СуммаРеализацииБезНДСОстаток = 0
	|
	|СГРУППИРОВАТЬ ПО
	|	НДСНеоблагаемыеОперацииОстатки.ДокументРеализации";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		НДСКРаспределению = Выборка.НДС;
		Если НеоблагаемыеНДСОперации.Количество() > 0 Тогда 
			МассивРаспределеннаяСуммаНДС = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(НДСКРаспределению, МассивКоэффициентов);
			Для Инд = 0 По НеоблагаемыеНДСОперации.Количество() - 1 Цикл
				НеоблагаемыеНДСОперации[Инд].НДСРаспределенный = МассивРаспределеннаяСуммаНДС[Инд];
			КонецЦикла;
		КонецЕсли;
	Иначе
		Для Инд = 0 По НеоблагаемыеНДСОперации.Количество() - 1 Цикл
			НеоблагаемыеНДСОперации[Инд].НДСРаспределенный = 0;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ЗаписиКнигиПокупок

Функция ТекстЗапросаРеквизитыСчетовФактурПостановление735КнигаПокупок() Экспорт
	
	Возврат
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаписиКнигиПокупок.ДокументОснованиеСчетаФактуры КАК ДокументОснованиеСчетаФактуры
	|ПОМЕСТИТЬ СписокДокументовОснований
	|ИЗ
	|	ЗаписиКнигиПокупок КАК ЗаписиКнигиПокупок
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОснованиеСчетаФактуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЧПокупатели.СчетФактура КАК СчетФактура
	|ПОМЕСТИТЬ ВТ_СчетаФактурыИзПокупателейПоОтчетуКомиссионера
	|ИЗ
	|	Документ.ОтчетКомиссионераОПродажах.Покупатели КАК ТЧПокупатели
	|ГДЕ
	|	ТЧПокупатели.Ссылка.Проведен
	|	И НЕ ТЧПокупатели.Ссылка.ПометкаУдаления
	|	И ТЧПокупатели.Ссылка.Организация В(&Организация)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТЧПокупатели.СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаАванс)
	|					И (СчетФактураПолученный.Исправление
	|						ИЛИ СчетФактураПолученный.ИсправлениеСобственнойОшибки)
	|				ИЛИ СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаПоступление)
	|					И СФПолученныйДокументыОснования.ДокументОснование ССЫЛКА Документ.АвансовыйОтчет
	|				ИЛИ СчетФактураПолученный.ВозвратЧерезКомиссионера
	|			ТОГДА СФПолученныйДокументыОснования.Ссылка
	|		ИНАЧЕ СФПолученныйДокументыОснования.ДокументОснование
	|	КОНЕЦ КАК ДокументОснование,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
	|			ТОГДА СФПолученныйДокументыОснования.НомерИсходногоДокумента
	|		ИНАЧЕ СчетФактураПолученный.НомерВходящегоДокумента
	|	КОНЕЦ КАК НомерСчетаФактуры,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
	|			ТОГДА СФПолученныйДокументыОснования.ДатаИсходногоДокумента
	|		ИНАЧЕ СчетФактураПолученный.ДатаВходящегоДокумента
	|	КОНЕЦ КАК ДатаСчетаФактуры,
	|	СФПолученныйДокументыОснования.Ссылка КАК СчетФактураДокумент,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаАванс)
	|			ТОГДА ЕСТЬNULL(СФПолученныйАвансы.СтавкаНДС, НЕОПРЕДЕЛЕНО)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СтавкаНДСАванса,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаАванс)
	|			ТОГДА СчетФактураПолученный.ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ КАК ДоговорКонтрагента,
	|	СчетФактураПолученный.ВидСчетаФактуры КАК ВидСчетаФактуры,
	|	СчетФактураПолученный.Исправление КАК Исправление,
	|	СчетФактураПолученный.Контрагент КАК Контрагент,
	|	ЛОЖЬ КАК ЭтоСчетФактураВыданныйПокупателюПоОтчетуКомиссионера,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.СводныйКорректировочный
	|			ТОГДА СФПолученныйДокументыОснования.НомерСтроки
	|		КОГДА СчетФактураПолученный.СводныйКомиссионный
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НомерСтроки,
	|	СчетФактураПолученный.СводныйКорректировочный КАК СводныйКорректировочный,
	|	СчетФактураПолученный.СводныйКомиссионный КАК СводныйКомиссионный,
	|	СчетФактураПолученный.ВозвратЧерезКомиссионера КАК ВозвратЧерезКомиссионера
	|ПОМЕСТИТЬ ВТ_СчетаФактурыДокументыПромежуточная
	|ИЗ
	|	Документ.СчетФактураПолученный.ДокументыОснования КАК СФПолученныйДокументыОснования
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.Авансы КАК СФПолученныйАвансы
	|		ПО СФПолученныйДокументыОснования.Ссылка = СФПолученныйАвансы.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокДокументовОснований КАК СписокДокументовОснований
	|		ПО СФПолученныйДокументыОснования.ДокументОснование = СписокДокументовОснований.ДокументОснованиеСчетаФактуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокДокументовОснований КАК СписокСФОснований
	|		ПО СФПолученныйДокументыОснования.Ссылка = СписокСФОснований.ДокументОснованиеСчетаФактуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|		ПО СФПолученныйДокументыОснования.Ссылка = СчетФактураПолученный.Ссылка
	|ГДЕ
	|	ВЫБОР
	|			КОГДА СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаАванс)
	|						И (СчетФактураПолученный.Исправление
	|							ИЛИ СчетФактураПолученный.ИсправлениеСобственнойОшибки)
	|					ИЛИ СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаПоступление)
	|						И СФПолученныйДокументыОснования.ДокументОснование ССЫЛКА Документ.АвансовыйОтчет
	|					ИЛИ СчетФактураПолученный.ВозвратЧерезКомиссионера
	|				ТОГДА СписокСФОснований.ДокументОснованиеСчетаФактуры ЕСТЬ НЕ NULL 
	|			ИНАЧЕ СписокДокументовОснований.ДокументОснованиеСчетаФактуры ЕСТЬ НЕ NULL 
	|		КОНЕЦ
	|	И СчетФактураПолученный.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА (СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс)
	|				ИЛИ СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НалоговыйАгент))
	|				И (СчетФактураВыданный.Исправление
	|					ИЛИ СФВыданныйДокументыОснования.ДокументОснование ССЫЛКА Документ.ОтчетКомиссионераОПродажах)
	|			ТОГДА СФВыданныйДокументыОснования.Ссылка
	|		ИНАЧЕ СФВыданныйДокументыОснования.ДокументОснование
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.Корректировочный)
	|				ИЛИ СчетФактураВыданный.Исправление
	|			ТОГДА СчетФактураВыданный.НомерИсходногоДокумента
	|		ИНАЧЕ СчетФактураВыданный.Номер
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.Корректировочный)
	|				ИЛИ СчетФактураВыданный.Исправление
	|			ТОГДА СчетФактураВыданный.ДатаИсходногоДокумента
	|		ИНАЧЕ СчетФактураВыданный.Дата
	|	КОНЕЦ,
	|	СФВыданныйДокументыОснования.Ссылка,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс)
	|			ТОГДА ЕСТЬNULL(СФВыданныйАвансы.СтавкаНДС, НЕОПРЕДЕЛЕНО)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс)
	|				ИЛИ СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НалоговыйАгент)
	|			ТОГДА СчетФактураВыданный.ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ,
	|	СчетФактураВыданный.ВидСчетаФактуры,
	|	СчетФактураВыданный.Исправление,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.СводныйКомиссионный
	|			ТОГДА ЕСТЬNULL(СФВыданныйАвансы.Контрагент, СчетФактураВыданный.Контрагент)
	|		ИНАЧЕ СчетФактураВыданный.Контрагент
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_СчетаФактурыИзПокупателейПоОтчетуКомиссионера.СчетФактура ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.СводныйКомиссионный
	|			ТОГДА ЕСТЬNULL(СФВыданныйАвансы.НомерСтроки, СФВыданныйДокументыОснования.НомерСтроки)
	|		ИНАЧЕ СФВыданныйДокументыОснования.НомерСтроки
	|	КОНЕЦ,
	|	СчетФактураВыданный.СводныйКорректировочный,
	|	СчетФактураВыданный.СводныйКомиссионный,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СФВыданныйДокументыОснования
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.Авансы КАК СФВыданныйАвансы
	|		ПО СФВыданныйДокументыОснования.Ссылка = СФВыданныйАвансы.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СчетаФактурыИзПокупателейПоОтчетуКомиссионера КАК ВТ_СчетаФактурыИзПокупателейПоОтчетуКомиссионера
	|		ПО СФВыданныйДокументыОснования.Ссылка = ВТ_СчетаФактурыИзПокупателейПоОтчетуКомиссионера.СчетФактура
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокДокументовОснований КАК СписокДокументовОснований
	|		ПО СФВыданныйДокументыОснования.ДокументОснование = СписокДокументовОснований.ДокументОснованиеСчетаФактуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокДокументовОснований КАК СписокСФОснований
	|		ПО СФВыданныйДокументыОснования.Ссылка = СписокСФОснований.ДокументОснованиеСчетаФактуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО СФВыданныйДокументыОснования.Ссылка = СчетФактураВыданный.Ссылка
	|ГДЕ
	|	ВЫБОР
	|			КОГДА (СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс)
	|					ИЛИ СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НалоговыйАгент))
	|					И (СчетФактураВыданный.Исправление
	|						ИЛИ СФВыданныйДокументыОснования.ДокументОснование ССЫЛКА Документ.ОтчетКомиссионераОПродажах)
	|				ТОГДА СписокСФОснований.ДокументОснованиеСчетаФактуры ЕСТЬ НЕ NULL 
	|			ИНАЧЕ СписокДокументовОснований.ДокументОснованиеСчетаФактуры ЕСТЬ НЕ NULL 
	|		КОНЕЦ
	|	И (СчетФактураВыданный.Продавец = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ИЛИ СчетФактураВыданный.Продавец = СчетФактураВыданный.Контрагент)
	|	И НЕ(СчетФактураВыданный.СводныйКомиссионный
	|				И СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс))
	|	И СчетФактураВыданный.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Авансы.Ссылка,
	|	Авансы.Ссылка.Номер,
	|	Авансы.Ссылка.Дата,
	|	Авансы.Ссылка,
	|	Авансы.СтавкаНДС,
	|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка),
	|	Авансы.Ссылка.ВидСчетаФактуры,
	|	Авансы.Ссылка.Исправление,
	|	Авансы.Контрагент,
	|	ЛОЖЬ,
	|	Авансы.НомерСтроки,
	|	ЛОЖЬ,
	|	ИСТИНА,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.СчетФактураВыданный.Авансы КАК Авансы
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокДокументовОснований КАК СписокДокументовОснований
	|		ПО Авансы.Ссылка = СписокДокументовОснований.ДокументОснованиеСчетаФактуры
	|ГДЕ
	|	СписокДокументовОснований.ДокументОснованиеСчетаФактуры ЕСТЬ НЕ NULL 
	|	И Авансы.Ссылка.СводныйКомиссионный
	|	И Авансы.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс)
	|	И Авансы.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ГТДИмпорт.Ссылка,
	|	ГТДИмпорт.НомерГТД,
	|	ГТДИмпорт.Дата,
	|	ГТДИмпорт.Ссылка,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаПоступление),
	|	ЛОЖЬ,
	|	ГТДИмпорт.Контрагент,
	|	ЛОЖЬ,
	|	0,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.ГТДИмпорт КАК ГТДИмпорт
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокДокументовОснований КАК СписокДокументовОснований
	|		ПО ГТДИмпорт.Ссылка = СписокДокументовОснований.ДокументОснованиеСчетаФактуры
	|ГДЕ
	|	СписокДокументовОснований.ДокументОснованиеСчетаФактуры ЕСТЬ НЕ NULL 
	|	И ГТДИмпорт.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратТоваровОтПокупателя.Ссылка,
	|	ОтчетОРозничныхПродажах.Номер,
	|	ОтчетОРозничныхПродажах.Дата,
	|	ВозвратТоваровОтПокупателя.Ссылка,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаПоступление),
	|	ЛОЖЬ,
	|	ВозвратТоваровОтПокупателя.Контрагент,
	|	ЛОЖЬ,
	|	0,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокДокументовОснований КАК СписокДокументовОснований
	|		ПО ВозвратТоваровОтПокупателя.Ссылка = СписокДокументовОснований.ДокументОснованиеСчетаФактуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
	|		ПО ВозвратТоваровОтПокупателя.Сделка = ОтчетОРозничныхПродажах.Ссылка
	|ГДЕ
	|	СписокДокументовОснований.ДокументОснованиеСчетаФактуры ЕСТЬ НЕ NULL 
	|	И ВозвратТоваровОтПокупателя.Сделка ССЫЛКА Документ.ОтчетОРозничныхПродажах
	|	И ВозвратТоваровОтПокупателя.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаявлениеОВвозеТоваров.Ссылка,
	|	ЗаявлениеОВвозеТоваров.Номер,
	|	ЗаявлениеОВвозеТоваров.Дата,
	|	ЗаявлениеОВвозеТоваров.Ссылка,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаПоступление),
	|	ЛОЖЬ,
	|	ЗаявлениеОВвозеТоваров.Контрагент,
	|	ЛОЖЬ,
	|	0,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.ЗаявлениеОВвозеТоваров КАК ЗаявлениеОВвозеТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокДокументовОснований КАК СписокДокументовОснований
	|		ПО ЗаявлениеОВвозеТоваров.Ссылка = СписокДокументовОснований.ДокументОснованиеСчетаФактуры
	|ГДЕ
	|	СписокДокументовОснований.ДокументОснованиеСчетаФактуры ЕСТЬ НЕ NULL 
	|	И ЗаявлениеОВвозеТоваров.Проведен
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОснование,
	|	Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаписиКнигиПокупок.ДокументОснованиеСчетаФактуры КАК ДокументОснование,
	|	ЕСТЬNULL(СчетаФактурыДокументы.ДатаСчетаФактуры, ДанныеПервичныхДокументов.Дата) КАК ДатаСчетаФактуры,
	|	ЕСТЬNULL(СчетаФактурыДокументы.НомерСчетаФактуры, ДанныеПервичныхДокументов.Номер) КАК НомерСчетаФактуры,
	|	ЕСТЬNULL(СчетаФактурыДокументы.СчетФактураДокумент, ЗаписиКнигиПокупок.ДокументОснованиеСчетаФактуры) КАК СчетФактураДокумент,
	|	ЕСТЬNULL(СчетаФактурыДокументы.ДоговорКонтрагента, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК ДоговорКонтрагента,
	|	ЕСТЬNULL(СчетаФактурыДокументы.СтавкаНДСАванса, НЕОПРЕДЕЛЕНО) КАК СтавкаНДСАванса,
	|	ЕСТЬNULL(СчетаФактурыДокументы.ВидСчетаФактуры, ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаПоступление)) КАК ВидСчетаФактуры,
	|	ЕСТЬNULL(СчетаФактурыДокументы.Исправление, ЛОЖЬ) КАК Исправление,
	|	СчетаФактурыДокументы.НомерСтроки КАК НомерСтроки,
	|	СчетаФактурыДокументы.СводныйКорректировочный КАК СводныйКорректировочный,
	|	СчетаФактурыДокументы.СводныйКомиссионный КАК СводныйКомиссионный,
	|	ЗаписиКнигиПокупок.КонтрагентПоСчетуФактуре КАК Контрагент,
	|	ВЫБОР
	|		КОГДА СчетаФактурыДокументы.СчетФактураДокумент ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА &КонецПериода >= ДАТАВРЕМЯ(2015, 1, 1)
	|						ТОГДА ""26""
	|					ИНАЧЕ ""01""
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КодВидаОперации,
	|	ЗаписиКнигиПокупок.ВозвратЧерезКомиссионера КАК ВозвратЧерезКомиссионера
	|ПОМЕСТИТЬ ТаблицаСчетаФактурыДокументыПредварительная
	|ИЗ
	|	ЗаписиКнигиПокупок КАК ЗаписиКнигиПокупок
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СчетаФактурыДокументыПромежуточная КАК СчетаФактурыДокументы
	|		ПО ЗаписиКнигиПокупок.ДокументОснованиеСчетаФактуры = СчетаФактурыДокументы.ДокументОснование
	|			И ЗаписиКнигиПокупок.КонтрагентПоСчетуФактуре = СчетаФактурыДокументы.Контрагент
	|			И ЗаписиКнигиПокупок.ДоговорКонтрагента = СчетаФактурыДокументы.ДоговорКонтрагента
	|			И ЗаписиКнигиПокупок.СтавкаНДСАванса = СчетаФактурыДокументы.СтавкаНДСАванса
	|			И ЗаписиКнигиПокупок.ВозвратЧерезКомиссионера = СчетаФактурыДокументы.ВозвратЧерезКомиссионера
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|		ПО ЗаписиКнигиПокупок.СчетФактура = ДанныеПервичныхДокументов.Документ
	|			И ЗаписиКнигиПокупок.Организация = ДанныеПервичныхДокументов.Организация
	|ГДЕ
	|	НЕ(ЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
	|				И СчетаФактурыДокументы.ЭтоСчетФактураВыданныйПокупателюПоОтчетуКомиссионера)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОснование,
	|	Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСчетаФактурыДокументы.Контрагент КАК СчетФактураДокументКонтрагент,
	|	ТаблицаСчетаФактурыДокументы.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ТаблицаСчетаФактурыДокументы.ВидСчетаФактуры КАК ВидСчетаФактуры,
	|	ТаблицаСчетаФактурыДокументы.Исправление КАК Исправление,
	|	ТаблицаСчетаФактурыДокументы.ДокументОснование КАК ДокументОснование,
	|	МАКСИМУМ(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент) КАК СчетФактураДокумент,
	|	ТаблицаСчетаФактурыДокументы.СводныйКорректировочный КАК СводныйКорректировочный,
	|	ТаблицаСчетаФактурыДокументы.СводныйКомиссионный КАК СводныйКомиссионный,
	|	ТаблицаСчетаФактурыДокументы.КодВидаОперации КАК КодВидаОперации,
	|	ТаблицаСчетаФактурыДокументы.ВозвратЧерезКомиссионера КАК ВозвратЧерезКомиссионера
	|ПОМЕСТИТЬ ВТ_ОбъединениеСФ
	|ИЗ
	|	ТаблицаСчетаФактурыДокументыПредварительная КАК ТаблицаСчетаФактурыДокументы
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаСчетаФактурыДокументы.ДокументОснование,
	|	ТаблицаСчетаФактурыДокументы.Контрагент,
	|	ТаблицаСчетаФактурыДокументы.ДоговорКонтрагента,
	|	ТаблицаСчетаФактурыДокументы.ВидСчетаФактуры,
	|	ТаблицаСчетаФактурыДокументы.Исправление,
	|	ТаблицаСчетаФактурыДокументы.СводныйКорректировочный,
	|	ТаблицаСчетаФактурыДокументы.СводныйКомиссионный,
	|	ТаблицаСчетаФактурыДокументы.КодВидаОперации,
	|	ТаблицаСчетаФактурыДокументы.ВозвратЧерезКомиссионера
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОснование,
	|	СчетФактураДокументКонтрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСчетаФактурыДокументыПредварительная.ДокументОснование КАК ДокументОснование,
	|	ТаблицаСчетаФактурыДокументыПредварительная.ДатаСчетаФактуры КАК ДатаСчетаФактуры,
	|	ТаблицаСчетаФактурыДокументыПредварительная.НомерСчетаФактуры КАК НомерСчетаФактуры,
	|	ВТ_ОбъединениеСФ.СчетФактураДокумент КАК СчетФактураДокумент,
	|	ВТ_ОбъединениеСФ.СчетФактураДокументКонтрагент КАК КонтрагентПоСчетуФактуре,
	|	ТаблицаСчетаФактурыДокументыПредварительная.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ТаблицаСчетаФактурыДокументыПредварительная.СтавкаНДСАванса КАК СтавкаНДСАванса,
	|	ТаблицаСчетаФактурыДокументыПредварительная.НомерСтроки КАК НомерСтроки,
	|	ТаблицаСчетаФактурыДокументыПредварительная.СводныйКорректировочный КАК СводныйКорректировочный,
	|	ТаблицаСчетаФактурыДокументыПредварительная.СводныйКомиссионный КАК СводныйКомиссионный,
	|	ТаблицаСчетаФактурыДокументыПредварительная.КодВидаОперации КАК КодВидаОперации
	|ПОМЕСТИТЬ ВТ_ТаблицаСчетаФактурыДокументы
	|ИЗ
	|	ТаблицаСчетаФактурыДокументыПредварительная КАК ТаблицаСчетаФактурыДокументыПредварительная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбъединениеСФ КАК ВТ_ОбъединениеСФ
	|		ПО ТаблицаСчетаФактурыДокументыПредварительная.ДокументОснование = ВТ_ОбъединениеСФ.ДокументОснование
	|			И ТаблицаСчетаФактурыДокументыПредварительная.Контрагент = ВТ_ОбъединениеСФ.СчетФактураДокументКонтрагент
	|			И ТаблицаСчетаФактурыДокументыПредварительная.ДоговорКонтрагента = ВТ_ОбъединениеСФ.ДоговорКонтрагента
	|			И ТаблицаСчетаФактурыДокументыПредварительная.ВидСчетаФактуры = ВТ_ОбъединениеСФ.ВидСчетаФактуры
	|			И ТаблицаСчетаФактурыДокументыПредварительная.Исправление = ВТ_ОбъединениеСФ.Исправление
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактураДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЖурналУчетаСчетовФактур.Регистратор КАК Регистратор,
	|	ЖурналУчетаСчетовФактур.СчетФактура КАК СчетФактураДокумент,
	|	ЖурналУчетаСчетовФактур.НомерСчетаФактуры КАК НомерСчетаФактуры,
	|	ЖурналУчетаСчетовФактур.ДатаСчетаФактуры КАК ДатаСчетаФактуры,
	|	ЖурналУчетаСчетовФактур.НомерКорректировочногоСчетаФактуры КАК НомерКорректировочногоСчетаФактуры,
	|	ЖурналУчетаСчетовФактур.ДатаКорректировочногоСчетаФактуры КАК ДатаКорректировочногоСчетаФактуры,
	|	ЖурналУчетаСчетовФактур.НомерИсправления КАК НомерИсправления,
	|	ЖурналУчетаСчетовФактур.ДатаИсправления КАК ДатаИсправления,
	|	ЖурналУчетаСчетовФактур.НомерИсправленияКорректировочногоСчетаФактуры КАК НомерИсправленияКорректировки,
	|	ЖурналУчетаСчетовФактур.ДатаИсправленияКорректировочногоСчетаФактуры КАК ДатаИсправленияКорректировки,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ЖурналУчетаСчетовФактур.Продавец
	|		КОГДА ЖурналУчетаСчетовФактур.Контрагент <> ЖурналУчетаСчетовФактур.Организация
	|			ТОГДА ЖурналУчетаСчетовФактур.Контрагент
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ПродавецДляПечати,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ЖурналУчетаСчетовФактур.КПППродавца
	|		КОГДА ЖурналУчетаСчетовФактур.Контрагент <> ЖурналУчетаСчетовФактур.Организация
	|			ТОГДА ЖурналУчетаСчетовФактур.КППКонтрагента
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КПППродавцаДляПечати,
	|	ВЫБОР
	|		КОГДА &ПравилаПостановления735
	|				И ЖурналУчетаСчетовФактур.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				И ЖурналУчетаСчетовФактур.Контрагент <> ЖурналУчетаСчетовФактур.Организация
	|			ТОГДА ЖурналУчетаСчетовФактур.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК ПосредникСсылка,
	|	ЖурналУчетаСчетовФактур.НомерСтроки КАК НомерСтроки,
	|	ЖурналУчетаСчетовФактур.Валюта КАК Валюта,
	|	ЖурналУчетаСчетовФактур.Валюта.Наименование КАК ВалютаНаименование,
	|	ЖурналУчетаСчетовФактур.Валюта.НаименованиеПолное КАК ВалютаНаименованиеПолное,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураПолученный
	|				И ВЫРАЗИТЬ(ЖурналУчетаСчетовФактур.СчетФактура КАК Документ.СчетФактураПолученный).ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
	|			ТОГДА ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуреРазницаУвеличение
	|		КОГДА ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
	|				И ВЫРАЗИТЬ(ЖурналУчетаСчетовФактур.СчетФактура КАК Документ.СчетФактураВыданный).ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.Корректировочный)
	|			ТОГДА ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуреРазницаУменьшение
	|		ИНАЧЕ ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуре
	|	КОНЕЦ КАК ВсегоПокупокВВалюте,
	|	ЖурналУчетаСчетовФактур.Валюта.Код КАК ВалютаКод,
	|	ЖурналУчетаСчетовФактур.КодВидаОперации КАК КодВидаОперации,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ЖурналУчетаСчетовФактур.ИННПродавца
	|		КОГДА ЖурналУчетаСчетовФактур.Контрагент <> ЖурналУчетаСчетовФактур.Организация
	|			ТОГДА ЖурналУчетаСчетовФактур.ИННКонтрагента
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ИННПродавцаДляПечати,
	|	ЖурналУчетаСчетовФактур.Продавец КАК Продавец,
	|	ВЫБОР
	|		КОГДА &ПравилаПостановления735
	|				И ЖурналУчетаСчетовФактур.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				И ЖурналУчетаСчетовФактур.Контрагент <> ЖурналУчетаСчетовФактур.Организация
	|			ТОГДА ЖурналУчетаСчетовФактур.ИННКонтрагента
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПосредникИНН,
	|	ВЫБОР
	|		КОГДА &ПравилаПостановления735
	|				И ЖурналУчетаСчетовФактур.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				И ЖурналУчетаСчетовФактур.Контрагент <> ЖурналУчетаСчетовФактур.Организация
	|			ТОГДА ЖурналУчетаСчетовФактур.КППКонтрагента
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПосредникКПП
	|ПОМЕСТИТЬ ВТ_РегистрацияСчетовФактур
	|ИЗ
	|	РегистрСведений.ЖурналУчетаСчетовФактур КАК ЖурналУчетаСчетовФактур
	|ГДЕ
	|	ЖурналУчетаСчетовФактур.СчетФактура В
	|			(ВЫБРАТЬ
	|				ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент
	|			ИЗ
	|				ВТ_ТаблицаСчетаФактурыДокументы)
	|	И ЖурналУчетаСчетовФактур.Организация В(&Организация)
	|	И НЕ ЖурналУчетаСчетовФактур.Сторно
	|	И НЕ(ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
	|				И ЖурналУчетаСчетовФактур.ЧастьЖурнала = ЗНАЧЕНИЕ(Перечисление.ЧастиЖурналаУчетаСчетовФактур.ПолученныеСчетаФактуры))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЖурналУчетаСчетовФактур.СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.НомерСчетаФактуры, ВТ_ТаблицаСчетаФактурыДокументы.НомерСчетаФактуры) КАК НомерСчетаФактуры,
	|	ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаСчетаФактуры, ВТ_ТаблицаСчетаФактурыДокументы.ДатаСчетаФактуры) КАК ДатаСчетаФактуры,
	|	ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.СчетФактураДокумент, ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент) КАК СчетФактураДокумент,
	|	ВТ_ТаблицаСчетаФактурыДокументы.НомерСчетаФактуры КАК НомерСчетаФактурыСортировка,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаИсправленияКорректировки, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВТ_РегистрацияСчетовФактур.ДатаИсправленияКорректировки
	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры
	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаИсправления, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВТ_РегистрацияСчетовФактур.ДатаИсправления
	|		ИНАЧЕ ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаСчетаФактуры, ВТ_ТаблицаСчетаФактурыДокументы.ДатаСчетаФактуры)
	|	КОНЕЦ КАК ДатаСчетаФактурыСортировка,
	|	ВТ_ТаблицаСчетаФактурыДокументы.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВТ_ТаблицаСчетаФактурыДокументы.СтавкаНДСАванса КАК СтавкаНДСАванса,
	|	ВТ_ТаблицаСчетаФактурыДокументы.ДокументОснование КАК ДокументОснованиеСчетаФактуры,
	|	ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент КАК СчетФактураДокументРасшифровка,
	|	ВТ_РегистрацияСчетовФактур.НомерКорректировочногоСчетаФактуры КАК НомерКорректировки,
	|	ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры КАК ДатаКорректировки,
	|	ВТ_РегистрацияСчетовФактур.НомерИсправления КАК НомерИсправления,
	|	ВТ_РегистрацияСчетовФактур.ДатаИсправления КАК ДатаИсправления,
	|	ВТ_РегистрацияСчетовФактур.НомерИсправленияКорректировки КАК НомерИсправленияКорректировки,
	|	ВТ_РегистрацияСчетовФактур.ДатаИсправленияКорректировки КАК ДатаИсправленияКорректировки,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент ССЫЛКА Документ.СчетФактураВыданный
	|				ИЛИ ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент ССЫЛКА Документ.ЗаявлениеОВвозеТоваров
	|				ИЛИ ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент ССЫЛКА Документ.ВозвратТоваровОтПокупателя
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_РегистрацияСчетовФактур.СчетФактураДокумент ЕСТЬ NULL
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОбрабатыватьНомерДокумента,
	|	ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ПродавецДляПечати, ВТ_ТаблицаСчетаФактурыДокументы.КонтрагентПоСчетуФактуре) КАК ПродавецДляПечати,
	|	ВТ_РегистрацияСчетовФактур.КПППродавцаДляПечати КАК КПППродавцаДляПечати,
	|	ВТ_ТаблицаСчетаФактурыДокументы.СводныйКорректировочный КАК СводныйКорректировочный,
	|	ВТ_ТаблицаСчетаФактурыДокументы.СводныйКомиссионный КАК СводныйКомиссионный,
	|	ВТ_ТаблицаСчетаФактурыДокументы.КонтрагентПоСчетуФактуре КАК КонтрагентПоСчетуФактуре,
	|	ВТ_РегистрацияСчетовФактур.Валюта КАК Валюта,
	|	ВТ_РегистрацияСчетовФактур.ВалютаНаименование КАК ВалютаНаименование,
	|	ВТ_РегистрацияСчетовФактур.ВалютаНаименованиеПолное КАК ВалютаНаименованиеПолное,
	|	СУММА(ВТ_РегистрацияСчетовФактур.ВсегоПокупокВВалюте) КАК ВсегоПокупокВВалюте,
	|	ВТ_РегистрацияСчетовФактур.ВалютаКод КАК ВалютаКод,
	|	ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.КодВидаОперации, ВТ_ТаблицаСчетаФактурыДокументы.КодВидаОперации) КАК КодВидаОперации,
	|	ВТ_РегистрацияСчетовФактур.ПосредникСсылка КАК ПосредникСсылка,
	|	ВТ_РегистрацияСчетовФактур.ИННПродавцаДляПечати КАК ИННПродавцаДляПечати,
	|	ВТ_РегистрацияСчетовФактур.ПосредникИНН КАК ПосредникИНН,
	|	ВТ_РегистрацияСчетовФактур.ПосредникКПП КАК ПосредникКПП,
	|	ЗНАЧЕНИЕ(Документ.СчетФактураВыданный.ПустаяСсылка) КАК СводнаяСправка
	|ПОМЕСТИТЬ ТаблицаСчетаФактурыДокументы
	|ИЗ
	|	ВТ_ТаблицаСчетаФактурыДокументы КАК ВТ_ТаблицаСчетаФактурыДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РегистрацияСчетовФактур КАК ВТ_РегистрацияСчетовФактур
	|		ПО ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент = ВТ_РегистрацияСчетовФактур.СчетФактураДокумент
	|			И (НЕ ВТ_ТаблицаСчетаФактурыДокументы.СводныйКорректировочный
	|					И НЕ ВТ_ТаблицаСчетаФактурыДокументы.СводныйКомиссионный
	|				ИЛИ ВТ_ТаблицаСчетаФактурыДокументы.НомерСтроки = ВТ_РегистрацияСчетовФактур.НомерСтроки)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицаСчетаФактурыДокументы.ДокументОснование,
	|	ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.НомерСчетаФактуры, ВТ_ТаблицаСчетаФактурыДокументы.НомерСчетаФактуры),
	|	ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаСчетаФактуры, ВТ_ТаблицаСчетаФактурыДокументы.ДатаСчетаФактуры),
	|	ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.СчетФактураДокумент, ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент),
	|	ВТ_ТаблицаСчетаФактурыДокументы.НомерСчетаФактуры,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаИсправленияКорректировки, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВТ_РегистрацияСчетовФактур.ДатаИсправленияКорректировки
	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры
	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаИсправления, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВТ_РегистрацияСчетовФактур.ДатаИсправления
	|		ИНАЧЕ ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаСчетаФактуры, ВТ_ТаблицаСчетаФактурыДокументы.ДатаСчетаФактуры)
	|	КОНЕЦ,
	|	ВТ_ТаблицаСчетаФактурыДокументы.ДоговорКонтрагента,
	|	ВТ_ТаблицаСчетаФактурыДокументы.СтавкаНДСАванса,
	|	ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент,
	|	ВТ_РегистрацияСчетовФактур.НомерКорректировочногоСчетаФактуры,
	|	ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры,
	|	ВТ_РегистрацияСчетовФактур.НомерИсправления,
	|	ВТ_РегистрацияСчетовФактур.ДатаИсправления,
	|	ВТ_РегистрацияСчетовФактур.НомерИсправленияКорректировки,
	|	ВТ_РегистрацияСчетовФактур.ДатаИсправленияКорректировки,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент ССЫЛКА Документ.СчетФактураВыданный
	|				ИЛИ ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент ССЫЛКА Документ.ЗаявлениеОВвозеТоваров
	|				ИЛИ ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент ССЫЛКА Документ.ВозвратТоваровОтПокупателя
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_РегистрацияСчетовФактур.СчетФактураДокумент ЕСТЬ NULL
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ПродавецДляПечати, ВТ_ТаблицаСчетаФактурыДокументы.КонтрагентПоСчетуФактуре),
	|	ВТ_РегистрацияСчетовФактур.КПППродавцаДляПечати,
	|	ВТ_ТаблицаСчетаФактурыДокументы.СводныйКорректировочный,
	|	ВТ_ТаблицаСчетаФактурыДокументы.СводныйКомиссионный,
	|	ВТ_ТаблицаСчетаФактурыДокументы.КонтрагентПоСчетуФактуре,
	|	ВТ_РегистрацияСчетовФактур.Валюта,
	|	ВТ_РегистрацияСчетовФактур.ВалютаНаименование,
	|	ВТ_РегистрацияСчетовФактур.ВалютаНаименованиеПолное,
	|	ВТ_РегистрацияСчетовФактур.ВалютаКод,
	|	ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.КодВидаОперации, ВТ_ТаблицаСчетаФактурыДокументы.КодВидаОперации),
	|	ВТ_РегистрацияСчетовФактур.ПосредникСсылка,
	|	ВТ_РегистрацияСчетовФактур.ИННПродавцаДляПечати,
	|	ВТ_РегистрацияСчетовФактур.ПосредникИНН,
	|	ВТ_РегистрацияСчетовФактур.ПосредникКПП
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОснованиеСчетаФактуры,
	|	КонтрагентПоСчетуФактуре"
	+ ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецФункции

Функция ТекстЗапросаРеквизитыСчетовФактурПостановление981КнигаПокупок() Экспорт
	
	// Для списка счетов-фактур получаем данные документов-оснований.
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаписиКнигиПокупок.ДокументОснованиеСчетаФактуры КАК ДокументОснованиеСчетаФактуры
	|ПОМЕСТИТЬ СписокДокументовОснований
	|ИЗ
	|	ЗаписиКнигиПокупок КАК ЗаписиКнигиПокупок
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОснованиеСчетаФактуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЧПокупатели.СчетФактура КАК СчетФактура
	|ПОМЕСТИТЬ ВТ_СчетаФактурыИзПокупателейПоОтчетуКомиссионера
	|ИЗ
	|	Документ.ОтчетКомиссионераОПродажах.Покупатели КАК ТЧПокупатели
	|ГДЕ
	|	ТЧПокупатели.Ссылка.Проведен
	|	И НЕ ТЧПокупатели.Ссылка.ПометкаУдаления
	|	И ТЧПокупатели.Ссылка.Организация В(&Организация)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТЧПокупатели.СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЧВозвраты.СчетФактура КАК СчетФактура
	|ПОМЕСТИТЬ ВТ_СчетаФактурыНаВозвратПоОтчетуКомиссионера
	|ИЗ
	|	Документ.ОтчетКомиссионераОПродажах.Возвраты КАК ТЧВозвраты
	|ГДЕ
	|	ТЧВозвраты.Ссылка.Проведен
	|	И НЕ ТЧВозвраты.Ссылка.ПометкаУдаления
	|	И ТЧВозвраты.Ссылка.Организация В(&Организация)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТЧВозвраты.СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА (СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаАванс)
	|					ИЛИ СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.КорректировочныйНаАванс))
	|					И (СчетФактураПолученный.Исправление
	|						ИЛИ СчетФактураПолученный.ИсправлениеСобственнойОшибки)
	|				ИЛИ СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаПоступление)
	|					И СФПолученныйДокументыОснования.ДокументОснование ССЫЛКА Документ.АвансовыйОтчет
	|				ИЛИ СчетФактураПолученный.ВозвратЧерезКомиссионера
	|			ТОГДА СФПолученныйДокументыОснования.Ссылка
	|		ИНАЧЕ СФПолученныйДокументыОснования.ДокументОснование
	|	КОНЕЦ КАК ДокументОснование,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
	|			ТОГДА СФПолученныйДокументыОснования.НомерИсходногоДокумента
	|		ИНАЧЕ СчетФактураПолученный.НомерВходящегоДокумента
	|	КОНЕЦ КАК НомерСчетаФактуры,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
	|			ТОГДА СФПолученныйДокументыОснования.ДатаИсходногоДокумента
	|		ИНАЧЕ СчетФактураПолученный.ДатаВходящегоДокумента
	|	КОНЕЦ КАК ДатаСчетаФактуры,
	|	СФПолученныйДокументыОснования.Ссылка КАК СчетФактураДокумент,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаАванс)
	|				ИЛИ СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.КорректировочныйНаАванс)
	|			ТОГДА ЕСТЬNULL(СФПолученныйАвансы.СтавкаНДС, НЕОПРЕДЕЛЕНО)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СтавкаНДСАванса,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаАванс)
	|				ИЛИ СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.КорректировочныйНаАванс)
	|			ТОГДА СчетФактураПолученный.ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ КАК ДоговорКонтрагента,
	|	СчетФактураПолученный.Исправление КАК Исправление,
	|	СчетФактураПолученный.Контрагент КАК Контрагент,
	|	СчетФактураПолученный.ВидСчетаФактуры КАК ВидСчетаФактуры,
	|	ЛОЖЬ КАК ЭтоСчетФактураВыданныйПокупателюПоОтчетуКомиссионера,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.СводныйКорректировочный
	|			ТОГДА СФПолученныйДокументыОснования.НомерСтроки
	|		КОГДА СчетФактураПолученный.СводныйКомиссионный
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НомерСтроки,
	|	СчетФактураПолученный.СводныйКорректировочный КАК СводныйКорректировочный,
	|	СчетФактураПолученный.СводныйКомиссионный КАК СводныйКомиссионный,
	|	СчетФактураПолученный.ВозвратЧерезКомиссионера КАК ВозвратЧерезКомиссионера,
	|	ЛОЖЬ КАК ЭтоСчетФактураВыданныйНаВозвратПоОтчетуКомиссионера
	|ПОМЕСТИТЬ ВТ_СчетаФактурыДокументыПромежуточная
	|ИЗ
	|	Документ.СчетФактураПолученный.ДокументыОснования КАК СФПолученныйДокументыОснования
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.Авансы КАК СФПолученныйАвансы
	|		ПО СФПолученныйДокументыОснования.Ссылка = СФПолученныйАвансы.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокДокументовОснований КАК СписокДокументовОснований
	|		ПО СФПолученныйДокументыОснования.ДокументОснование = СписокДокументовОснований.ДокументОснованиеСчетаФактуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокДокументовОснований КАК СписокСФОснований
	|		ПО СФПолученныйДокументыОснования.Ссылка = СписокСФОснований.ДокументОснованиеСчетаФактуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|		ПО СФПолученныйДокументыОснования.Ссылка = СчетФактураПолученный.Ссылка
	|ГДЕ
	|	ВЫБОР
	|			КОГДА (СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаАванс)
	|						ИЛИ СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.КорректировочныйНаАванс))
	|						И (СчетФактураПолученный.Исправление
	|							ИЛИ СчетФактураПолученный.ИсправлениеСобственнойОшибки)
	|					ИЛИ СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаПоступление)
	|						И СФПолученныйДокументыОснования.ДокументОснование ССЫЛКА Документ.АвансовыйОтчет
	|					ИЛИ СчетФактураПолученный.ВозвратЧерезКомиссионера
	|				ТОГДА СписокСФОснований.ДокументОснованиеСчетаФактуры ЕСТЬ НЕ NULL 
	|			ИНАЧЕ СписокДокументовОснований.ДокументОснованиеСчетаФактуры ЕСТЬ НЕ NULL 
	|		КОНЕЦ
	|	И СчетФактураПолученный.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА (СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс)
	|				ИЛИ СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.КорректировочныйНаАванс)
	|				ИЛИ СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НалоговыйАгент))
	|				И (СчетФактураВыданный.Исправление
	|					ИЛИ СФВыданныйДокументыОснования.ДокументОснование ССЫЛКА Документ.ОтчетКомиссионераОПродажах)
	|			ТОГДА СФВыданныйДокументыОснования.Ссылка
	|		ИНАЧЕ СФВыданныйДокументыОснования.ДокументОснование
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.Корректировочный)
	|				ИЛИ СчетФактураВыданный.Исправление
	|			ТОГДА СчетФактураВыданный.НомерИсходногоДокумента
	|		ИНАЧЕ СчетФактураВыданный.Номер
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.Корректировочный)
	|				ИЛИ СчетФактураВыданный.Исправление
	|			ТОГДА СчетФактураВыданный.ДатаИсходногоДокумента
	|		ИНАЧЕ СчетФактураВыданный.Дата
	|	КОНЕЦ,
	|	СФВыданныйДокументыОснования.Ссылка,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс)
	|				ИЛИ СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.КорректировочныйНаАванс)
	|			ТОГДА ЕСТЬNULL(СФВыданныйАвансы.СтавкаНДС, НЕОПРЕДЕЛЕНО)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс)
	|				ИЛИ СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.КорректировочныйНаАванс)
	|				ИЛИ СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НалоговыйАгент)
	|			ТОГДА СчетФактураВыданный.ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ,
	|	СчетФактураВыданный.Исправление,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.СводныйКомиссионный
	|			ТОГДА ЕСТЬNULL(СФВыданныйАвансы.Контрагент, СчетФактураВыданный.Контрагент)
	|		КОГДА СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.КорректировочнаяСправка)
	|				И СФВыданныйДокументыОснования.ДокументОснование ССЫЛКА Документ.ОтчетКомиссионераОПродажах
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|		ИНАЧЕ СчетФактураВыданный.Контрагент
	|	КОНЕЦ,
	|	СчетФактураВыданный.ВидСчетаФактуры,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_СчетаФактурыИзПокупателейПоОтчетуКомиссионера.СчетФактура ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.СводныйКомиссионный
	|			ТОГДА ЕСТЬNULL(СФВыданныйАвансы.НомерСтроки, СФВыданныйДокументыОснования.НомерСтроки)
	|		ИНАЧЕ СФВыданныйДокументыОснования.НомерСтроки
	|	КОНЕЦ,
	|	СчетФактураВыданный.СводныйКорректировочный,
	|	СчетФактураВыданный.СводныйКомиссионный,
	|	ЛОЖЬ,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СФВыданныйДокументыОснования
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.Авансы КАК СФВыданныйАвансы
	|		ПО СФВыданныйДокументыОснования.Ссылка = СФВыданныйАвансы.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СчетаФактурыИзПокупателейПоОтчетуКомиссионера КАК ВТ_СчетаФактурыИзПокупателейПоОтчетуКомиссионера
	|		ПО СФВыданныйДокументыОснования.Ссылка = ВТ_СчетаФактурыИзПокупателейПоОтчетуКомиссионера.СчетФактура
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокДокументовОснований КАК СписокДокументовОснований
	|		ПО СФВыданныйДокументыОснования.ДокументОснование = СписокДокументовОснований.ДокументОснованиеСчетаФактуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокДокументовОснований КАК СписокСФОснований
	|		ПО СФВыданныйДокументыОснования.Ссылка = СписокСФОснований.ДокументОснованиеСчетаФактуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО СФВыданныйДокументыОснования.Ссылка = СчетФактураВыданный.Ссылка
	|ГДЕ
	|	ВЫБОР
	|			КОГДА (СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс)
	|					ИЛИ СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.КорректировочныйНаАванс)
	|					ИЛИ СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НалоговыйАгент))
	|					И (СчетФактураВыданный.Исправление
	|						ИЛИ СФВыданныйДокументыОснования.ДокументОснование ССЫЛКА Документ.ОтчетКомиссионераОПродажах)
	|				ТОГДА СписокСФОснований.ДокументОснованиеСчетаФактуры ЕСТЬ НЕ NULL 
	|			ИНАЧЕ СписокДокументовОснований.ДокументОснованиеСчетаФактуры ЕСТЬ НЕ NULL 
	|		КОНЕЦ
	|	И (СчетФактураВыданный.Продавец = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ИЛИ СчетФактураВыданный.Продавец = СчетФактураВыданный.Контрагент)
	|	И НЕ(СчетФактураВыданный.СводныйКомиссионный
	|				И СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс))
	|	И СчетФактураВыданный.Проведен
	|	И ВЫБОР
	|			КОГДА &Постановление1137_2019
	|				ТОГДА СчетФактураВыданный.ВидСчетаФактуры <> ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.СводнаяСправка)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СФВыданныйДокументыОснования.Ссылка,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.Корректировочный)
	|				ИЛИ СчетФактураВыданный.Исправление
	|			ТОГДА СчетФактураВыданный.НомерИсходногоДокумента
	|		ИНАЧЕ СчетФактураВыданный.Номер
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.Корректировочный)
	|				ИЛИ СчетФактураВыданный.Исправление
	|			ТОГДА СчетФактураВыданный.ДатаИсходногоДокумента
	|		ИНАЧЕ СчетФактураВыданный.Дата
	|	КОНЕЦ,
	|	СФВыданныйДокументыОснования.Ссылка,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка),
	|	СчетФактураВыданный.Исправление,
	|	СчетФактураВыданный.Контрагент,
	|	СчетФактураВыданный.ВидСчетаФактуры,
	|	ЛОЖЬ,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.СводныйКомиссионный
	|			ТОГДА СФВыданныйДокументыОснования.НомерСтроки
	|		ИНАЧЕ СФВыданныйДокументыОснования.НомерСтроки
	|	КОНЕЦ,
	|	СчетФактураВыданный.СводныйКорректировочный,
	|	СчетФактураВыданный.СводныйКомиссионный,
	|	ЛОЖЬ,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_СчетаФактурыНаВозвратПоОтчетуКомиссионера.СчетФактура ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СФВыданныйДокументыОснования
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.Авансы КАК СФВыданныйАвансы
	|		ПО СФВыданныйДокументыОснования.Ссылка = СФВыданныйАвансы.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокДокументовОснований КАК СписокСФОснований
	|		ПО СФВыданныйДокументыОснования.Ссылка = СписокСФОснований.ДокументОснованиеСчетаФактуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО СФВыданныйДокументыОснования.Ссылка = СчетФактураВыданный.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СчетаФактурыНаВозвратПоОтчетуКомиссионера КАК ВТ_СчетаФактурыНаВозвратПоОтчетуКомиссионера
	|		ПО СФВыданныйДокументыОснования.Ссылка = ВТ_СчетаФактурыНаВозвратПоОтчетуКомиссионера.СчетФактура
	|ГДЕ
	|	ВТ_СчетаФактурыНаВозвратПоОтчетуКомиссионера.СчетФактура ЕСТЬ НЕ NULL 
	|	И (СчетФактураВыданный.Продавец = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ИЛИ СчетФактураВыданный.Продавец = СчетФактураВыданный.Контрагент)
	|	И НЕ(СчетФактураВыданный.СводныйКомиссионный
	|				И СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс))
	|	И СчетФактураВыданный.Проведен
	|	И ВЫБОР
	|			КОГДА &Постановление1137_2019
	|				ТОГДА СчетФактураВыданный.ВидСчетаФактуры <> ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.СводнаяСправка)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Авансы.Ссылка,
	|	Авансы.Ссылка.Номер,
	|	Авансы.Ссылка.Дата,
	|	Авансы.Ссылка,
	|	Авансы.СтавкаНДС,
	|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка),
	|	Авансы.Ссылка.Исправление,
	|	Авансы.Контрагент,
	|	Авансы.Ссылка.ВидСчетаФактуры,
	|	ЛОЖЬ,
	|	Авансы.НомерСтроки,
	|	ЛОЖЬ,
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.СчетФактураВыданный.Авансы КАК Авансы
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокДокументовОснований КАК СписокДокументовОснований
	|		ПО Авансы.Ссылка = СписокДокументовОснований.ДокументОснованиеСчетаФактуры
	|ГДЕ
	|	СписокДокументовОснований.ДокументОснованиеСчетаФактуры ЕСТЬ НЕ NULL 
	|	И Авансы.Ссылка.СводныйКомиссионный
	|	И Авансы.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс)
	|	И Авансы.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ГТДИмпорт.Ссылка,
	|	ГТДИмпорт.НомерГТД,
	|	ГТДИмпорт.Дата,
	|	ГТДИмпорт.Ссылка,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка),
	|	ЛОЖЬ,
	|	ГТДИмпорт.Контрагент,
	|	ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаПоступление),
	|	ЛОЖЬ,
	|	0,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.ГТДИмпорт КАК ГТДИмпорт
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокДокументовОснований КАК СписокДокументовОснований
	|		ПО ГТДИмпорт.Ссылка = СписокДокументовОснований.ДокументОснованиеСчетаФактуры
	|ГДЕ
	|	СписокДокументовОснований.ДокументОснованиеСчетаФактуры ЕСТЬ НЕ NULL 
	|	И ГТДИмпорт.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратТоваровОтПокупателя.Ссылка,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СчетФактураВыданныйДокументыОснования.Ссылка.ВидСчетаФактуры, ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.СводнаяСправка)
	|			ТОГДА СчетФактураВыданныйДокументыОснования.Ссылка.Номер
	|		ИНАЧЕ ОтчетОРозничныхПродажах.Номер
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СчетФактураВыданныйДокументыОснования.Ссылка.ВидСчетаФактуры, ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.СводнаяСправка)
	|			ТОГДА СчетФактураВыданныйДокументыОснования.Ссылка.Дата
	|		ИНАЧЕ ОтчетОРозничныхПродажах.Дата
	|	КОНЕЦ,
	|	ЕСТЬNULL(СчетФактураВыданныйДокументыОснования.Ссылка, ВозвратТоваровОтПокупателя.Ссылка),
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка),
	|	ЛОЖЬ,
	|	ВозвратТоваровОтПокупателя.Контрагент,
	|	ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаПоступление),
	|	ЛОЖЬ,
	|	0,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокДокументовОснований КАК СписокДокументовОснований
	|		ПО ВозвратТоваровОтПокупателя.Ссылка = СписокДокументовОснований.ДокументОснованиеСчетаФактуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|			ПО ОтчетОРозничныхПродажах.Ссылка = СчетФактураВыданныйДокументыОснования.ДокументОснование
	|				И (СчетФактураВыданныйДокументыОснования.Ссылка.Проведен)
	|				И (СчетФактураВыданныйДокументыОснования.Ссылка.ВидСчетаФактуры <> ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс))
	|		ПО ВозвратТоваровОтПокупателя.Сделка = ОтчетОРозничныхПродажах.Ссылка
	|ГДЕ
	|	СписокДокументовОснований.ДокументОснованиеСчетаФактуры ЕСТЬ НЕ NULL 
	|	И ВозвратТоваровОтПокупателя.Сделка ССЫЛКА Документ.ОтчетОРозничныхПродажах
	|	И ВозвратТоваровОтПокупателя.Проведен
	|	И НЕ &Постановление1137_2019
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаявлениеОВвозеТоваров.Ссылка,
	|	ЗаявлениеОВвозеТоваров.Номер,
	|	ЗаявлениеОВвозеТоваров.Дата,
	|	ЗаявлениеОВвозеТоваров.Ссылка,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка),
	|	ЛОЖЬ,
	|	ЗаявлениеОВвозеТоваров.Контрагент,
	|	ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаПоступление),
	|	ЛОЖЬ,
	|	0,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.ЗаявлениеОВвозеТоваров КАК ЗаявлениеОВвозеТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокДокументовОснований КАК СписокДокументовОснований
	|		ПО ЗаявлениеОВвозеТоваров.Ссылка = СписокДокументовОснований.ДокументОснованиеСчетаФактуры
	|ГДЕ
	|	СписокДокументовОснований.ДокументОснованиеСчетаФактуры ЕСТЬ НЕ NULL 
	|	И ЗаявлениеОВвозеТоваров.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаРеализации.Ссылка,
	|	ДанныеПервичныхДокументов.Номер,
	|	ДанныеПервичныхДокументов.Дата,
	|	КорректировкаРеализации.Ссылка,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка),
	|	ЛОЖЬ,
	|	КорректировкаРеализации.Контрагент,
	|	НЕОПРЕДЕЛЕНО,
	|	ЛОЖЬ,
	|	0,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ
	|ИЗ
	|	СписокДокументовОснований КАК СписокДокументовОснований
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК КорректировкаРеализации
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|			ПО (СчетФактураВыданныйДокументыОснования.Ссылка.Проведен)
	|				И КорректировкаРеализации.Ссылка = СчетФактураВыданныйДокументыОснования.ДокументОснование
	|				И (СчетФактураВыданныйДокументыОснования.Ссылка.ВидСчетаФактуры <> ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|			ПО КорректировкаРеализации.ДокументРеализации = ДанныеПервичныхДокументов.Документ
	|		ПО СписокДокументовОснований.ДокументОснованиеСчетаФактуры = КорректировкаРеализации.Ссылка
	|			И (СписокДокументовОснований.ДокументОснованиеСчетаФактуры ССЫЛКА Документ.КорректировкаРеализации)
	|ГДЕ
	|	СчетФактураВыданныйДокументыОснования.ДокументОснование ЕСТЬ NULL
	|	И &Постановление1137_2019
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратТоваровОтПокупателя.Ссылка,
	|	ДанныеПервичныхДокументов.Номер,
	|	ДанныеПервичныхДокументов.Дата,
	|	ВозвратТоваровОтПокупателя.Ссылка,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка),
	|	ЛОЖЬ,
	|	ВозвратТоваровОтПокупателя.Контрагент,
	|	НЕОПРЕДЕЛЕНО,
	|	ЛОЖЬ,
	|	0,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ
	|ИЗ
	|	СписокДокументовОснований КАК СписокДокументовОснований
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|			ПО (СчетФактураВыданныйДокументыОснования.Ссылка.Проведен)
	|				И ВозвратТоваровОтПокупателя.Ссылка = СчетФактураВыданныйДокументыОснования.ДокументОснование
	|				И (СчетФактураВыданныйДокументыОснования.Ссылка.ВидСчетаФактуры <> ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|			ПО ВозвратТоваровОтПокупателя.Сделка = ДанныеПервичныхДокументов.Документ
	|		ПО СписокДокументовОснований.ДокументОснованиеСчетаФактуры = ВозвратТоваровОтПокупателя.Ссылка
	|ГДЕ
	|	ВозвратТоваровОтПокупателя.Сделка ССЫЛКА Документ.РеализацияТоваровУслуг
	|	И СчетФактураВыданныйДокументыОснования.ДокументОснование ЕСТЬ NULL
	|	И ВозвратТоваровОтПокупателя.Проведен
	|	И ВозвратТоваровОтПокупателя.ПокупателюВыставляетсяКорректировочныйСчетФактура
	|	И &Постановление1137_2019
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОснование,
	|	Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СчетаФактурыИзПокупателейПоОтчетуКомиссионера
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СписокДокументовОснований
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(СчетаФактурыДокументы.СчетФактураДокумент, ЗаписиКнигиПокупок.ДокументОснованиеСчетаФактуры) КАК СчетФактураДокумент,
	|	ЕСТЬNULL(СчетаФактурыДокументы.ДатаСчетаФактуры, ДанныеПервичныхДокументов.Дата) КАК ДатаСчетаФактуры,
	|	ЕСТЬNULL(СчетаФактурыДокументы.НомерСчетаФактуры, ДанныеПервичныхДокументов.Номер) КАК НомерСчетаФактуры,
	|	ЗаписиКнигиПокупок.ДокументОснованиеСчетаФактуры КАК ДокументОснованиеСчетаФактуры,
	|	ЗаписиКнигиПокупок.КонтрагентПоСчетуФактуре КАК КонтрагентПоСчетуФактуре,
	|	ЕСТЬNULL(СчетаФактурыДокументы.Контрагент, ЗаписиКнигиПокупок.КонтрагентПоСчетуФактуре) КАК Контрагент,
	|	ЗаписиКнигиПокупок.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ЗаписиКнигиПокупок.СтавкаНДСАванса КАК СтавкаНДСАванса,
	|	ЕСТЬNULL(СчетаФактурыДокументы.СводныйКорректировочный, ЛОЖЬ) КАК СводныйКорректировочный,
	|	ЕСТЬNULL(СчетаФактурыДокументы.СводныйКомиссионный, ЛОЖЬ) КАК СводныйКомиссионный,
	|	ВЫБОР
	|		КОГДА СчетаФактурыДокументы.СчетФактураДокумент ЕСТЬ NULL
	|			ТОГДА ""26""
	|		КОГДА СчетаФактурыДокументы.СчетФактураДокумент ССЫЛКА Документ.ВозвратТоваровОтПокупателя
	|			ТОГДА ""16""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КодВидаОперации,
	|	СчетаФактурыДокументы.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА &Постановление1137_2019
	|				И (СчетаФактурыДокументы.СчетФактураДокумент ССЫЛКА Документ.КорректировкаРеализации
	|					ИЛИ СчетаФактурыДокументы.СчетФактураДокумент ССЫЛКА Документ.ВозвратТоваровОтПокупателя)
	|			ТОГДА ДанныеПервичныхДокументов.Номер
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НомерКорректировки,
	|	ВЫБОР
	|		КОГДА &Постановление1137_2019
	|				И (СчетаФактурыДокументы.СчетФактураДокумент ССЫЛКА Документ.КорректировкаРеализации
	|					ИЛИ СчетаФактурыДокументы.СчетФактураДокумент ССЫЛКА Документ.ВозвратТоваровОтПокупателя)
	|			ТОГДА ДанныеПервичныхДокументов.Дата
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК ДатаКорректировки,
	|	СчетаФактурыДокументы.ЭтоСчетФактураВыданныйНаВозвратПоОтчетуКомиссионера КАК ЭтоСчетФактураВыданныйНаВозвратПоОтчетуКомиссионера
	|ПОМЕСТИТЬ ВТ_ТаблицаСчетаФактурыДокументы
	|ИЗ
	|	ЗаписиКнигиПокупок КАК ЗаписиКнигиПокупок
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СчетаФактурыДокументыПромежуточная КАК СчетаФактурыДокументы
	|		ПО ЗаписиКнигиПокупок.ДокументОснованиеСчетаФактуры = СчетаФактурыДокументы.ДокументОснование
	|			И ЗаписиКнигиПокупок.КонтрагентПоСчетуФактуре = СчетаФактурыДокументы.Контрагент
	|			И ЗаписиКнигиПокупок.ДоговорКонтрагента = СчетаФактурыДокументы.ДоговорКонтрагента
	|			И ЗаписиКнигиПокупок.СтавкаНДСАванса = СчетаФактурыДокументы.СтавкаНДСАванса
	|			И ЗаписиКнигиПокупок.ВозвратЧерезКомиссионера = СчетаФактурыДокументы.ВозвратЧерезКомиссионера
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|		ПО ЗаписиКнигиПокупок.ДокументОснованиеСчетаФактуры = ДанныеПервичныхДокументов.Документ
	|ГДЕ
	|	НЕ(ЗаписиКнигиПокупок.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
	|				И НЕ ЗаписиКнигиПокупок.КодВидаОперации = ""17""
	|				И СчетаФактурыДокументы.ЭтоСчетФактураВыданныйПокупателюПоОтчетуКомиссионера)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактураДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СчетаФактурыДокументыПромежуточная";
	
	// Получаем дополнительную информацию из журнала учета счетов-фактур.
	
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов() +
	"ВЫБРАТЬ
	|	ЖурналУчетаСчетовФактур.Регистратор КАК Регистратор,
	|	ЖурналУчетаСчетовФактур.СчетФактура КАК СчетФактураДокумент,
	|	ЖурналУчетаСчетовФактур.НомерСчетаФактуры КАК НомерСчетаФактуры,
	|	ЖурналУчетаСчетовФактур.ДатаСчетаФактуры КАК ДатаСчетаФактуры,
	|	ЖурналУчетаСчетовФактур.НомерКорректировочногоСчетаФактуры КАК НомерКорректировочногоСчетаФактуры,
	|	ЖурналУчетаСчетовФактур.ДатаКорректировочногоСчетаФактуры КАК ДатаКорректировочногоСчетаФактуры,
	|	ЖурналУчетаСчетовФактур.НомерИсправления КАК НомерИсправления,
	|	ЖурналУчетаСчетовФактур.ДатаИсправления КАК ДатаИсправления,
	|	ЖурналУчетаСчетовФактур.НомерИсправленияКорректировочногоСчетаФактуры КАК НомерИсправленияКорректировки,
	|	ЖурналУчетаСчетовФактур.ДатаИсправленияКорректировочногоСчетаФактуры КАК ДатаИсправленияКорректировки,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ЖурналУчетаСчетовФактур.Продавец
	|		КОГДА ЖурналУчетаСчетовФактур.Контрагент <> ЖурналУчетаСчетовФактур.Организация
	|			ТОГДА ЖурналУчетаСчетовФактур.Контрагент
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ПродавецДляПечати,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ЖурналУчетаСчетовФактур.КПППродавца
	|		КОГДА ЖурналУчетаСчетовФактур.Контрагент <> ЖурналУчетаСчетовФактур.Организация
	|			ТОГДА ЖурналУчетаСчетовФактур.КППКонтрагента
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КПППродавцаДляПечати,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				И ЖурналУчетаСчетовФактур.Контрагент <> ЖурналУчетаСчетовФактур.Организация
	|			ТОГДА ЖурналУчетаСчетовФактур.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК ПосредникСсылка,
	|	ЖурналУчетаСчетовФактур.НомерСтроки КАК НомерСтроки,
	|	ЖурналУчетаСчетовФактур.Валюта КАК Валюта,
	|	ЖурналУчетаСчетовФактур.Валюта.Наименование КАК ВалютаНаименование,
	|	ЖурналУчетаСчетовФактур.Валюта.НаименованиеПолное КАК ВалютаНаименованиеПолное,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураПолученный
	|				И (ВЫРАЗИТЬ(ЖурналУчетаСчетовФактур.СчетФактура КАК Документ.СчетФактураПолученный).ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
	|					ИЛИ ВЫРАЗИТЬ(ЖурналУчетаСчетовФактур.СчетФактура КАК Документ.СчетФактураПолученный).ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.КорректировочныйНаАванс))
	|			ТОГДА ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуреРазницаУвеличение
	|		КОГДА ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
	|				И (ВЫРАЗИТЬ(ЖурналУчетаСчетовФактур.СчетФактура КАК Документ.СчетФактураВыданный).ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.Корректировочный)
	|					ИЛИ ВЫРАЗИТЬ(ЖурналУчетаСчетовФактур.СчетФактура КАК Документ.СчетФактураВыданный).ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.КорректировочнаяСправка))
	|			ТОГДА ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуреРазницаУменьшение
	|		КОГДА ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
	|				И ВЫРАЗИТЬ(ЖурналУчетаСчетовФактур.СчетФактура КАК Документ.СчетФактураВыданный).ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.КорректировочныйНаАванс)
	|			ТОГДА ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуреРазницаУвеличение
	|		ИНАЧЕ ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуре
	|	КОНЕЦ КАК ВсегоПокупокВВалюте,
	|	ЖурналУчетаСчетовФактур.Валюта.Код КАК ВалютаКод,
	|	ЖурналУчетаСчетовФактур.КодВидаОперации КАК КодВидаОперации,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ЖурналУчетаСчетовФактур.ИННПродавца
	|		КОГДА ЖурналУчетаСчетовФактур.Контрагент <> ЖурналУчетаСчетовФактур.Организация
	|			ТОГДА ЖурналУчетаСчетовФактур.ИННКонтрагента
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ИННПродавцаДляПечати,
	|	ЖурналУчетаСчетовФактур.Продавец КАК Продавец,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				И ЖурналУчетаСчетовФактур.Контрагент <> ЖурналУчетаСчетовФактур.Организация
	|			ТОГДА ЖурналУчетаСчетовФактур.ИННКонтрагента
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПосредникИНН,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				И ЖурналУчетаСчетовФактур.Контрагент <> ЖурналУчетаСчетовФактур.Организация
	|			ТОГДА ЖурналУчетаСчетовФактур.КППКонтрагента
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПосредникКПП
	|ПОМЕСТИТЬ ВТ_РегистрацияСчетовФактур
	|ИЗ
	|	РегистрСведений.ЖурналУчетаСчетовФактур КАК ЖурналУчетаСчетовФактур
	|ГДЕ
	|	ЖурналУчетаСчетовФактур.СчетФактура В
	|			(ВЫБРАТЬ
	|				ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент
	|			ИЗ
	|				ВТ_ТаблицаСчетаФактурыДокументы)
	|	И ЖурналУчетаСчетовФактур.Организация В(&Организация)
	|	И НЕ ЖурналУчетаСчетовФактур.Сторно
	|	И НЕ(ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.ЗаявлениеОВвозеТоваров
	|				И ЖурналУчетаСчетовФактур.ЧастьЖурнала = ЗНАЧЕНИЕ(Перечисление.ЧастиЖурналаУчетаСчетовФактур.ВыставленныеСчетаФактуры))
	|	И НЕ(ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
	|				И ЖурналУчетаСчетовФактур.ЧастьЖурнала = ЗНАЧЕНИЕ(Перечисление.ЧастиЖурналаУчетаСчетовФактур.ПолученныеСчетаФактуры))
	|	И ВЫБОР
	|			КОГДА &Постановление1137_2019
	|					И ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
	|				ТОГДА ВЫРАЗИТЬ(ЖурналУчетаСчетовФактур.СчетФактура КАК Документ.СчетФактураВыданный).ВидСчетаФактуры <> ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.СводнаяСправка)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактураДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РегистрацияСчетовФактур.СчетФактураДокумент КАК СчетФактураДокумент,
	|	СУММА(ВТ_РегистрацияСчетовФактур.ВсегоПокупокВВалюте) КАК ВсегоПокупокВВалюте
	|ПОМЕСТИТЬ СуммыПродажПоСчетамФактурам
	|ИЗ
	|	ВТ_РегистрацияСчетовФактур КАК ВТ_РегистрацияСчетовФактур
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РегистрацияСчетовФактур.СчетФактураДокумент
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактураДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.СводныйКорректировочный
	|			ТОГДА ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры
	|		ИНАЧЕ ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаСчетаФактуры, ВТ_ТаблицаСчетаФактурыДокументы.ДатаСчетаФактуры)
	|	КОНЕЦ КАК ДатаСчетаФактуры,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.СводныйКорректировочный
	|			ТОГДА ВТ_РегистрацияСчетовФактур.НомерКорректировочногоСчетаФактуры
	|		ИНАЧЕ ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.НомерСчетаФактуры, ВТ_ТаблицаСчетаФактурыДокументы.НомерСчетаФактуры)
	|	КОНЕЦ КАК НомерСчетаФактуры,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.СводныйКорректировочный
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		ИНАЧЕ ВТ_РегистрацияСчетовФактур.ДатаИсправления
	|	КОНЕЦ КАК ДатаИсправления,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.СводныйКорректировочный
	|			ТОГДА """"
	|		ИНАЧЕ ВТ_РегистрацияСчетовФактур.НомерИсправления
	|	КОНЕЦ КАК НомерИсправления,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.СводныйКорректировочный
	|			ТОГДА ВТ_РегистрацияСчетовФактур.НомерКорректировочногоСчетаФактуры
	|	КОНЕЦ КАК НомерСчетаФактурыСортировка,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.СводныйКорректировочный
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаИсправленияКорректировки, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ВТ_РегистрацияСчетовФактур.ДатаИсправленияКорректировки
	|					КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры
	|				КОНЕЦ
	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаИсправленияКорректировки, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВТ_РегистрацияСчетовФактур.ДатаИсправленияКорректировки
	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры
	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаИсправления, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВТ_РегистрацияСчетовФактур.ДатаИсправления
	|		ИНАЧЕ ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаСчетаФактуры, ВТ_ТаблицаСчетаФактурыДокументы.ДатаСчетаФактуры)
	|	КОНЕЦ КАК ДатаСчетаФактурыСортировка,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.НомерКорректировки <> """"
	|			ТОГДА ВТ_ТаблицаСчетаФактурыДокументы.НомерКорректировки
	|		ИНАЧЕ ВТ_РегистрацияСчетовФактур.НомерКорректировочногоСчетаФактуры
	|	КОНЕЦ КАК НомерКорректировки,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.ДатаКорректировки <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВТ_ТаблицаСчетаФактурыДокументы.ДатаКорректировки
	|		ИНАЧЕ ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры
	|	КОНЕЦ КАК ДатаКорректировки,
	|	ВТ_РегистрацияСчетовФактур.НомерИсправленияКорректировки КАК НомерИсправленияКорректировки,
	|	ВТ_РегистрацияСчетовФактур.ДатаИсправленияКорректировки КАК ДатаИсправленияКорректировки,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.ДокументОснованиеСчетаФактуры ССЫЛКА Документ.ВозвратТоваровОтПокупателя
	|				И ВТ_РегистрацияСчетовФактур.СчетФактураДокумент ССЫЛКА Документ.СчетФактураВыданный
	|			ТОГДА ВЫРАЗИТЬ(ВТ_РегистрацияСчетовФактур.СчетФактураДокумент КАК Документ.СчетФактураВыданный).КодВидаОперацииНаУменьшение
	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.ЭтоСчетФактураВыданныйНаВозвратПоОтчетуКомиссионера
	|				И ВТ_РегистрацияСчетовФактур.СчетФактураДокумент ССЫЛКА Документ.СчетФактураВыданный
	|			ТОГДА ВЫРАЗИТЬ(ВТ_РегистрацияСчетовФактур.СчетФактураДокумент КАК Документ.СчетФактураВыданный).КодВидаОперацииНаУменьшение
	|		ИНАЧЕ ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.КодВидаОперации, ВТ_ТаблицаСчетаФактурыДокументы.КодВидаОперации)
	|	КОНЕЦ КАК КодВидаОперации,
	|	ВТ_ТаблицаСчетаФактурыДокументы.ДокументОснованиеСчетаФактуры КАК ДокументОснованиеСчетаФактуры,
	|	ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.СчетФактураДокумент, ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент) КАК СчетФактураДокумент,
	|	ВТ_ТаблицаСчетаФактурыДокументы.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВТ_ТаблицаСчетаФактурыДокументы.СтавкаНДСАванса КАК СтавкаНДСАванса,
	|	ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент КАК СчетФактураДокументРасшифровка,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент ССЫЛКА Документ.СчетФактураВыданный
	|				ИЛИ ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент ССЫЛКА Документ.ЗаявлениеОВвозеТоваров
	|				ИЛИ ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент ССЫЛКА Документ.ВозвратТоваровОтПокупателя
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_РегистрацияСчетовФактур.СчетФактураДокумент ЕСТЬ NULL
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОбрабатыватьНомерДокумента,
	|	ВТ_ТаблицаСчетаФактурыДокументы.СводныйКорректировочный КАК СводныйКорректировочный,
	|	ВТ_ТаблицаСчетаФактурыДокументы.СводныйКомиссионный КАК СводныйКомиссионный,
	|	ВТ_ТаблицаСчетаФактурыДокументы.КонтрагентПоСчетуФактуре КАК КонтрагентПоСчетуФактуре,
	|	ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ПродавецДляПечати, ВТ_ТаблицаСчетаФактурыДокументы.Контрагент) КАК ПродавецДляПечати,
	|	ВТ_РегистрацияСчетовФактур.ИННПродавцаДляПечати КАК ИННПродавцаДляПечати,
	|	ВТ_РегистрацияСчетовФактур.КПППродавцаДляПечати КАК КПППродавцаДляПечати,
	|	ВТ_РегистрацияСчетовФактур.ПосредникСсылка КАК ПосредникСсылка,
	|	ВТ_РегистрацияСчетовФактур.ПосредникИНН КАК ПосредникИНН,
	|	ВТ_РегистрацияСчетовФактур.ПосредникКПП КАК ПосредникКПП,
	|	СуммыПродажПоСчетамФактурам.ВсегоПокупокВВалюте КАК ВсегоПокупокВВалюте,
	|	ВТ_РегистрацияСчетовФактур.Валюта КАК Валюта,
	|	ВТ_РегистрацияСчетовФактур.ВалютаНаименование КАК ВалютаНаименование,
	|	ВТ_РегистрацияСчетовФактур.ВалютаНаименованиеПолное КАК ВалютаНаименованиеПолное,
	|	ВТ_РегистрацияСчетовФактур.ВалютаКод КАК ВалютаКод
	|ПОМЕСТИТЬ ТаблицаСчетаФактурыДокументыПредварительная
	|ИЗ
	|	ВТ_ТаблицаСчетаФактурыДокументы КАК ВТ_ТаблицаСчетаФактурыДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РегистрацияСчетовФактур КАК ВТ_РегистрацияСчетовФактур
	|		ПО ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент = ВТ_РегистрацияСчетовФактур.СчетФактураДокумент
	|			И (НЕ ВТ_ТаблицаСчетаФактурыДокументы.СводныйКорректировочный
	|					И НЕ ВТ_ТаблицаСчетаФактурыДокументы.СводныйКомиссионный
	|				ИЛИ ВТ_ТаблицаСчетаФактурыДокументы.НомерСтроки = ВТ_РегистрацияСчетовФактур.НомерСтроки)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммыПродажПоСчетамФактурам КАК СуммыПродажПоСчетамФактурам
	|		ПО ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент = СуммыПродажПоСчетамФактурам.СчетФактураДокумент
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОснованиеСчетаФактуры,
	|	КонтрагентПоСчетуФактуре,
	|	ДатаСчетаФактуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаСчетаФактурыДокументыПредварительная.ДатаСчетаФактуры КАК ДатаСчетаФактуры,
	|	ТаблицаСчетаФактурыДокументыПредварительная.НомерСчетаФактуры КАК НомерСчетаФактуры,
	|	ТаблицаСчетаФактурыДокументыПредварительная.ДатаИсправления КАК ДатаИсправления,
	|	ТаблицаСчетаФактурыДокументыПредварительная.НомерИсправления КАК НомерИсправления,
	|	ТаблицаСчетаФактурыДокументыПредварительная.НомерСчетаФактурыСортировка КАК НомерСчетаФактурыСортировка,
	|	ТаблицаСчетаФактурыДокументыПредварительная.ДатаСчетаФактурыСортировка КАК ДатаСчетаФактурыСортировка,
	|	ТаблицаСчетаФактурыДокументыПредварительная.НомерКорректировки КАК НомерКорректировки,
	|	ТаблицаСчетаФактурыДокументыПредварительная.ДатаКорректировки КАК ДатаКорректировки,
	|	ТаблицаСчетаФактурыДокументыПредварительная.НомерИсправленияКорректировки КАК НомерИсправленияКорректировки,
	|	ТаблицаСчетаФактурыДокументыПредварительная.ДатаИсправленияКорректировки КАК ДатаИсправленияКорректировки,
	|	ТаблицаСчетаФактурыДокументыПредварительная.КодВидаОперации КАК КодВидаОперации,
	|	ТаблицаСчетаФактурыДокументыПредварительная.ДокументОснованиеСчетаФактуры КАК ДокументОснованиеСчетаФактуры,
	|	ТаблицаСчетаФактурыДокументыПредварительная.СчетФактураДокумент КАК СчетФактураДокумент,
	|	ТаблицаСчетаФактурыДокументыПредварительная.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ТаблицаСчетаФактурыДокументыПредварительная.СтавкаНДСАванса КАК СтавкаНДСАванса,
	|	ТаблицаСчетаФактурыДокументыПредварительная.СчетФактураДокументРасшифровка КАК СчетФактураДокументРасшифровка,
	|	ТаблицаСчетаФактурыДокументыПредварительная.ОбрабатыватьНомерДокумента КАК ОбрабатыватьНомерДокумента,
	|	ТаблицаСчетаФактурыДокументыПредварительная.СводныйКорректировочный КАК СводныйКорректировочный,
	|	ТаблицаСчетаФактурыДокументыПредварительная.СводныйКомиссионный КАК СводныйКомиссионный,
	|	ТаблицаСчетаФактурыДокументыПредварительная.КонтрагентПоСчетуФактуре КАК КонтрагентПоСчетуФактуре,
	|	ТаблицаСчетаФактурыДокументыПредварительная.ПродавецДляПечати КАК ПродавецДляПечати,
	|	ТаблицаСчетаФактурыДокументыПредварительная.ИННПродавцаДляПечати КАК ИННПродавцаДляПечати,
	|	ТаблицаСчетаФактурыДокументыПредварительная.КПППродавцаДляПечати КАК КПППродавцаДляПечати,
	|	ТаблицаСчетаФактурыДокументыПредварительная.ПосредникСсылка КАК ПосредникСсылка,
	|	ТаблицаСчетаФактурыДокументыПредварительная.ПосредникИНН КАК ПосредникИНН,
	|	ТаблицаСчетаФактурыДокументыПредварительная.ПосредникКПП КАК ПосредникКПП,
	|	ТаблицаСчетаФактурыДокументыПредварительная.ВсегоПокупокВВалюте КАК ВсегоПокупокВВалюте,
	|	ТаблицаСчетаФактурыДокументыПредварительная.Валюта КАК Валюта,
	|	ТаблицаСчетаФактурыДокументыПредварительная.ВалютаНаименование КАК ВалютаНаименование,
	|	ТаблицаСчетаФактурыДокументыПредварительная.ВалютаНаименованиеПолное КАК ВалютаНаименованиеПолное,
	|	ТаблицаСчетаФактурыДокументыПредварительная.ВалютаКод КАК ВалютаКод,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_СводныеСправки.СводнаяСправка ЕСТЬ NULL
	|				И ТаблицаСчетаФактурыДокументыПредварительная.ДокументОснованиеСчетаФактуры ССЫЛКА Документ.ОтчетКомиссионераОПродажах
	|				И ТаблицаСчетаФактурыДокументыПредварительная.СчетФактураДокумент ССЫЛКА Документ.СчетФактураПолученный
	|			ТОГДА ЗНАЧЕНИЕ(Документ.СчетФактураВыданный.ПустаяСсылка)
	|		ИНАЧЕ ЕСТЬNULL(ВТ_СводныеСправки.СводнаяСправка, ЗНАЧЕНИЕ(Документ.СчетФактураВыданный.ПустаяСсылка))
	|	КОНЕЦ КАК СводнаяСправка
	|ПОМЕСТИТЬ ТаблицаСчетаФактурыДокументы
	|ИЗ
	|	ТаблицаСчетаФактурыДокументыПредварительная КАК ТаблицаСчетаФактурыДокументыПредварительная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СводныеСправки КАК ВТ_СводныеСправки
	|		ПО ТаблицаСчетаФактурыДокументыПредварительная.ДокументОснованиеСчетаФактуры = ВТ_СводныеСправки.ДокументВозврата
	|			И ТаблицаСчетаФактурыДокументыПредварительная.ДатаСчетаФактуры = ВТ_СводныеСправки.ДатаСправки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОснованиеСчетаФактуры,
	|	КонтрагентПоСчетуФактуре
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ТаблицаСчетаФактурыДокументы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаСчетаФактурыДокументыПредварительная"
	+ ОбщегоНазначения.РазделительПакетаЗапросов();
		
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область ЗаписиКнигиПродаж

Функция ТекстЗапросаРеквизитыСчетовФактурПостановление735КнигаПродаж() Экспорт
	
	// Счета-фактуры выданные, составленные от имени продавца, возникают у комиссионера, в книге не отражаются.
	// Т.к. у счетов-фактур, составленных от имени продавца, и выданных комитенту на вознаграждение один и тот же 
	// документ - основание (отчет комитенту), то необходимо отбирать только счета-фактуры на вознаграждение, 
	// чтобы не задвоились записи при соединении регистра НДС и списка документов.
	
	// Счета-фактуры полученные, составленные от имени продавца, отражаются в базе комитента и
	// на основании их комитент принимает НДС к вычету, поэтому для счетов-фактур полученных отбор по
	// флагу "Составлен от имени продавца" не должен выполняться.
	//
	// Счета-фактуры (полученные и выданные) на аванс в базе комиссионера, составленные от имени продавца, 
	// не формируют движения по регистрам НДС, поэтому задвоение данных при соединении регистров с ними не возникает.
	
	// Для списка счетов-фактур получаем данные документов-оснований.
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА (СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс)
	|					ИЛИ СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НалоговыйАгент))
	|					И (СчетФактураВыданный.Исправление
	|						ИЛИ СФВыданныйДокументыОснования.ДокументОснование ССЫЛКА Документ.ОтчетКомиссионераОПродажах)
	|				ИЛИ СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаРеализацию)
	|					И (СФВыданныйДокументыОснования.ДокументОснование ССЫЛКА Документ.ОказаниеУслуг
	|						ИЛИ СФВыданныйДокументыОснования.ДокументОснование ССЫЛКА Документ.ОтчетКомиссионераОПродажах
	|							И СчетФактураВыданный.Контрагент <> ВЫРАЗИТЬ(СФВыданныйДокументыОснования.ДокументОснование КАК Документ.ОтчетКомиссионераОПродажах).Контрагент)
	|				ИЛИ СФВыданныйДокументыОснования.ДокументОснование ССЫЛКА Документ.ПодтверждениеНулевойСтавкиНДС
	|			ТОГДА СФВыданныйДокументыОснования.Ссылка
	|		ИНАЧЕ СФВыданныйДокументыОснования.ДокументОснование
	|	КОНЕЦ КАК СчетФактура,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.Корректировочный)
	|				ИЛИ СчетФактураВыданный.Исправление
	|			ТОГДА СФВыданныйДокументыОснования.НомерИсходногоДокумента
	|		ИНАЧЕ СчетФактураВыданный.Номер
	|	КОНЕЦ КАК НомерСчетаФактуры,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.Корректировочный)
	|				ИЛИ СчетФактураВыданный.Исправление
	|			ТОГДА СФВыданныйДокументыОснования.ДатаИсходногоДокумента
	|		ИНАЧЕ СчетФактураВыданный.Дата
	|	КОНЕЦ КАК ДатаСчетаФактуры,
	|	СФВыданныйДокументыОснования.Ссылка КАК СчетФактураДокумент,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс)
	|			ТОГДА ЕСТЬNULL(СФВыданныйАвансы.СтавкаНДС, НЕОПРЕДЕЛЕНО)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СтавкаНДСАванса,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс)
	|				ИЛИ СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НалоговыйАгент)
	|			ТОГДА СчетФактураВыданный.ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ КАК ДоговорАванса,
	|	СчетФактураВыданный.Контрагент КАК Контрагент,
	|	СФВыданныйДокументыОснования.НомерСтроки КАК НомерСтроки,
	|	СчетФактураВыданный.СводныйКорректировочный КАК СводныйКорректировочный,
	|	ЛОЖЬ КАК СводныйКомиссионный,
	|	"""" КАК КодВидаОперации
	|ПОМЕСТИТЬ ВТ_СчетаФактурыПромежуточная
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СФВыданныйДокументыОснования
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.Авансы КАК СФВыданныйАвансы
	|		ПО СФВыданныйДокументыОснования.Ссылка = СФВыданныйАвансы.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокСчетовФактур КАК СписокДокументовОснований
	|		ПО СФВыданныйДокументыОснования.ДокументОснование = СписокДокументовОснований.СчетФактура
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокСчетовФактур КАК СписокСФОснований
	|		ПО СФВыданныйДокументыОснования.Ссылка = СписокСФОснований.СчетФактура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО СФВыданныйДокументыОснования.Ссылка = СчетФактураВыданный.Ссылка
	|ГДЕ
	|	ВЫБОР
	|			КОГДА (СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс)
	|						ИЛИ СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НалоговыйАгент))
	|						И (СчетФактураВыданный.Исправление
	|							ИЛИ СФВыданныйДокументыОснования.ДокументОснование ССЫЛКА Документ.ОтчетКомиссионераОПродажах)
	|					ИЛИ СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаРеализацию)
	|						И (СФВыданныйДокументыОснования.ДокументОснование ССЫЛКА Документ.ОказаниеУслуг
	|							ИЛИ СФВыданныйДокументыОснования.ДокументОснование ССЫЛКА Документ.ОтчетКомиссионераОПродажах
	|								И СчетФактураВыданный.Контрагент <> ВЫРАЗИТЬ(СФВыданныйДокументыОснования.ДокументОснование КАК Документ.ОтчетКомиссионераОПродажах).Контрагент)
	|					ИЛИ СФВыданныйДокументыОснования.ДокументОснование ССЫЛКА Документ.ПодтверждениеНулевойСтавкиНДС
	|				ТОГДА СписокСФОснований.СчетФактура ЕСТЬ НЕ NULL 
	|			ИНАЧЕ СписокДокументовОснований.СчетФактура ЕСТЬ НЕ NULL 
	|		КОНЕЦ
	|	И (СчетФактураВыданный.Продавец = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ИЛИ СчетФактураВыданный.Продавец = СчетФактураВыданный.Контрагент
	|				И НЕ СчетФактураВыданный.ДоговорКонтрагента.СчетаФактурыОтИмениОрганизации)
	|	И НЕ СчетФактураВыданный.СводныйКомиссионный
	|	И СчетФактураВыданный.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СчетФактураВыданный.Ссылка,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.Корректировочный)
	|				ИЛИ СчетФактураВыданный.Ссылка.Исправление
	|			ТОГДА СчетФактураВыданный.НомерИсходногоДокумента
	|		ИНАЧЕ СчетФактураВыданный.Ссылка.Номер
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.Корректировочный)
	|				ИЛИ СчетФактураВыданный.Ссылка.Исправление
	|			ТОГДА СчетФактураВыданный.ДатаИсходногоДокумента
	|		ИНАЧЕ СчетФактураВыданный.Ссылка.Дата
	|	КОНЕЦ,
	|	СчетФактураВыданный.Ссылка,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка),
	|	ЕСТЬNULL(ОтчетКомиссионераОПродажахПокупатели.Покупатель, СчетФактураВыданный.Ссылка.Контрагент),
	|	ЕСТЬNULL(ОтчетКомиссионераОПродажахПокупатели.НомерСтроки, СчетФактураВыданный.НомерСтроки),
	|	СчетФактураВыданный.Ссылка.СводныйКорректировочный,
	|	ИСТИНА,
	|	""""
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданный
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокСчетовФактур КАК СчетаФактуры
	|		ПО СчетФактураВыданный.Ссылка = СчетаФактуры.СчетФактура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионераОПродажах.Покупатели КАК ОтчетКомиссионераОПродажахПокупатели
	|		ПО СчетФактураВыданный.ДокументОснование = ОтчетКомиссионераОПродажахПокупатели.Ссылка
	|			И СчетФактураВыданный.Ссылка = ОтчетКомиссионераОПродажахПокупатели.СчетФактура
	|ГДЕ
	|	СчетаФактуры.СчетФактура ЕСТЬ НЕ NULL 
	|	И (СчетФактураВыданный.Ссылка.Продавец = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ИЛИ СчетФактураВыданный.Ссылка.Продавец = СчетФактураВыданный.Ссылка.Контрагент)
	|	И СчетФактураВыданный.Ссылка.СводныйКомиссионный
	|	И НЕ СчетФактураВыданный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс)
	|	И СчетФактураВыданный.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Авансы.Ссылка,
	|	Авансы.Ссылка.Номер,
	|	Авансы.Ссылка.Дата,
	|	Авансы.Ссылка,
	|	Авансы.СтавкаНДС,
	|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка),
	|	Авансы.Контрагент,
	|	Авансы.НомерСтроки,
	|	Авансы.Ссылка.СводныйКорректировочный,
	|	ИСТИНА,
	|	""""
	|ИЗ
	|	Документ.СчетФактураВыданный.Авансы КАК Авансы
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокСчетовФактур КАК СчетаФактуры
	|		ПО Авансы.Ссылка = СчетаФактуры.СчетФактура
	|ГДЕ
	|	СчетаФактуры.СчетФактура ЕСТЬ НЕ NULL 
	|	И Авансы.Ссылка.СводныйКомиссионный
	|	И Авансы.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс)
	|	И Авансы.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаАванс)
	|				И (СчетФактураПолученный.Ссылка.Исправление
	|					ИЛИ СчетФактураПолученный.Ссылка.ИсправлениеСобственнойОшибки)
	|			ТОГДА СФПолученныйДокументыОснования.Ссылка
	|		ИНАЧЕ СФПолученныйДокументыОснования.ДокументОснование
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
	|			ТОГДА СФПолученныйДокументыОснования.НомерИсходногоДокумента
	|		ИНАЧЕ СчетФактураПолученный.НомерВходящегоДокумента
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
	|			ТОГДА СФПолученныйДокументыОснования.ДатаИсходногоДокумента
	|		ИНАЧЕ СчетФактураПолученный.ДатаВходящегоДокумента
	|	КОНЕЦ,
	|	СчетФактураПолученный.Ссылка,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаАванс)
	|			ТОГДА ЕСТЬNULL(СФПолученныйАвансы.СтавкаНДС, НЕОПРЕДЕЛЕНО)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаАванс)
	|			ТОГДА СчетФактураПолученный.ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ,
	|	СчетФактураПолученный.Контрагент,
	|	СФПолученныйДокументыОснования.НомерСтроки,
	|	СчетФактураПолученный.СводныйКорректировочный,
	|	ЛОЖЬ,
	|	СчетФактураПолученный.КодВидаОперацииНаУменьшение
	|ИЗ
	|	Документ.СчетФактураПолученный.ДокументыОснования КАК СФПолученныйДокументыОснования
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.Авансы КАК СФПолученныйАвансы
	|		ПО СФПолученныйДокументыОснования.Ссылка = СФПолученныйАвансы.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокСчетовФактур КАК СписокДокументовОснований
	|		ПО СФПолученныйДокументыОснования.ДокументОснование = СписокДокументовОснований.СчетФактура
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокСчетовФактур КАК СписокСФОснований
	|		ПО СФПолученныйДокументыОснования.Ссылка = СписокСФОснований.СчетФактура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|		ПО СФПолученныйДокументыОснования.Ссылка = СчетФактураПолученный.Ссылка
	|ГДЕ
	|	ВЫБОР
	|			КОГДА СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаАванс)
	|					И СчетФактураПолученный.Исправление
	|				ТОГДА СписокСФОснований.СчетФактура ЕСТЬ НЕ NULL 
	|			ИНАЧЕ СписокДокументовОснований.СчетФактура ЕСТЬ НЕ NULL 
	|		КОНЕЦ
	|	И НЕ СФПолученныйДокументыОснования.ДокументОснование ССЫЛКА Документ.ОтчетКомитентуОПродажах
	|	И НЕ СФПолученныйДокументыОснования.ДокументОснование ССЫЛКА Документ.ОтчетКомиссионераОПродажах
	|	И СчетФактураПолученный.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ГТДИмпорт.Ссылка,
	|	ГТДИмпорт.НомерГТД,
	|	ГТДИмпорт.Дата,
	|	ГТДИмпорт.Ссылка,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка),
	|	ГТДИмпорт.Контрагент,
	|	0,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	""""
	|ИЗ
	|	Документ.ГТДИмпорт КАК ГТДИмпорт
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокСчетовФактур КАК СчетаФактуры
	|		ПО ГТДИмпорт.Ссылка = СчетаФактуры.СчетФактура
	|ГДЕ
	|	СчетаФактуры.СчетФактура ЕСТЬ НЕ NULL 
	|	И ГТДИмпорт.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратТоваровОтПокупателя.Ссылка,
	|	ВозвратТоваровОтПокупателя.НомерРасходногоКассовогоОрдера,
	|	ВозвратТоваровОтПокупателя.ДатаРасходногоКассовогоОрдера,
	|	ВозвратТоваровОтПокупателя.Ссылка,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка),
	|	ВозвратТоваровОтПокупателя.Контрагент,
	|	0,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	""""
	|ИЗ
	|	Документ.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокСчетовФактур КАК СчетаФактуры
	|		ПО ВозвратТоваровОтПокупателя.Ссылка = СчетаФактуры.СчетФактура
	|ГДЕ
	|	СчетаФактуры.СчетФактура ЕСТЬ НЕ NULL 
	|	И ВозвратТоваровОтПокупателя.Сделка ССЫЛКА Документ.ОтчетОРозничныхПродажах
	|	И ВозвратТоваровОтПокупателя.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаявлениеОВвозеТоваров.Ссылка,
	|	ЗаявлениеОВвозеТоваров.Номер,
	|	ЗаявлениеОВвозеТоваров.Дата,
	|	ЗаявлениеОВвозеТоваров.Ссылка,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка),
	|	ЗаявлениеОВвозеТоваров.Контрагент,
	|	0,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	""""
	|ИЗ
	|	Документ.ЗаявлениеОВвозеТоваров КАК ЗаявлениеОВвозеТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокСчетовФактур КАК СчетаФактуры
	|		ПО ЗаявлениеОВвозеТоваров.Ссылка = СчетаФактуры.СчетФактура
	|ГДЕ
	|	СчетаФактуры.СчетФактура ЕСТЬ НЕ NULL 
	|	И ЗаявлениеОВвозеТоваров.Проведен
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура,
	|	СтавкаНДСАванса,
	|	ДоговорАванса,
	|	Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаписиКнигиПродаж.СчетФактура КАК СчетФактура,
	|	ЗаписиКнигиПродаж.ДокументОплаты КАК ДокументОплаты,
	|	ЗаписиКнигиПродаж.Организация КАК Организация,
	|	ЗаписиКнигиПродаж.ДоговорАванса КАК ДоговорАванса,
	|	ЗаписиКнигиПродаж.СтавкаНДС_Аванс КАК СтавкаНДСАванса,
	|	ЗаписиКнигиПродаж.КонтрагентПоСчетуФактуре КАК КонтрагентПоСчетуФактуре,
	|	СчетаФактурыДокументы.ДатаСчетаФактуры КАК ДатаСчетаФактуры,
	|	СчетаФактурыДокументы.НомерСчетаФактуры КАК НомерСчетаФактуры,
	|	СчетаФактурыДокументы.СчетФактураДокумент КАК СчетФактураДокумент,
	|	СчетаФактурыДокументы.НомерСтроки КАК НомерСтроки,
	|	СчетаФактурыДокументы.СводныйКорректировочный КАК СводныйКорректировочный,
	|	СчетаФактурыДокументы.СводныйКомиссионный КАК СводныйКомиссионный,
	|	ЛОЖЬ КАК НачислениеПоОказаниюУслуг,
	|	ВЫБОР
	|		КОГДА СчетаФактурыДокументы.СчетФактура ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА &КонецПериода >= ДАТАВРЕМЯ(2015, 1, 1)
	|						ТОГДА ""26""
	|					ИНАЧЕ ""01""
	|				КОНЕЦ
	|		КОГДА &КонецПериода >= ДАТАВРЕМЯ(2015, 1, 1)
	|				И СчетаФактурыДокументы.КодВидаОперации <> """"
	|			ТОГДА СчетаФактурыДокументы.КодВидаОперации
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КодВидаОперации
	|ПОМЕСТИТЬ ВТ_ЗаписиКнигиПродажПоДокументуОснования
	|ИЗ
	|	ЗаписиКнигиПродаж КАК ЗаписиКнигиПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СчетаФактурыПромежуточная КАК СчетаФактурыДокументы
	|		ПО ЗаписиКнигиПродаж.СчетФактура = СчетаФактурыДокументы.СчетФактура
	|			И ЗаписиКнигиПродаж.СтавкаНДС_Аванс = СчетаФактурыДокументы.СтавкаНДСАванса
	|			И ЗаписиКнигиПродаж.ДоговорАванса = СчетаФактурыДокументы.ДоговорАванса
	|			И (СчетаФактурыДокументы.Контрагент ЕСТЬ NULL
	|				ИЛИ ЗаписиКнигиПродаж.КонтрагентПоСчетуФактуре = СчетаФактурыДокументы.Контрагент)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаписиКнигиПродаж.СчетФактура КАК СчетФактура,
	|	ЗаписиКнигиПродаж.ДокументОплаты КАК ДокументОплаты,
	|	ЗаписиКнигиПродаж.Организация КАК Организация,
	|	ЗаписиКнигиПродаж.ДоговорАванса КАК ДоговорАванса,
	|	ЗаписиКнигиПродаж.СтавкаНДСАванса КАК СтавкаНДСАванса,
	|	ЗаписиКнигиПродаж.КонтрагентПоСчетуФактуре КАК КонтрагентПоСчетуФактуре
	|ПОМЕСТИТЬ ВТ_ЗаписиКнигиПродажПоДокументуОснованияБезСчетаФактуры
	|ИЗ
	|	ВТ_ЗаписиКнигиПродажПоДокументуОснования КАК ЗаписиКнигиПродаж
	|ГДЕ
	|	ЗаписиКнигиПродаж.СчетФактураДокумент ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОплаты,
	|	ДоговорАванса,
	|	СтавкаНДСАванса,
	|	КонтрагентПоСчетуФактуре
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаписиКнигиПродаж.СчетФактура КАК СчетФактура,
	|	ЗаписиКнигиПродаж.Организация КАК Организация,
	|	ЗаписиКнигиПродаж.ДоговорАванса КАК ДоговорАванса,
	|	ЗаписиКнигиПродаж.СтавкаНДСАванса КАК СтавкаНДСАванса,
	|	ЗаписиКнигиПродаж.КонтрагентПоСчетуФактуре КАК КонтрагентПоСчетуФактуре,
	|	СчетаФактурыДокументы.ДатаСчетаФактуры КАК ДатаСчетаФактуры,
	|	СчетаФактурыДокументы.НомерСчетаФактуры КАК НомерСчетаФактуры,
	|	СчетаФактурыДокументы.СчетФактураДокумент КАК СчетФактураДокумент,
	|	СчетаФактурыДокументы.НомерСтроки КАК НомерСтроки,
	|	СчетаФактурыДокументы.СводныйКорректировочный КАК СводныйКорректировочный,
	|	СчетаФактурыДокументы.СводныйКомиссионный КАК СводныйКомиссионный,
	|	ЛОЖЬ КАК НачислениеПоОказаниюУслуг,
	|	ВЫБОР
	|		КОГДА СчетаФактурыДокументы.СчетФактура ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА &КонецПериода >= ДАТАВРЕМЯ(2015, 1, 1)
	|						ТОГДА ""26""
	|					ИНАЧЕ ""01""
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КодВидаОперации
	|ПОМЕСТИТЬ ВТ_ЗаписиКнигиПродажПоДокументуОплаты
	|ИЗ
	|	ВТ_ЗаписиКнигиПродажПоДокументуОснованияБезСчетаФактуры КАК ЗаписиКнигиПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СчетаФактурыПромежуточная КАК СчетаФактурыДокументы
	|		ПО ЗаписиКнигиПродаж.СтавкаНДСАванса = СчетаФактурыДокументы.СтавкаНДСАванса
	|			И (ЗаписиКнигиПродаж.КонтрагентПоСчетуФактуре = ЕСТЬNULL(СчетаФактурыДокументы.Контрагент, ЗаписиКнигиПродаж.КонтрагентПоСчетуФактуре))
	|			И ЗаписиКнигиПродаж.ДоговорАванса = СчетаФактурыДокументы.ДоговорАванса
	|			И ЗаписиКнигиПродаж.ДокументОплаты = СчетаФактурыДокументы.СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЗаписиКнигиПродажПоДокументуОснованияБезСчетаФактуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаписиКнигиПродаж.СчетФактура КАК СчетФактура,
	|	ЗаписиКнигиПродаж.Организация КАК Организация,
	|	ЗаписиКнигиПродаж.ДоговорАванса КАК ДоговорАванса,
	|	ЗаписиКнигиПродаж.СтавкаНДСАванса КАК СтавкаНДСАванса,
	|	ЗаписиКнигиПродаж.КонтрагентПоСчетуФактуре КАК КонтрагентПоСчетуФактуре
	|ПОМЕСТИТЬ ВТ_ЗаписиКнигиПродажПоДокументуОплатыБезСчетаФактуры
	|ИЗ
	|	ВТ_ЗаписиКнигиПродажПоДокументуОплаты КАК ЗаписиКнигиПродаж
	|ГДЕ
	|	ЗаписиКнигиПродаж.СчетФактураДокумент ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаписиКнигиПродаж.СчетФактура КАК СчетФактура,
	|	ЗаписиКнигиПродаж.КонтрагентПоСчетуФактуре КАК КонтрагентПоСчетуФактуре,
	|	ДанныеПервичныхДокументов.Дата КАК ДатаСчетаФактуры,
	|	ДанныеПервичныхДокументов.Номер КАК НомерСчетаФактуры,
	|	ВЫБОР
	|		КОГДА ЗаписиКнигиПродаж.СчетФактура ССЫЛКА Документ.ОказаниеУслуг
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НачислениеПоОказаниюУслуг,
	|	ВЫБОР
	|		КОГДА &КонецПериода >= ДАТАВРЕМЯ(2015, 1, 1)
	|			ТОГДА ""26""
	|		ИНАЧЕ ""01""
	|	КОНЕЦ КАК КодВидаОперации
	|ПОМЕСТИТЬ ВТ_ЗаписиКнигиПродажПоДаннымПервичныхДокументов
	|ИЗ
	|	ВТ_ЗаписиКнигиПродажПоДокументуОплатыБезСчетаФактуры КАК ЗаписиКнигиПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|		ПО ЗаписиКнигиПродаж.СчетФактура = ДанныеПервичныхДокументов.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЗаписиКнигиПродажПоДокументуОплатыБезСчетаФактуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СчетаФактурыПромежуточная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗаписиКнигиПродажПоДокументуОснования.СчетФактура КАК СчетФактура,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОснования.ДатаСчетаФактуры КАК ДатаСчетаФактуры,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОснования.НомерСчетаФактуры КАК НомерСчетаФактуры,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОснования.СчетФактураДокумент КАК СчетФактураДокумент,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОснования.ДоговорАванса КАК ДоговорАванса,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОснования.СтавкаНДСАванса КАК СтавкаНДСАванса,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОснования.НомерСтроки КАК НомерСтроки,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОснования.КонтрагентПоСчетуФактуре КАК КонтрагентПоСчетуФактуре,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОснования.СводныйКорректировочный КАК СводныйКорректировочный,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОснования.СводныйКомиссионный КАК СводныйКомиссионный,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОснования.НачислениеПоОказаниюУслуг КАК НачислениеПоОказаниюУслуг,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОснования.КодВидаОперации КАК КодВидаОперации
	|ПОМЕСТИТЬ ВТ_ТаблицаСчетаФактурыДокументы
	|ИЗ
	|	ВТ_ЗаписиКнигиПродажПоДокументуОснования КАК ВТ_ЗаписиКнигиПродажПоДокументуОснования
	|ГДЕ
	|	НЕ ВТ_ЗаписиКнигиПродажПоДокументуОснования.СчетФактураДокумент ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ЗаписиКнигиПродажПоДокументуОплаты.СчетФактура,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОплаты.ДатаСчетаФактуры,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОплаты.НомерСчетаФактуры,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОплаты.СчетФактураДокумент,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОплаты.ДоговорАванса,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОплаты.СтавкаНДСАванса,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОплаты.НомерСтроки,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОплаты.КонтрагентПоСчетуФактуре,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОплаты.СводныйКорректировочный,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОплаты.СводныйКомиссионный,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОплаты.НачислениеПоОказаниюУслуг,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОплаты.КодВидаОперации
	|ИЗ
	|	ВТ_ЗаписиКнигиПродажПоДокументуОплаты КАК ВТ_ЗаписиКнигиПродажПоДокументуОплаты
	|ГДЕ
	|	НЕ ВТ_ЗаписиКнигиПродажПоДокументуОплаты.СчетФактураДокумент ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ЗаписиКнигиПродажПоДаннымПервичныхДокументов.СчетФактура,
	|	ВТ_ЗаписиКнигиПродажПоДаннымПервичныхДокументов.ДатаСчетаФактуры,
	|	ВТ_ЗаписиКнигиПродажПоДаннымПервичныхДокументов.НомерСчетаФактуры,
	|	NULL,
	|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ВТ_ЗаписиКнигиПродажПоДаннымПервичныхДокументов.КонтрагентПоСчетуФактуре,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ВТ_ЗаписиКнигиПродажПоДаннымПервичныхДокументов.НачислениеПоОказаниюУслуг,
	|	ВТ_ЗаписиКнигиПродажПоДаннымПервичныхДокументов.КодВидаОперации
	|ИЗ
	|	ВТ_ЗаписиКнигиПродажПоДаннымПервичныхДокументов КАК ВТ_ЗаписиКнигиПродажПоДаннымПервичныхДокументов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактураДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЗаписиКнигиПродажПоДаннымПервичныхДокументов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЗаписиКнигиПродажПоДокументуОплаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЗаписиКнигиПродажПоДокументуОснования";
	
	// Получаем дополнительную информацию из журнала учета счетов-фактур.
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов() +
	"ВЫБРАТЬ
	|	ЖурналУчетаСчетовФактур.Регистратор КАК Регистратор,
	|	ЖурналУчетаСчетовФактур.СчетФактура КАК СчетФактура,
	|	ЖурналУчетаСчетовФактур.НомерСчетаФактуры КАК НомерСчетаФактуры,
	|	ЖурналУчетаСчетовФактур.ДатаСчетаФактуры КАК ДатаСчетаФактуры,
	|	ЖурналУчетаСчетовФактур.НомерКорректировочногоСчетаФактуры КАК НомерКорректировочногоСчетаФактуры,
	|	ЖурналУчетаСчетовФактур.ДатаКорректировочногоСчетаФактуры КАК ДатаКорректировочногоСчетаФактуры,
	|	ЖурналУчетаСчетовФактур.НомерИсправления КАК НомерИсправления,
	|	ЖурналУчетаСчетовФактур.ДатаИсправления КАК ДатаИсправления,
	|	ЖурналУчетаСчетовФактур.НомерИсправленияКорректировочногоСчетаФактуры КАК НомерИсправленияКорректировки,
	|	ЖурналУчетаСчетовФактур.ДатаИсправленияКорректировочногоСчетаФактуры КАК ДатаИсправленияКорректировки,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА """"
	|		КОГДА ЖурналУчетаСчетовФактур.Контрагент <> ЖурналУчетаСчетовФактур.Организация
	|			ТОГДА ЖурналУчетаСчетовФактур.КППКонтрагента
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КППКонтрагента,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
	|				И ВЫРАЗИТЬ(ЖурналУчетаСчетовФактур.СчетФактура КАК Документ.СчетФактураВыданный).СводныйКомиссионный
	|				И НЕ ВЫРАЗИТЬ(ЖурналУчетаСчетовФактур.СчетФактура КАК Документ.СчетФактураВыданный).ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс)
	|			ТОГДА ЖурналУчетаСчетовФактур.ИндексСтроки
	|		ИНАЧЕ ЖурналУчетаСчетовФактур.НомерСтроки
	|	КОНЕЦ КАК НомерСтроки,
	|	ЖурналУчетаСчетовФактур.КодВидаОперации КАК КодВидаОперации,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.Валюта <> &ВалютаРегУчета
	|			ТОГДА ЖурналУчетаСчетовФактур.Валюта.НаименованиеПолное
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ВалютаНаименование,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.Валюта <> &ВалютаРегУчета
	|			ТОГДА ЖурналУчетаСчетовФактур.Валюта.Код
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ВалютаКод,
	|	ЖурналУчетаСчетовФактур.Валюта.Наименование КАК ВалютаНаименованиеКраткое,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураПолученный
	|				И ВЫРАЗИТЬ(ЖурналУчетаСчетовФактур.СчетФактура КАК Документ.СчетФактураПолученный).ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
	|			ТОГДА ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуреРазницаУменьшение
	|		КОГДА ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
	|				И ВЫРАЗИТЬ(ЖурналУчетаСчетовФактур.СчетФактура КАК Документ.СчетФактураВыданный).ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.Корректировочный)
	|			ТОГДА ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуреРазницаУвеличение
	|		ИНАЧЕ ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуре
	|	КОНЕЦ КАК ВсегоПродажВВалюте,
	|	ЖурналУчетаСчетовФактур.Посредник КАК ПосредникСсылка,
	|	ЖурналУчетаСчетовФактур.Валюта КАК Валюта
	|ПОМЕСТИТЬ ВТ_РегистрацияСчетовФактур
	|ИЗ
	|	РегистрСведений.ЖурналУчетаСчетовФактур КАК ЖурналУчетаСчетовФактур
	|ГДЕ
	|	ЖурналУчетаСчетовФактур.СчетФактура В
	|			(ВЫБРАТЬ
	|				ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент
	|			ИЗ
	|				ВТ_ТаблицаСчетаФактурыДокументы)
	|	И ЖурналУчетаСчетовФактур.Организация В(&Организация)
	|	И ВЫБОР
	|			КОГДА ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
	|				ТОГДА НЕ ЖурналУчетаСчетовФактур.ИсправлениеСобственнойОшибки
	|						И ЖурналУчетаСчетовФактур.ЧастьЖурнала <> ЗНАЧЕНИЕ(Перечисление.ЧастиЖурналаУчетаСчетовФактур.ПолученныеСчетаФактуры)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаСчетаФактурыДокументы.СчетФактура КАК СчетФактура,
	|	ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаСчетаФактуры, ВТ_ТаблицаСчетаФактурыДокументы.ДатаСчетаФактуры) КАК ДатаСчетаФактуры,
	|	ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.НомерСчетаФактуры, ВТ_ТаблицаСчетаФактурыДокументы.НомерСчетаФактуры) КАК НомерСчетаФактуры,
	|	ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.СчетФактура, ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент) КАК СчетФактураДокумент,
	|	ВТ_ТаблицаСчетаФактурыДокументы.НомерСчетаФактуры КАК НомерСчетаФактурыСортировка,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаИсправленияКорректировки, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВТ_РегистрацияСчетовФактур.ДатаИсправленияКорректировки
	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры
	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаИсправления, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВТ_РегистрацияСчетовФактур.ДатаИсправления
	|		ИНАЧЕ ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаСчетаФактуры, ВТ_ТаблицаСчетаФактурыДокументы.ДатаСчетаФактуры)
	|	КОНЕЦ КАК ДатаСчетаФактурыСортировка,
	|	ВТ_ТаблицаСчетаФактурыДокументы.ДоговорАванса КАК ДоговорАванса,
	|	ВТ_ТаблицаСчетаФактурыДокументы.СтавкаНДСАванса КАК СтавкаНДСАванса,
	|	ВТ_РегистрацияСчетовФактур.НомерКорректировочногоСчетаФактуры КАК НомерКорректировки,
	|	ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры КАК ДатаКорректировки,
	|	ВТ_РегистрацияСчетовФактур.НомерИсправления КАК НомерИсправления,
	|	ВТ_РегистрацияСчетовФактур.ДатаИсправления КАК ДатаИсправления,
	|	ВТ_РегистрацияСчетовФактур.НомерИсправленияКорректировки КАК НомерИсправленияКорректировки,
	|	ВТ_РегистрацияСчетовФактур.ДатаИсправленияКорректировки КАК ДатаИсправленияКорректировки,
	|	ВЫБОР
	|		КОГДА (ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент ССЫЛКА Документ.СчетФактураВыданный
	|				ИЛИ ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент ССЫЛКА Документ.ЗаявлениеОВвозеТоваров)
	|				И ВТ_РегистрацияСчетовФактур.СчетФактура ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОбрабатыватьНомерДокумента,
	|	ВТ_РегистрацияСчетовФактур.КППКонтрагента КАК КППКонтрагента,
	|	ВТ_ТаблицаСчетаФактурыДокументы.КонтрагентПоСчетуФактуре КАК КонтрагентПоСчетуФактуре,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.КодВидаОперации = """"
	|			ТОГДА ВТ_РегистрацияСчетовФактур.КодВидаОперации
	|		ИНАЧЕ ВТ_ТаблицаСчетаФактурыДокументы.КодВидаОперации
	|	КОНЕЦ КАК КодВидаОперации,
	|	ВТ_РегистрацияСчетовФактур.ВалютаКод КАК ВалютаКод,
	|	СУММА(ВТ_РегистрацияСчетовФактур.ВсегоПродажВВалюте) КАК ВсегоПродажВВалюте,
	|	ВТ_РегистрацияСчетовФактур.ПосредникСсылка КАК ПосредникСсылка,
	|	ВТ_РегистрацияСчетовФактур.Валюта КАК Валюта,
	|	ВТ_РегистрацияСчетовФактур.ВалютаНаименование КАК ВалютаНаименование,
	|	ВТ_РегистрацияСчетовФактур.ВалютаНаименованиеКраткое КАК ВалютаНаименованиеКраткое,
	|	ВТ_ТаблицаСчетаФактурыДокументы.СводныйКорректировочный КАК СводныйКорректировочный,
	|	ВТ_ТаблицаСчетаФактурыДокументы.СводныйКомиссионный КАК СводныйКомиссионный,
	|	ВТ_ТаблицаСчетаФактурыДокументы.НачислениеПоОказаниюУслуг КАК НачислениеПоОказаниюУслуг,
	|	ЛОЖЬ КАК СводнаяСправка
	|ПОМЕСТИТЬ ТаблицаСчетаФактурыДокументы
	|ИЗ
	|	ВТ_ТаблицаСчетаФактурыДокументы КАК ВТ_ТаблицаСчетаФактурыДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РегистрацияСчетовФактур КАК ВТ_РегистрацияСчетовФактур
	|		ПО ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент = ВТ_РегистрацияСчетовФактур.СчетФактура
	|			И (НЕ ВТ_ТаблицаСчетаФактурыДокументы.СводныйКорректировочный
	|					И НЕ ВТ_ТаблицаСчетаФактурыДокументы.СводныйКомиссионный
	|				ИЛИ ВТ_ТаблицаСчетаФактурыДокументы.НомерСтроки = ВТ_РегистрацияСчетовФактур.НомерСтроки)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РегистрацияСчетовФактур.КППКонтрагента,
	|	ВТ_ТаблицаСчетаФактурыДокументы.ДоговорАванса,
	|	ВТ_РегистрацияСчетовФактур.НомерКорректировочногоСчетаФактуры,
	|	ВТ_ТаблицаСчетаФактурыДокументы.НомерСчетаФактуры,
	|	ВТ_ТаблицаСчетаФактурыДокументы.КонтрагентПоСчетуФактуре,
	|	ВТ_РегистрацияСчетовФактур.ДатаИсправленияКорректировки,
	|	ВТ_РегистрацияСчетовФактур.Валюта,
	|	ВТ_РегистрацияСчетовФактур.ВалютаКод,
	|	ВТ_РегистрацияСчетовФактур.ВалютаНаименованиеКраткое,
	|	ВТ_ТаблицаСчетаФактурыДокументы.СводныйКорректировочный,
	|	ВТ_ТаблицаСчетаФактурыДокументы.СводныйКомиссионный,
	|	ВТ_ТаблицаСчетаФактурыДокументы.НачислениеПоОказаниюУслуг,
	|	ВТ_РегистрацияСчетовФактур.НомерИсправления,
	|	ВТ_ТаблицаСчетаФактурыДокументы.СчетФактура,
	|	ВТ_ТаблицаСчетаФактурыДокументы.СтавкаНДСАванса,
	|	ВТ_РегистрацияСчетовФактур.ПосредникСсылка,
	|	ВТ_РегистрацияСчетовФактур.ВалютаНаименование,
	|	ВТ_РегистрацияСчетовФактур.ДатаИсправления,
	|	ВТ_РегистрацияСчетовФактур.НомерИсправленияКорректировки,
	|	ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры,
	|	ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаСчетаФактуры, ВТ_ТаблицаСчетаФактурыДокументы.ДатаСчетаФактуры),
	|	ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.НомерСчетаФактуры, ВТ_ТаблицаСчетаФактурыДокументы.НомерСчетаФактуры),
	|	ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.СчетФактура, ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаИсправленияКорректировки, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВТ_РегистрацияСчетовФактур.ДатаИсправленияКорректировки
	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры
	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаИсправления, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВТ_РегистрацияСчетовФактур.ДатаИсправления
	|		ИНАЧЕ ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаСчетаФактуры, ВТ_ТаблицаСчетаФактурыДокументы.ДатаСчетаФактуры)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.КодВидаОперации = """"
	|			ТОГДА ВТ_РегистрацияСчетовФактур.КодВидаОперации
	|		ИНАЧЕ ВТ_ТаблицаСчетаФактурыДокументы.КодВидаОперации
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент ССЫЛКА Документ.СчетФактураВыданный
	|				ИЛИ ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент ССЫЛКА Документ.ЗаявлениеОВвозеТоваров)
	|				И ВТ_РегистрацияСчетовФактур.СчетФактура ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_РегистрацияСчетовФактур"
	+ ОбщегоНазначения.РазделительПакетаЗапросов();
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаРеквизитыСчетовФактурПостановление981КнигаПродаж() Экспорт
	
	// Счета-фактуры выданные, составленные от имени продавца, возникают у комиссионера, в книге не отражаются.
	// Т.к. у счетов-фактур, составленных от имени продавца, и выданных комитенту на вознаграждение один и тот же 
	// документ - основание (отчет комитенту), то необходимо отбирать только счета-фактуры на вознаграждение, 
	// чтобы не задвоились записи при соединении регистра НДС и списка документов.
	//
	// Счета-фактуры полученные, составленные от имени продавца, отражаются в базе комитента и
	// на основании их комитент принимает НДС к вычету, поэтому для счетов-фактур полученных отбор по
	// флагу "Составлен от имени продавца" не должен выполняться.
	// 
	// Счета-фактуры (полученные и выданные) на аванс в базе комиссионера, составленные от имени продавца, 
	// не формируют движения по регистрам НДС, поэтому задвоение данных при соединении регистров с ними не возникает.
	
	// Для списка счетов-фактур получаем данные документов-оснований.
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА (СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс)
	|					ИЛИ СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.КорректировочныйНаАванс)
	|					ИЛИ СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НалоговыйАгент))
	|					И (СчетФактураВыданный.Исправление
	|						ИЛИ СФВыданныйДокументыОснования.ДокументОснование ССЫЛКА Документ.ОтчетКомиссионераОПродажах)
	|				ИЛИ СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаРеализацию)
	|					И (СФВыданныйДокументыОснования.ДокументОснование ССЫЛКА Документ.ОказаниеУслуг
	|						ИЛИ СФВыданныйДокументыОснования.ДокументОснование ССЫЛКА Документ.ОтчетКомиссионераОПродажах
	|							И СчетФактураВыданный.Контрагент <> ВЫРАЗИТЬ(СФВыданныйДокументыОснования.ДокументОснование КАК Документ.ОтчетКомиссионераОПродажах).Контрагент)
	|				ИЛИ СФВыданныйДокументыОснования.ДокументОснование ССЫЛКА Документ.ПодтверждениеНулевойСтавкиНДС
	|			ТОГДА СФВыданныйДокументыОснования.Ссылка
	|		ИНАЧЕ СФВыданныйДокументыОснования.ДокументОснование
	|	КОНЕЦ КАК СчетФактура,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.Корректировочный)
	|				ИЛИ СчетФактураВыданный.Исправление
	|			ТОГДА СФВыданныйДокументыОснования.НомерИсходногоДокумента
	|		ИНАЧЕ СчетФактураВыданный.Номер
	|	КОНЕЦ КАК НомерСчетаФактуры,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.Корректировочный)
	|				ИЛИ СчетФактураВыданный.Исправление
	|			ТОГДА СФВыданныйДокументыОснования.ДатаИсходногоДокумента
	|		ИНАЧЕ СчетФактураВыданный.Дата
	|	КОНЕЦ КАК ДатаСчетаФактуры,
	|	СФВыданныйДокументыОснования.Ссылка КАК СчетФактураДокумент,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс)
	|				ИЛИ СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.КорректировочныйНаАванс)
	|			ТОГДА ЕСТЬNULL(СФВыданныйАвансы.СтавкаНДС, НЕОПРЕДЕЛЕНО)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СтавкаНДСАванса,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс)
	|				ИЛИ СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.КорректировочныйНаАванс)
	|				ИЛИ СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НалоговыйАгент)
	|			ТОГДА СчетФактураВыданный.ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ КАК ДоговорАванса,
	|	СчетФактураВыданный.Контрагент КАК Контрагент,
	|	СФВыданныйДокументыОснования.НомерСтроки КАК НомерСтроки,
	|	СчетФактураВыданный.СводныйКорректировочный КАК СводныйКорректировочный,
	|	ЛОЖЬ КАК СводныйКомиссионный,
	|	"""" КАК КодВидаОперации,
	|	СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.СводнаяСправка) КАК СводнаяСправка
	|ПОМЕСТИТЬ ВТ_СчетаФактурыПромежуточная
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СФВыданныйДокументыОснования
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.Авансы КАК СФВыданныйАвансы
	|		ПО СФВыданныйДокументыОснования.Ссылка = СФВыданныйАвансы.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокСчетовФактур КАК СписокДокументовОснований
	|		ПО СФВыданныйДокументыОснования.ДокументОснование = СписокДокументовОснований.СчетФактура
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокСчетовФактур КАК СписокСФОснований
	|		ПО СФВыданныйДокументыОснования.Ссылка = СписокСФОснований.СчетФактура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО СФВыданныйДокументыОснования.Ссылка = СчетФактураВыданный.Ссылка
	|ГДЕ
	|	ВЫБОР
	|			КОГДА (СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс)
	|						ИЛИ СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.КорректировочныйНаАванс)
	|						ИЛИ СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НалоговыйАгент))
	|						И (СчетФактураВыданный.Исправление
	|							ИЛИ СФВыданныйДокументыОснования.ДокументОснование ССЫЛКА Документ.ОтчетКомиссионераОПродажах)
	|					ИЛИ СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаРеализацию)
	|						И (СФВыданныйДокументыОснования.ДокументОснование ССЫЛКА Документ.ОказаниеУслуг
	|							ИЛИ СФВыданныйДокументыОснования.ДокументОснование ССЫЛКА Документ.ОтчетКомиссионераОПродажах
	|								И СчетФактураВыданный.Контрагент <> ВЫРАЗИТЬ(СФВыданныйДокументыОснования.ДокументОснование КАК Документ.ОтчетКомиссионераОПродажах).Контрагент)
	|					ИЛИ СФВыданныйДокументыОснования.ДокументОснование ССЫЛКА Документ.ПодтверждениеНулевойСтавкиНДС
	|				ТОГДА СписокСФОснований.СчетФактура ЕСТЬ НЕ NULL 
	|			ИНАЧЕ СписокДокументовОснований.СчетФактура ЕСТЬ НЕ NULL 
	|		КОНЕЦ
	|	И (СчетФактураВыданный.Продавец = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ИЛИ СчетФактураВыданный.Продавец = СчетФактураВыданный.Контрагент
	|				И НЕ СчетФактураВыданный.ДоговорКонтрагента.СчетаФактурыОтИмениОрганизации)
	|	И НЕ СчетФактураВыданный.СводныйКомиссионный
	|	И СчетФактураВыданный.Проведен
	|	И НЕ СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.КорректировочнаяСправка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СчетФактураВыданный.Ссылка,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.Корректировочный)
	|				ИЛИ СчетФактураВыданный.Ссылка.Исправление
	|			ТОГДА СчетФактураВыданный.НомерИсходногоДокумента
	|		ИНАЧЕ СчетФактураВыданный.Ссылка.Номер
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.Корректировочный)
	|				ИЛИ СчетФактураВыданный.Ссылка.Исправление
	|			ТОГДА СчетФактураВыданный.ДатаИсходногоДокумента
	|		ИНАЧЕ СчетФактураВыданный.Ссылка.Дата
	|	КОНЕЦ,
	|	СчетФактураВыданный.Ссылка,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка),
	|	ЕСТЬNULL(ОтчетКомиссионераОПродажахПокупатели.Покупатель, СчетФактураВыданный.Ссылка.Контрагент),
	|	ЕСТЬNULL(ОтчетКомиссионераОПродажахПокупатели.НомерСтроки, СчетФактураВыданный.НомерСтроки),
	|	СчетФактураВыданный.Ссылка.СводныйКорректировочный,
	|	ИСТИНА,
	|	"""",
	|	СчетФактураВыданный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.СводнаяСправка)
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданный
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокСчетовФактур КАК СчетаФактуры
	|		ПО СчетФактураВыданный.Ссылка = СчетаФактуры.СчетФактура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионераОПродажах.Покупатели КАК ОтчетКомиссионераОПродажахПокупатели
	|		ПО СчетФактураВыданный.ДокументОснование = ОтчетКомиссионераОПродажахПокупатели.Ссылка
	|			И СчетФактураВыданный.Ссылка = ОтчетКомиссионераОПродажахПокупатели.СчетФактура
	|ГДЕ
	|	СчетаФактуры.СчетФактура ЕСТЬ НЕ NULL 
	|	И (СчетФактураВыданный.Ссылка.Продавец = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ИЛИ СчетФактураВыданный.Ссылка.Продавец = СчетФактураВыданный.Ссылка.Контрагент)
	|	И СчетФактураВыданный.Ссылка.СводныйКомиссионный
	|	И НЕ СчетФактураВыданный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс)
	|	И СчетФактураВыданный.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Авансы.Ссылка,
	|	Авансы.Ссылка.Номер,
	|	Авансы.Ссылка.Дата,
	|	Авансы.Ссылка,
	|	Авансы.СтавкаНДС,
	|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка),
	|	Авансы.Контрагент,
	|	Авансы.НомерСтроки,
	|	Авансы.Ссылка.СводныйКорректировочный,
	|	ИСТИНА,
	|	"""",
	|	ЛОЖЬ
	|ИЗ
	|	Документ.СчетФактураВыданный.Авансы КАК Авансы
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокСчетовФактур КАК СчетаФактуры
	|		ПО Авансы.Ссылка = СчетаФактуры.СчетФактура
	|ГДЕ
	|	СчетаФактуры.СчетФактура ЕСТЬ НЕ NULL 
	|	И Авансы.Ссылка.СводныйКомиссионный
	|	И Авансы.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс)
	|	И Авансы.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА (СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаАванс)
	|				ИЛИ СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.КорректировочныйНаАванс))
	|				И (СчетФактураПолученный.Ссылка.Исправление
	|					ИЛИ СчетФактураПолученный.Ссылка.ИсправлениеСобственнойОшибки)
	|			ТОГДА СФПолученныйДокументыОснования.Ссылка
	|		ИНАЧЕ СФПолученныйДокументыОснования.ДокументОснование
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
	|			ТОГДА СФПолученныйДокументыОснования.НомерИсходногоДокумента
	|		ИНАЧЕ СчетФактураПолученный.НомерВходящегоДокумента
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
	|			ТОГДА СФПолученныйДокументыОснования.ДатаИсходногоДокумента
	|		ИНАЧЕ СчетФактураПолученный.ДатаВходящегоДокумента
	|	КОНЕЦ,
	|	СФПолученныйДокументыОснования.Ссылка,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаАванс)
	|				ИЛИ СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.КорректировочныйНаАванс)
	|			ТОГДА ЕСТЬNULL(СФПолученныйАвансы.СтавкаНДС, НЕОПРЕДЕЛЕНО)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаАванс)
	|				ИЛИ СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.КорректировочныйНаАванс)
	|			ТОГДА СчетФактураПолученный.ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ,
	|	СчетФактураПолученный.Контрагент,
	|	СФПолученныйДокументыОснования.НомерСтроки,
	|	СчетФактураПолученный.СводныйКорректировочный,
	|	ЛОЖЬ,
	|	СчетФактураПолученный.КодВидаОперацииНаУменьшение,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.СчетФактураПолученный.ДокументыОснования КАК СФПолученныйДокументыОснования
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.Авансы КАК СФПолученныйАвансы
	|		ПО СФПолученныйДокументыОснования.Ссылка = СФПолученныйАвансы.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокСчетовФактур КАК СписокДокументовОснований
	|		ПО СФПолученныйДокументыОснования.ДокументОснование = СписокДокументовОснований.СчетФактура
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокСчетовФактур КАК СписокСФОснований
	|		ПО СФПолученныйДокументыОснования.Ссылка = СписокСФОснований.СчетФактура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|		ПО СФПолученныйДокументыОснования.Ссылка = СчетФактураПолученный.Ссылка
	|ГДЕ
	|	ВЫБОР
	|			КОГДА (СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаАванс)
	|					ИЛИ СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.КорректировочныйНаАванс))
	|					И СчетФактураПолученный.Исправление
	|				ТОГДА СписокСФОснований.СчетФактура ЕСТЬ НЕ NULL 
	|			ИНАЧЕ СписокДокументовОснований.СчетФактура ЕСТЬ НЕ NULL 
	|		КОНЕЦ
	|	И НЕ СФПолученныйДокументыОснования.ДокументОснование ССЫЛКА Документ.ОтчетКомитентуОПродажах
	|	И НЕ СФПолученныйДокументыОснования.ДокументОснование ССЫЛКА Документ.ОтчетКомиссионераОПродажах
	|	И СчетФактураПолученный.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ГТДИмпорт.Ссылка,
	|	ГТДИмпорт.НомерГТД,
	|	ГТДИмпорт.Дата,
	|	ГТДИмпорт.Ссылка,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка),
	|	ГТДИмпорт.Контрагент,
	|	0,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	"""",
	|	ЛОЖЬ
	|ИЗ
	|	Документ.ГТДИмпорт КАК ГТДИмпорт
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокСчетовФактур КАК СчетаФактуры
	|		ПО ГТДИмпорт.Ссылка = СчетаФактуры.СчетФактура
	|ГДЕ
	|	СчетаФактуры.СчетФактура ЕСТЬ НЕ NULL 
	|	И ГТДИмпорт.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратТоваровОтПокупателя.Ссылка,
	|	ВозвратТоваровОтПокупателя.НомерРасходногоКассовогоОрдера,
	|	ВозвратТоваровОтПокупателя.ДатаРасходногоКассовогоОрдера,
	|	ВозвратТоваровОтПокупателя.Ссылка,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка),
	|	ВозвратТоваровОтПокупателя.Контрагент,
	|	0,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	"""",
	|	ЛОЖЬ
	|ИЗ
	|	Документ.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокСчетовФактур КАК СчетаФактуры
	|		ПО ВозвратТоваровОтПокупателя.Ссылка = СчетаФактуры.СчетФактура
	|ГДЕ
	|	СчетаФактуры.СчетФактура ЕСТЬ НЕ NULL 
	|	И ВозвратТоваровОтПокупателя.Сделка ССЫЛКА Документ.ОтчетОРозничныхПродажах
	|	И ВозвратТоваровОтПокупателя.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаявлениеОВвозеТоваров.Ссылка,
	|	ЗаявлениеОВвозеТоваров.Номер,
	|	ЗаявлениеОВвозеТоваров.Дата,
	|	ЗаявлениеОВвозеТоваров.Ссылка,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка),
	|	ЗаявлениеОВвозеТоваров.Контрагент,
	|	0,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	"""",
	|	ЛОЖЬ
	|ИЗ
	|	Документ.ЗаявлениеОВвозеТоваров КАК ЗаявлениеОВвозеТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокСчетовФактур КАК СчетаФактуры
	|		ПО ЗаявлениеОВвозеТоваров.Ссылка = СчетаФактуры.СчетФактура
	|ГДЕ
	|	СчетаФактуры.СчетФактура ЕСТЬ НЕ NULL 
	|	И ЗаявлениеОВвозеТоваров.Проведен
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаписиКнигиПродаж.СчетФактура КАК СчетФактура,
	|	ЗаписиКнигиПродаж.КонтрагентПоСчетуФактуре КАК КонтрагентПоСчетуФактуре,
	|	ЗаписиКнигиПродаж.ДоговорАванса КАК ДоговорАванса,
	|	ЗаписиКнигиПродаж.СтавкаНДС_Аванс КАК СтавкаНДСАванса,
	|	ВЫБОР
	|		КОГДА СФДокументыСчетФактура.СчетФактура ЕСТЬ НЕ NULL 
	|			ТОГДА СФДокументыСчетФактура.ДатаСчетаФактуры
	|		КОГДА СФДокументыДокументОплаты.СчетФактура ЕСТЬ НЕ NULL 
	|			ТОГДА СФДокументыДокументОплаты.ДатаСчетаФактуры
	|		ИНАЧЕ ДанныеПервичныхДокументов.Дата
	|	КОНЕЦ КАК ДатаСчетаФактуры,
	|	ВЫБОР
	|		КОГДА СФДокументыСчетФактура.СчетФактура ЕСТЬ НЕ NULL 
	|			ТОГДА СФДокументыСчетФактура.НомерСчетаФактуры
	|		КОГДА СФДокументыДокументОплаты.СчетФактура ЕСТЬ НЕ NULL 
	|			ТОГДА СФДокументыДокументОплаты.НомерСчетаФактуры
	|		ИНАЧЕ ДанныеПервичныхДокументов.Номер
	|	КОНЕЦ КАК НомерСчетаФактуры,
	|	ВЫБОР
	|		КОГДА СФДокументыСчетФактура.СчетФактура ЕСТЬ НЕ NULL 
	|			ТОГДА СФДокументыСчетФактура.СчетФактураДокумент
	|		КОГДА СФДокументыДокументОплаты.СчетФактура ЕСТЬ НЕ NULL 
	|			ТОГДА СФДокументыДокументОплаты.СчетФактураДокумент
	|	КОНЕЦ КАК СчетФактураДокумент,
	|	ВЫБОР
	|		КОГДА СФДокументыСчетФактура.СчетФактура ЕСТЬ НЕ NULL 
	|			ТОГДА СФДокументыСчетФактура.НомерСтроки
	|		КОГДА СФДокументыДокументОплаты.СчетФактура ЕСТЬ НЕ NULL 
	|			ТОГДА СФДокументыДокументОплаты.НомерСтроки
	|	КОНЕЦ КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА СФДокументыСчетФактура.СчетФактура ЕСТЬ НЕ NULL 
	|			ТОГДА СФДокументыСчетФактура.СводныйКорректировочный
	|		КОГДА СФДокументыДокументОплаты.СчетФактура ЕСТЬ НЕ NULL 
	|			ТОГДА СФДокументыДокументОплаты.СводныйКорректировочный
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СводныйКорректировочный,
	|	ВЫБОР
	|		КОГДА СФДокументыСчетФактура.СчетФактура ЕСТЬ НЕ NULL 
	|			ТОГДА СФДокументыСчетФактура.СводныйКомиссионный
	|		КОГДА СФДокументыДокументОплаты.СчетФактура ЕСТЬ НЕ NULL 
	|			ТОГДА СФДокументыДокументОплаты.СводныйКомиссионный
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СводныйКомиссионный,
	|	ВЫБОР
	|		КОГДА СФДокументыСчетФактура.СчетФактура ЕСТЬ NULL
	|				И СФДокументыДокументОплаты.СчетФактура ЕСТЬ NULL
	|				И ЗаписиКнигиПродаж.СчетФактура ССЫЛКА Документ.ОказаниеУслуг
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НачислениеПоОказаниюУслуг,
	|	ВЫБОР
	|		КОГДА СФДокументыСчетФактура.СчетФактура ЕСТЬ НЕ NULL 
	|			ТОГДА СФДокументыСчетФактура.КодВидаОперации
	|		КОГДА СФДокументыДокументОплаты.СчетФактура ЕСТЬ НЕ NULL 
	|			ТОГДА СФДокументыДокументОплаты.КодВидаОперации
	|		ИНАЧЕ ""26""
	|	КОНЕЦ КАК КодВидаОперации,
	|	ВЫБОР
	|		КОГДА СФДокументыСчетФактура.СчетФактура ЕСТЬ НЕ NULL 
	|			ТОГДА СФДокументыСчетФактура.СводнаяСправка
	|		КОГДА СФДокументыДокументОплаты.СчетФактура ЕСТЬ НЕ NULL 
	|			ТОГДА СФДокументыДокументОплаты.СводнаяСправка
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СводнаяСправка
	|ПОМЕСТИТЬ ВТ_ТаблицаСчетаФактурыДокументы
	|ИЗ
	|	ЗаписиКнигиПродаж КАК ЗаписиКнигиПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СчетаФактурыПромежуточная КАК СФДокументыСчетФактура
	|		ПО ЗаписиКнигиПродаж.СчетФактура = СФДокументыСчетФактура.СчетФактура
	|			И ((СФДокументыСчетФактура.Контрагент ЕСТЬ NULL
	|				ИЛИ СФДокументыСчетФактура.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|				ИЛИ ЗаписиКнигиПродаж.КонтрагентПоСчетуФактуре = СФДокументыСчетФактура.Контрагент)
	|			И ЗаписиКнигиПродаж.ДоговорАванса = СФДокументыСчетФактура.ДоговорАванса
	|			И ЗаписиКнигиПродаж.СтавкаНДС_Аванс = СФДокументыСчетФактура.СтавкаНДСАванса
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СчетаФактурыПромежуточная КАК СФДокументыДокументОплаты
	|		ПО ЗаписиКнигиПродаж.ДокументОплаты = СФДокументыДокументОплаты.СчетФактура
	|			И (СФДокументыДокументОплаты.Контрагент ЕСТЬ NULL
	|				ИЛИ ЗаписиКнигиПродаж.КонтрагентПоСчетуФактуре = СФДокументыДокументОплаты.Контрагент)
	|			И ЗаписиКнигиПродаж.ДоговорАванса = СФДокументыДокументОплаты.ДоговорАванса
	|			И ЗаписиКнигиПродаж.СтавкаНДС_Аванс = СФДокументыДокументОплаты.СтавкаНДСАванса
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|		ПО ЗаписиКнигиПродаж.СчетФактура = ДанныеПервичныхДокументов.Документ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактураДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СчетаФактурыПромежуточная";
	
	// Получаем дополнительную информацию из журнала учета счетов-фактур.
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов() +
	"ВЫБРАТЬ
	|	ЖурналУчетаСчетовФактур.Регистратор КАК Регистратор,
	|	ЖурналУчетаСчетовФактур.СчетФактура КАК СчетФактура,
	|	ЖурналУчетаСчетовФактур.НомерСчетаФактуры КАК НомерСчетаФактуры,
	|	ЖурналУчетаСчетовФактур.ДатаСчетаФактуры КАК ДатаСчетаФактуры,
	|	ЖурналУчетаСчетовФактур.НомерКорректировочногоСчетаФактуры КАК НомерКорректировочногоСчетаФактуры,
	|	ЖурналУчетаСчетовФактур.ДатаКорректировочногоСчетаФактуры КАК ДатаКорректировочногоСчетаФактуры,
	|	ЖурналУчетаСчетовФактур.НомерИсправления КАК НомерИсправления,
	|	ЖурналУчетаСчетовФактур.ДатаИсправления КАК ДатаИсправления,
	|	ЖурналУчетаСчетовФактур.НомерИсправленияКорректировочногоСчетаФактуры КАК НомерИсправленияКорректировки,
	|	ЖурналУчетаСчетовФактур.ДатаИсправленияКорректировочногоСчетаФактуры КАК ДатаИсправленияКорректировки,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА """"
	|		КОГДА ЖурналУчетаСчетовФактур.Контрагент <> ЖурналУчетаСчетовФактур.Организация
	|			ТОГДА ЖурналУчетаСчетовФактур.КППКонтрагента
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КППКонтрагента,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
	|				И ВЫРАЗИТЬ(ЖурналУчетаСчетовФактур.СчетФактура КАК Документ.СчетФактураВыданный).СводныйКомиссионный
	|				И НЕ ВЫРАЗИТЬ(ЖурналУчетаСчетовФактур.СчетФактура КАК Документ.СчетФактураВыданный).ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс)
	|			ТОГДА ЖурналУчетаСчетовФактур.ИндексСтроки
	|		ИНАЧЕ ЖурналУчетаСчетовФактур.НомерСтроки
	|	КОНЕЦ КАК НомерСтроки,
	|	ЖурналУчетаСчетовФактур.КодВидаОперации КАК КодВидаОперации,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.Валюта <> &ВалютаРегУчета
	|			ТОГДА ЖурналУчетаСчетовФактур.Валюта.НаименованиеПолное
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ВалютаНаименование,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.Валюта <> &ВалютаРегУчета
	|			ТОГДА ЖурналУчетаСчетовФактур.Валюта.Код
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ВалютаКод,
	|	ЖурналУчетаСчетовФактур.Валюта.Наименование КАК ВалютаНаименованиеКраткое,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураПолученный
	|				И ВЫРАЗИТЬ(ЖурналУчетаСчетовФактур.СчетФактура КАК Документ.СчетФактураПолученный).ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
	|			ТОГДА ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуреРазницаУменьшение
	|		КОГДА ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураПолученный
	|				И ВЫРАЗИТЬ(ЖурналУчетаСчетовФактур.СчетФактура КАК Документ.СчетФактураПолученный).ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.КорректировочныйНаАванс)
	|			ТОГДА ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуреРазницаУвеличение
	|		КОГДА ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
	|				И (ВЫРАЗИТЬ(ЖурналУчетаСчетовФактур.СчетФактура КАК Документ.СчетФактураВыданный).ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.Корректировочный)
	|					ИЛИ ВЫРАЗИТЬ(ЖурналУчетаСчетовФактур.СчетФактура КАК Документ.СчетФактураВыданный).ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.КорректировочныйНаАванс))
	|			ТОГДА ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуреРазницаУвеличение
	|		ИНАЧЕ ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуре
	|	КОНЕЦ КАК ВсегоПродажВВалюте,
	|	ЖурналУчетаСчетовФактур.Посредник КАК ПосредникСсылка,
	|	ЖурналУчетаСчетовФактур.Валюта КАК Валюта
	|ПОМЕСТИТЬ ВТ_РегистрацияСчетовФактур
	|ИЗ
	|	РегистрСведений.ЖурналУчетаСчетовФактур КАК ЖурналУчетаСчетовФактур
	|ГДЕ
	|	ЖурналУчетаСчетовФактур.СчетФактура В
	|			(ВЫБРАТЬ
	|				ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент
	|			ИЗ
	|				ВТ_ТаблицаСчетаФактурыДокументы)
	|	И ЖурналУчетаСчетовФактур.Организация В(&Организация)
	|	И НЕ ЖурналУчетаСчетовФактур.Сторно
	|	И НЕ(ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.ЗаявлениеОВвозеТоваров
	|				И ЖурналУчетаСчетовФактур.ЧастьЖурнала = ЗНАЧЕНИЕ(Перечисление.ЧастиЖурналаУчетаСчетовФактур.ВыставленныеСчетаФактуры))
	|	И (НЕ ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
	|			ИЛИ НЕ ЖурналУчетаСчетовФактур.ИсправлениеСобственнойОшибки
	|				И ЖурналУчетаСчетовФактур.ЧастьЖурнала <> ЗНАЧЕНИЕ(Перечисление.ЧастиЖурналаУчетаСчетовФактур.ПолученныеСчетаФактуры))
	|	И ВЫБОР
	|			КОГДА ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
	|					И ВЫРАЗИТЬ(ЖурналУчетаСчетовФактур.СчетФактура КАК Документ.СчетФактураВыданный).ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.КорректировочнаяСправка)
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РегистрацияСчетовФактур.СчетФактура КАК СчетФактура,
	|	СУММА(ВТ_РегистрацияСчетовФактур.ВсегоПродажВВалюте) КАК ВсегоПродажВВалюте
	|ПОМЕСТИТЬ СуммыПродажПоСчетамФактурам
	|ИЗ
	|	ВТ_РегистрацияСчетовФактур КАК ВТ_РегистрацияСчетовФактур
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РегистрацияСчетовФактур.СчетФактура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.СводныйКорректировочный
	|			ТОГДА ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры
	|		ИНАЧЕ ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаСчетаФактуры, ВТ_ТаблицаСчетаФактурыДокументы.ДатаСчетаФактуры)
	|	КОНЕЦ КАК ДатаСчетаФактуры,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.СводныйКорректировочный
	|			ТОГДА ВТ_РегистрацияСчетовФактур.НомерКорректировочногоСчетаФактуры
	|		ИНАЧЕ ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.НомерСчетаФактуры, ВТ_ТаблицаСчетаФактурыДокументы.НомерСчетаФактуры)
	|	КОНЕЦ КАК НомерСчетаФактуры,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.СводныйКорректировочный
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		ИНАЧЕ ВТ_РегистрацияСчетовФактур.ДатаИсправления
	|	КОНЕЦ КАК ДатаИсправления,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.СводныйКорректировочный
	|			ТОГДА """"
	|		ИНАЧЕ ВТ_РегистрацияСчетовФактур.НомерИсправления
	|	КОНЕЦ КАК НомерИсправления,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.СводныйКорректировочный
	|			ТОГДА ВТ_РегистрацияСчетовФактур.НомерКорректировочногоСчетаФактуры
	|		ИНАЧЕ ВТ_ТаблицаСчетаФактурыДокументы.НомерСчетаФактуры
	|	КОНЕЦ КАК НомерСчетаФактурыСортировка,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.СводныйКорректировочный
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаИсправленияКорректировки, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ВТ_РегистрацияСчетовФактур.ДатаИсправленияКорректировки
	|					КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры
	|				КОНЕЦ
	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаИсправленияКорректировки, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВТ_РегистрацияСчетовФактур.ДатаИсправленияКорректировки
	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры
	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаИсправления, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВТ_РегистрацияСчетовФактур.ДатаИсправления
	|		ИНАЧЕ ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаСчетаФактуры, ВТ_ТаблицаСчетаФактурыДокументы.ДатаСчетаФактуры)
	|	КОНЕЦ КАК ДатаСчетаФактурыСортировка,
	|	ВТ_РегистрацияСчетовФактур.НомерКорректировочногоСчетаФактуры КАК НомерКорректировки,
	|	ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры КАК ДатаКорректировки,
	|	ВТ_РегистрацияСчетовФактур.НомерИсправленияКорректировки КАК НомерИсправленияКорректировки,
	|	ВТ_РегистрацияСчетовФактур.ДатаИсправленияКорректировки КАК ДатаИсправленияКорректировки,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.КодВидаОперации = """"
	|			ТОГДА ВТ_РегистрацияСчетовФактур.КодВидаОперации
	|		ИНАЧЕ ВТ_ТаблицаСчетаФактурыДокументы.КодВидаОперации
	|	КОНЕЦ КАК КодВидаОперации,
	|	ВТ_ТаблицаСчетаФактурыДокументы.СчетФактура КАК СчетФактура,
	|	ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.СчетФактура, ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент) КАК СчетФактураДокумент,
	|	ВТ_ТаблицаСчетаФактурыДокументы.ДоговорАванса КАК ДоговорАванса,
	|	ВТ_ТаблицаСчетаФактурыДокументы.СтавкаНДСАванса КАК СтавкаНДСАванса,
	|	ВЫБОР
	|		КОГДА (ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент ССЫЛКА Документ.СчетФактураВыданный
	|				ИЛИ ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент ССЫЛКА Документ.ЗаявлениеОВвозеТоваров)
	|				И ВТ_РегистрацияСчетовФактур.СчетФактура ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОбрабатыватьНомерДокумента,
	|	ВТ_ТаблицаСчетаФактурыДокументы.СводныйКорректировочный КАК СводныйКорректировочный,
	|	ВТ_ТаблицаСчетаФактурыДокументы.СводныйКомиссионный КАК СводныйКомиссионный,
	|	ВТ_ТаблицаСчетаФактурыДокументы.НачислениеПоОказаниюУслуг КАК НачислениеПоОказаниюУслуг,
	|	ВТ_РегистрацияСчетовФактур.КППКонтрагента КАК КППКонтрагента,
	|	ВТ_ТаблицаСчетаФактурыДокументы.КонтрагентПоСчетуФактуре КАК КонтрагентПоСчетуФактуре,
	|	ВТ_РегистрацияСчетовФактур.ПосредникСсылка КАК ПосредникСсылка,
	|	СуммыПродажПоСчетамФактурам.ВсегоПродажВВалюте КАК ВсегоПродажВВалюте,
	|	ВТ_РегистрацияСчетовФактур.ВалютаКод КАК ВалютаКод,
	|	ВТ_РегистрацияСчетовФактур.Валюта КАК Валюта,
	|	ВТ_РегистрацияСчетовФактур.ВалютаНаименование КАК ВалютаНаименование,
	|	ВТ_РегистрацияСчетовФактур.ВалютаНаименованиеКраткое КАК ВалютаНаименованиеКраткое,
	|	ВТ_ТаблицаСчетаФактурыДокументы.СводнаяСправка КАК СводнаяСправка
	|ПОМЕСТИТЬ ТаблицаСчетаФактурыДокументы
	|ИЗ
	|	ВТ_ТаблицаСчетаФактурыДокументы КАК ВТ_ТаблицаСчетаФактурыДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РегистрацияСчетовФактур КАК ВТ_РегистрацияСчетовФактур
	|		ПО ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент = ВТ_РегистрацияСчетовФактур.СчетФактура
	|			И (НЕ ВТ_ТаблицаСчетаФактурыДокументы.СводныйКорректировочный
	|					И НЕ ВТ_ТаблицаСчетаФактурыДокументы.СводныйКомиссионный
	|				ИЛИ ВТ_ТаблицаСчетаФактурыДокументы.НомерСтроки = ВТ_РегистрацияСчетовФактур.НомерСтроки)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммыПродажПоСчетамФактурам КАК СуммыПродажПоСчетамФактурам
	|		ПО ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент = СуммыПродажПоСчетамФактурам.СчетФактура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СуммыПродажПоСчетамФактурам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_РегистрацияСчетовФактур
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ТаблицаСчетаФактурыДокументы"
	+ ОбщегоНазначения.РазделительПакетаЗапросов();
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область УчетНДСФормированиеОтчетности

Функция ТекстЗапросаРаздел4_6_ФормированиеОтчетности() Экспорт
	
	Возврат 
	"ВЫБРАТЬ
	|	НДСЗаписиКнигиПродаж.СчетФактура КАК СчетФактура,
	|	СУММА(НДСЗаписиКнигиПродаж.СуммаБезНДС) КАК ПодтвержденнаяНалоговаяБаза,
	|	СУММА(НДСЗаписиКнигиПродаж.НДС) КАК НДС
	|ПОМЕСТИТЬ НалоговаяБаза
	|ИЗ
	|	РегистрНакопления.НДСЗаписиКнигиПродаж КАК НДСЗаписиКнигиПродаж
	|ГДЕ
	|	НДСЗаписиКнигиПродаж.Организация В(&Организация)
	|	И НДСЗаписиКнигиПродаж.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ НДСЗаписиКнигиПродаж.ЗаписьДополнительногоЛиста
	|	И НДСЗаписиКнигиПродаж.Событие = &СобытиеНачисление
	|	И НДСЗаписиКнигиПродаж.Активность
	|
	|СГРУППИРОВАТЬ ПО
	|	НДСЗаписиКнигиПродаж.СчетФактура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НДСЗаписиКнигиПродаж.СчетФактура,
	|	СУММА(НДСЗаписиКнигиПродаж.СуммаБезНДС),
	|	СУММА(НДСЗаписиКнигиПродаж.НДС)
	|ИЗ
	|	РегистрНакопления.НДСЗаписиКнигиПродаж КАК НДСЗаписиКнигиПродаж
	|ГДЕ
	|	&СУчетомКорректировок
	|	И НДСЗаписиКнигиПродаж.Организация В(&Организация)
	|	И НДСЗаписиКнигиПродаж.Период МЕЖДУ &НачалоПериода И &КонецПериодаУчитываемыхКорректировок
	|	И НДСЗаписиКнигиПродаж.Событие = &СобытиеНачисление
	|	И НДСЗаписиКнигиПродаж.Активность
	|	И НДСЗаписиКнигиПродаж.ЗаписьДополнительногоЛиста
	|	И НДСЗаписиКнигиПродаж.КорректируемыйПериод МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	НДСЗаписиКнигиПродаж.СчетФактура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НДСЗаписиКнигиПродаж.СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НалоговаяБаза.СчетФактура КАК СчетФактура,
	|	ПодтверждениеНулевойСтавки.ДокументОтгрузки КАК ДокументОтгрузки,
	|	ЕСТЬNULL(РеализацияОтгруженныхТоваров.ДокументОтгрузки, ПодтверждениеНулевойСтавки.ДокументОтгрузки) КАК ОснованиеТаможеннойДекларации
	|ПОМЕСТИТЬ ДокументыОтгрузки
	|ИЗ
	|	НалоговаяБаза КАК НалоговаяБаза
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПодтверждениеНулевойСтавкиНДС.Состав КАК ПодтверждениеНулевойСтавки
	|		ПО НалоговаяБаза.СчетФактура = ПодтверждениеНулевойСтавки.СчетФактураВыданный
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияОтгруженныхТоваров КАК РеализацияОтгруженныхТоваров
	|		ПО (ПодтверждениеНулевойСтавки.ДокументОтгрузки = РеализацияОтгруженныхТоваров.Ссылка)
	|			И (НЕ РеализацияОтгруженныхТоваров.ПометкаУдаления)
	|ГДЕ
	|	НалоговаяБаза.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
	|	И НЕ ПодтверждениеНулевойСтавки.Ссылка.ПометкаУдаления
	|	И ПодтверждениеНулевойСтавки.Событие = ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПродажи.НеПодтвержденаСтавка0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НалоговаяБаза.СчетФактура,
	|	НалоговаяБаза.СчетФактура,
	|	РеализацияОтгруженныхТоваров.ДокументОтгрузки
	|ИЗ
	|	НалоговаяБаза КАК НалоговаяБаза
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияОтгруженныхТоваров КАК РеализацияОтгруженныхТоваров
	|		ПО НалоговаяБаза.СчетФактура = РеализацияОтгруженныхТоваров.Ссылка
	|			И (НЕ РеализацияОтгруженныхТоваров.ПометкаУдаления)
	|ГДЕ
	|	НалоговаяБаза.СчетФактура ССЫЛКА Документ.РеализацияОтгруженныхТоваров
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НалоговаяБаза.СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ДокументыОтгрузки.ДокументОтгрузки, НалоговаяБаза.СчетФактура) КАК ДокументОтгрузки,
	|	ЕСТЬNULL(ДокументыОтгрузки.ОснованиеТаможеннойДекларации, НалоговаяБаза.СчетФактура) КАК ОснованиеТаможеннойДекларации,
	|	НалоговаяБаза.ПодтвержденнаяНалоговаяБаза КАК ПодтвержденнаяНалоговаяБаза,
	|	НалоговаяБаза.НДС КАК НДС
	|ПОМЕСТИТЬ НалоговаяБазаПоДокументамОтгрузки
	|ИЗ
	|	НалоговаяБаза КАК НалоговаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументыОтгрузки КАК ДокументыОтгрузки
	|		ПО НалоговаяБаза.СчетФактура = ДокументыОтгрузки.СчетФактура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЕСТЬNULL(ДокументыОтгрузки.ДокументОтгрузки, НалоговаяБаза.СчетФактура)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НалоговаяБаза.ДокументОтгрузки КАК ДокументОтгрузки,
	|	НалоговаяБаза.ПодтвержденнаяНалоговаяБаза КАК ПодтвержденнаяНалоговаяБаза,
	|	НалоговаяБаза.НДС КАК НачислениеНДС,
	|	0 КАК ВычетНДС
	|ПОМЕСТИТЬ НалоговаяБазаИВычет
	|ИЗ
	|	НалоговаяБазаПоДокументамОтгрузки КАК НалоговаяБаза
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НДСЗаписиКнигиПокупок.ДокументОтгрузки,
	|	0,
	|	0,
	|	НДСЗаписиКнигиПокупок.НДС
	|ИЗ
	|	РегистрНакопления.НДСЗаписиКнигиПокупок КАК НДСЗаписиКнигиПокупок
	|ГДЕ
	|	НДСЗаписиКнигиПокупок.Организация В(&Организация)
	|	И НЕ НДСЗаписиКнигиПокупок.ЗаписьДополнительногоЛиста
	|	И НДСЗаписиКнигиПокупок.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НДСЗаписиКнигиПокупок.Событие = &СобытиеВычет
	|	И НДСЗаписиКнигиПокупок.Активность
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НДСЗаписиКнигиПокупок.ДокументОтгрузки,
	|	0,
	|	0,
	|	НДСЗаписиКнигиПокупок.НДС
	|ИЗ
	|	РегистрНакопления.НДСЗаписиКнигиПокупок КАК НДСЗаписиКнигиПокупок
	|ГДЕ
	|	&СУчетомКорректировок
	|	И НДСЗаписиКнигиПокупок.Организация В(&Организация)
	|	И НДСЗаписиКнигиПокупок.ЗаписьДополнительногоЛиста
	|	И НДСЗаписиКнигиПокупок.Период МЕЖДУ &НачалоПериода И &КонецПериодаУчитываемыхКорректировок
	|	И НДСЗаписиКнигиПокупок.КорректируемыйПериод МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НДСЗаписиКнигиПокупок.Событие = &СобытиеВычет
	|	И НДСЗаписиКнигиПокупок.Активность
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОтгрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НалоговаяБазаПоДокументамОтгрузки.ДокументОтгрузки КАК ДокументОтгрузки,
	|	ТаможенныеДекларацииПоЭкспорту.Организация КАК Организация,
	|	ТаможенныеДекларацииПоЭкспорту.КодОперации КАК КодОперации
	|ПОМЕСТИТЬ СведенияТаможенныхДекларацийЭкспорт
	|ИЗ
	|	НалоговаяБазаПоДокументамОтгрузки КАК НалоговаяБазаПоДокументамОтгрузки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияТаможенныхДекларацийЭкспорт КАК ТаможенныеДекларацииПоЭкспорту
	|		ПО НалоговаяБазаПоДокументамОтгрузки.ОснованиеТаможеннойДекларации = ТаможенныеДекларацииПоЭкспорту.ДокументОтгрузки
	|ГДЕ
	|	ТаможенныеДекларацииПоЭкспорту.Организация В(&Организация)
	|	И НЕ ТаможенныеДекларацииПоЭкспорту.КодОперации ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НалоговаяБазаПоДокументамОтгрузки.ДокументОтгрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НалоговаяБазаИВычет.ПодтвержденнаяНалоговаяБаза КАК ПодтвержденнаяНалоговаяБаза,
	|	НалоговаяБазаИВычет.НачислениеНДС КАК НачислениеНДС,
	|	НалоговаяБазаИВычет.ВычетНДС КАК ВычетНДС,
	|	ЕСТЬNULL(СведенияТаможенныхДекларацийЭкспорт.КодОперации, &КодОперацииПоУмолчанию) КАК КодОперации
	|ПОМЕСТИТЬ НалоговаяБазаИВычетПоКодамОперацийДетальныеЗаписи
	|ИЗ
	|	НалоговаяБазаИВычет КАК НалоговаяБазаИВычет
	|		ЛЕВОЕ СОЕДИНЕНИЕ СведенияТаможенныхДекларацийЭкспорт КАК СведенияТаможенныхДекларацийЭкспорт
	|		ПО НалоговаяБазаИВычет.ДокументОтгрузки = СведенияТаможенныхДекларацийЭкспорт.ДокументОтгрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(НалоговаяБазаИВычетПоКодамОперацийДетальныеЗаписи.ПодтвержденнаяНалоговаяБаза) КАК ПодтвержденнаяНалоговаяБаза,
	|	СУММА(НалоговаяБазаИВычетПоКодамОперацийДетальныеЗаписи.НачислениеНДС) КАК НачислениеНДС,
	|	СУММА(НалоговаяБазаИВычетПоКодамОперацийДетальныеЗаписи.ВычетНДС) КАК ВычетНДС,
	|	НалоговаяБазаИВычетПоКодамОперацийДетальныеЗаписи.КодОперации КАК КодОперации
	|ИЗ
	|	НалоговаяБазаИВычетПоКодамОперацийДетальныеЗаписи КАК НалоговаяБазаИВычетПоКодамОперацийДетальныеЗаписи
	|
	|СГРУППИРОВАТЬ ПО
	|	НалоговаяБазаИВычетПоКодамОперацийДетальныеЗаписи.КодОперации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НалоговаяБаза
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДокументыОтгрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НалоговаяБазаПоДокументамОтгрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НалоговаяБазаИВычет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СведенияТаможенныхДекларацийЭкспорт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НалоговаяБазаИВычетПоКодамОперацийДетальныеЗаписи";
	
	
КонецФункции	

#КонецОбласти 

#КонецОбласти
