#Область ПрограммныйИнтерфейс

// Обработчик нетипового события по кнопке "Выбрать" (документ-основание) в формах документов ГосИС
//
// Параметры:
//   ИмяПараметраКоманды  - Строка    - см. документацию к подсистеме подключаемых команд БСП
//   ПараметрыВыполнения  - Структура - см. документацию к подсистеме подключаемых команд БСП
//   СтандартнаяОбработка - Булево    - установить Ложь для переопределенного обработчика
//
Процедура ОбработатьДействиеВыбораОснования(ИмяПараметраКоманды, ПараметрыВыполнения, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Обработчик нетипового события по кнопке "Создать" (документ-основание) в формах документов ГосИС
//
// Параметры:
//   ИмяПараметраКоманды  - Строка    - см. документацию к подсистеме подключаемых команд БСП
//   ПараметрыВыполнения  - Структура - см. документацию к подсистеме подключаемых команд БСП
//   СтандартнаяОбработка - Булево    - установить Ложь для переопределенного обработчика
//
Процедура ОбработатьДействиеОформленияОснования(ИмяПараметраКоманды, ПараметрыВыполнения, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь; 
	
	ДанныеЗаполнения = ПараметрыВыполнения.Источник.Ссылка;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ИмпортПродукцииСАТУРН") Тогда
		
		СобытияФормСАТУРНКлиентПереопределяемый.СоздатьДокументПоступлениеТоваровУслугНаОснованииИмпортПродукцииСАТУРН(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НакладнаяСАТУРН") Тогда
		
		Если ПараметрыВыполнения.ОписаниеКоманды.Идентификатор = "ОформитьИСПоступлениеТоваровУслуг" Тогда
			
			СобытияФормСАТУРНКлиентПереопределяемый.СоздатьДокументПоступлениеТоваровУслугНаОснованииНакладнаяСАТУРН(ДанныеЗаполнения);	
			
		ИначеЕсли ПараметрыВыполнения.ОписаниеКоманды.Идентификатор = "ОформитьИСВозвратТоваровОтПокупателя" Тогда
			
			СобытияФормСАТУРНКлиентПереопределяемый.СоздатьДокументВозвратТоваровОтПокупателяНаОснованииНакладнаяСАТУРН(ДанныеЗаполнения);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
