#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ИспользоватьДокументыПоступленияИП = Значение
		И Константы.ВестиУчетИндивидуальногоПредпринимателя.Получить();
	Константы.ИспользоватьДокументыПоступленияИП.Установить(ИспользоватьДокументыПоступленияИП);
	
	ИспользоватьПеремещениеТоваров = Значение И Константы.ИспользоватьНесколькоСкладов.Получить();
	Константы.ИспользоватьПеремещениеТоваров.Установить(ИспользоватьПеремещениеТоваров);
	
	// Обеспечение функциональности
	Если Не Значение Тогда
		Возврат;
	КонецЕсли;
	
	КлассификаторыДоходовРасходов.ОбеспечитьФункциональность(
		Справочники.СтатьиЗатрат,
		"ИспользоватьДокументыПоступления");
	КлассификаторыДоходовРасходов.ОбеспечитьФункциональность(
		Справочники.ПрочиеДоходыИРасходы,
		"ИспользоватьДокументыПоступления");

КонецПроцедуры

#КонецОбласти

#КонецЕсли