
#Область ПрограммныйИнтерфейс

#Область ТранзакцииОбмена

// Возвращает ссылки на значения перечислений, которые описывают типы транзакций для указанного сервиса обмена по заявкам.
//
// Параметры:
//	СервисОбменаСБанками - ПеречислениеСсылка.СервисыОбменаСБанками - Сервис обмена.
//
// Возвращаемое значение:
//	Структура - Содержит ключи, в значениях которых указаны ссылки на типы транзакций.
//
Функция ТипыТранзакцийСервисаОбменаСБанками(СервисОбменаСБанками) Экспорт

	Результат = Новый Структура();
	
	Результат.Вставить("Заявка");
	Результат.Вставить("ИзвещениеОПолученииБанкомЗаявки");
	Результат.Вставить("Отказ");
	Результат.Вставить("Одобрено");
	Результат.Вставить("Ошибка");
	
	ИмяПеречисления = "Перечисление.ТипыТранзакцийОбменаСБанкамиЗаявкиНаОткрытиеСчета.";
	
	Результат.Заявка                         	= ПредопределенноеЗначение(ИмяПеречисления + "ЗаявкаНаОткрытиеСчета");
	Результат.ИзвещениеОПолученииБанкомЗаявки	= ПредопределенноеЗначение(ИмяПеречисления + "ИзвещениеОПолученииБанкомЗаявки");
	Результат.Отказ								= ПредопределенноеЗначение(ИмяПеречисления + "Отказ");
	Результат.Одобрено							= ПредопределенноеЗначение(ИмяПеречисления + "Одобрено");
	Результат.Ошибка                         	= ПредопределенноеЗначение(ИмяПеречисления + "Ошибка");
	
	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецОбласти

