#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ОсновнаяОрганизация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если Не ЗначениеЗаполнено(Запись.Организация) Тогда
			Запись.Организация = ОсновнаяОрганизация;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Сейчас = ТекущаяУниверсальнаяДата();
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		// ДатаИзменения - это дата изменения данных, содержащихся в документе;
		// как правило, она определяется датой получения сведений из ФНС, но не датой записи в регистр.
		// По этой же причине дату, как правило, не обновляем, в частности - при изменении статуса.
		Если Не ЗначениеЗаполнено(Запись.ДатаИзменения) Тогда
			Запись.ДатаИзменения = Сейчас;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
