
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// По умолчанию запоминаем, но пользователь может отказаться.
	ЗапомнитьВыбор = Истина;
	
	// Первоначальная инициализация контекста настройки.
	КонтекстНастройки = НовыйКонтекстНастройки();
	ЗаполнитьЗначенияСвойств(КонтекстНастройки, Параметры.ПараметрыНастройки);
	
	Банк = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КонтекстНастройки.Настройка, "Банк");
	НаименованиеБанка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Банк, "Наименование");
	
	Элементы.ТекстВопроса.Заголовок = СтрШаблон(Элементы.ТекстВопроса.Заголовок, НаименованиеБанка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Да(Команда)
	
	Результат = Истина;
	Если ЗапомнитьВыбор Тогда
		СохранитьНастройку(Результат);
	КонецЕсли;
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Нет(Команда)
	
	Результат = Ложь;
	Если ЗапомнитьВыбор Тогда
		СохранитьНастройку(Результат);
	КонецЕсли;
	
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СохранитьНастройку(Результат)
	
	НастройкиЗагрузки = ЗагрузкаВыпискиПоБанковскомуСчету.НовыйНастройкиОбменСБанком();
	
	Настройки = Обработки.КлиентБанк.НастройкиЗагрузки();
	Если Настройки.ЗагружатьВыпискуПоВсемСчетам[КонтекстНастройки.Настройка] <> Результат Тогда
		Настройки.ЗагружатьВыпискуПоВсемСчетам.Вставить(КонтекстНастройки.Настройка, Результат);
		НастройкиЗагрузки.ЗагружатьВыпискуПоВсемСчетам =
			ОбщегоНазначения.СкопироватьРекурсивно(Настройки.ЗагружатьВыпискуПоВсемСчетам);
	КонецЕсли;
	
	Обработки.КлиентБанк.ЗаписатьНастройкиЗагрузки(НастройкиЗагрузки);
	
КонецПроцедуры

&НаСервере
Функция НовыйКонтекстНастройки()
	
	Возврат Новый Структура("Настройка");
	
КонецФункции

#КонецОбласти
