#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Заголовок = Параметры.Заголовок;
	ДатаНачалаУплаты = Параметры.ДатаНачала;
	Если Не ЗначениеЗаполнено(ДатаНачалаУплаты) Тогда
		День = 24 * 60 * 60;
		ДатаНачалаУплаты = НачалоМесяца(Параметры.Срок) + 10 * День;
	КонецЕсли;
	
	Элементы.ТекстЗадачи.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(СтрШаблон(
		НСтр("ru = 'Оплатите сумму налога через личный кабинет банка, который вы выбрали при переходе на АУСН, с <b>%1</b> и не позднее <b>%2</b>'"),
		Формат(ДатаНачалаУплаты, "ДЛФ=DD"),
		Формат(Параметры.Срок, "ДЛФ=DD")));
	
КонецПроцедуры

#КонецОбласти