// Содержимое модуля отличается в версиях ПРОФ и КОРП
// В версии ПРОФ отсутствует:
// - тело экспортных процедур (остаются только сигнатуры методов)
// - неэкспортные процедуры и все функции.
// Поэтому не допускается реализация в модуле экспортных функций: вместо них следует использовать процедуры с возвращаемым параметром.

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОпределитьДоступностьФункциональностиКОРП(ФункциональностьДоступна) Экспорт
	
	ФункциональностьДоступна = Истина;
	
КонецПроцедуры

#КонецОбласти
