#Область ПрограммныйИнтерфейс

Процедура ПриОпределенииКоманд(ИмяФормы, Команды) Экспорт
	
	Если ИмяФормы = "Документ.ВходящаяТранспортнаяОперацияВЕТИС.Форма.ФормаДокумента" Тогда
		
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуОформить(Команды,"ПоступлениеТоваровУслуг",   	 НСтр("ru = 'Поступление товаров и услуг'"));
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ПоступлениеТоваровУслуг",      НСтр("ru = 'Поступление товаров и услуг'"));
		
	ИначеЕсли ИмяФормы = "Документ.ПриемкаТоваровИСМП.Форма.ФормаДокумента" Тогда
		
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуОформить(Команды,"ПоступлениеТоваровУслуг",	 НСтр("ru = 'Поступление товаров и услуг'"));
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ПоступлениеТоваровУслуг",      НСтр("ru = 'Поступление товаров и услуг'"));
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуОформить(Команды,"ВозвратТоваровОтПокупателя",  НСтр("ru = 'Возврат от покупателя'"));
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ВозвратТоваровОтПокупателя",   НСтр("ru = 'Возврат от покупателя'"));
		
	ИначеЕсли ИмяФормы = "Документ.ИсходящаяТранспортнаяОперацияВЕТИС.Форма.ФормаДокумента" Тогда
		
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"РеализацияТоваровУслуг",  	НСтр("ru = 'Реализация товаров и услуг'"));
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ВозвратТоваровПоставщику",  	НСтр("ru = 'Возврат товаров поставщику'"));
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ПеремещениеТоваров",  		НСтр("ru = 'Перемещение товаров'"));
		
	ИначеЕсли ИмяФормы = "Документ.ИнвентаризацияПродукцииВЕТИС.Форма.ФормаДокумента" Тогда
		
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"СписаниеТоваров",  			НСтр("ru = 'Списание товаров'"));
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ОприходованиеТоваров",  		НСтр("ru = 'Оприходование товаров'"));
		
	ИначеЕсли ИмяФормы = "Документ.ПроизводственнаяОперацияВЕТИС.Форма.ФормаДокумента" Тогда
		
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ОтчетПроизводстваЗаСмену",  	НСтр("ru = 'Отчет производства за смену'"));
		
	ИначеЕсли ИмяФормы = "Документ.МаркировкаТоваровИСМП.Форма.ФормаДокумента" Тогда
		
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ОтчетПроизводстваЗаСмену",  	НСтр("ru = 'Отчет производства за смену'"));
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ПоступлениеИзПереработки",  	НСтр("ru = 'Поступление из переработки'"));
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ОприходованиеТоваров",  		НСтр("ru = 'Оприходование товаров'"));
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ИнвентаризацияТоваровНаСкладе", НСтр("ru = 'Инвентаризация товаров'"));
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ПроизводственнаяОперацияВЕТИС", НСтр("ru = 'Производственная операция ВетИС'"), "ВестиУчетПодконтрольныхТоваровВЕТИС");
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ВходящаяТранспортнаяОперацияВЕТИС", НСтр("ru = 'Входящая транспортная операция ВетИС'"), "ВестиУчетПодконтрольныхТоваровВЕТИС");
		
	ИначеЕсли ИмяФормы = "Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Форма.ФормаДокумента" Тогда
		
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"МаркировкаТоваровИСМП",  		НСтр("ru = 'Маркировка товаров'"));
		
	ИначеЕсли ИмяФормы = "Документ.ВыводИзОборотаИСМП.Форма.ФормаДокумента" Тогда
		
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"СписаниеТоваров",         	НСтр("ru = 'Списание товаров'"));
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ТребованиеНакладная",     	НСтр("ru = 'Требование накладная'"));
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"РеализацияТоваровУслуг",  	НСтр("ru = 'Реализация товаров и услуг'"));
		
	ИначеЕсли ИмяФормы = "Документ.ПеремаркировкаТоваровИСМП.Форма.ФормаДокумента" Тогда
		
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ВозвратТоваровОтПокупателя",  НСтр("ru = 'Возврат от покупателя'"));
		
	ИначеЕсли ИмяФормы = "Документ.ОтгрузкаТоваровИСМП.Форма.ФормаДокумента" Тогда
		
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "РеализацияТоваровУслуг",   	НСтр("ru = 'Реализация товаров и услуг'"));
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "ВозвратТоваровПоставщику", 	НСтр("ru = 'Возврат товаров поставщику'"));
		
	ИначеЕсли ИмяФормы = "Документ.УточнениеСведенийОКодахМаркировкиИСМП.Форма.ФормаДокумента" Тогда
		
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "МаркировкаТоваровИСМП", 		НСтр("ru = 'Маркировка товаров ИСМП'"));
		
	ИначеЕсли ИмяФормы = "Документ.ЗапросОстатковПартийЗЕРНО.Форма.ФормаДокумента" Тогда
		
	ИначеЕсли ИмяФормы = "Документ.ОформлениеСДИЗЗЕРНО.Форма.ФормаДокумента" Тогда
		
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "РеализацияТоваровУслуг", 	НСтр("ru = 'Реализация товаров и услуг'"));
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "ПеремещениеТоваров", 		НСтр("ru = 'Перемещение товаров'"));
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "ВозвратТоваровПоставщику", 	НСтр("ru = 'Возврат товаров поставщику'"));
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "ПередачаТоваров", 			НСтр("ru = 'Передача сырья в переработку'"));
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "ПоступлениеИзПереработки", 	НСтр("ru = 'Поступление из переработки'"));
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "ВозвратТоваровОтПокупателя", НСтр("ru = 'Возврат товаров от покупателя'"));
		
	ИначеЕсли ИмяФормы = "Документ.ПогашениеСДИЗЗЕРНО.Форма.ФормаДокумента" Тогда
		
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "ПоступлениеТоваровУслуг",	НСтр("ru = 'Поступление товаров и услуг'"));
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "ПеремещениеТоваров", 		НСтр("ru = 'Перемещение товаров'"));
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "ПередачаТоваров", 			НСтр("ru = 'Передача сырья в переработку'"));
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "ПоступлениеИзПереработки", 	НСтр("ru = 'Поступление из переработки'"));
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "ВозвратТоваровОтПокупателя", НСтр("ru = 'Возврат товаров от покупателя'"));
		
	ИначеЕсли ИмяФормы = "Документ.ФормированиеПартийПриПроизводствеЗЕРНО.Форма.ФормаДокумента" Тогда
		
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "ОтчетПроизводстваЗаСмену",  	НСтр("ru = 'Выпуск продукции (Отчет производства за смену)'"));
		
	ИначеЕсли ИмяФормы = "Документ.ВнесениеСведенийОСобранномУрожаеЗЕРНО.Форма.ФормаДокумента" Тогда
		
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "ОтчетПроизводстваЗаСмену",  	НСтр("ru = 'Выпуск продукции (Отчет производства за смену)'"));
		
	ИначеЕсли ИмяФормы = "Документ.СписаниеПартийЗЕРНО.Форма.ФормаДокумента" Тогда
		
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "РеализацияТоваровУслуг", 	НСтр("ru = 'Реализация товаров и услуг'"));
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "ТребованиеНакладная",    	НСтр("ru = 'Расход материалов'"));
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "ОтчетПроизводстваЗаСмену",  	НСтр("ru = 'Выпуск продукции (Отчет производства за смену)'"));
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "СписаниеТоваров", 			НСтр("ru = 'Списание товаров'"));
		
	ИначеЕсли ИмяФормы = "Документ.ФормированиеПартийЗЕРНО.Форма.ФормаДокумента" Тогда 
		
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "ОтчетПроизводстваЗаСмену",  	НСтр("ru = 'Выпуск продукции (Отчет производства за смену)'"));
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "ОприходованиеТоваров",		НСтр("ru = 'Оприходование товаров'"));
	
	ИначеЕсли ИмяФормы = "Документ.ФормированиеПартийИзДругихПартийЗЕРНО.Форма.ФормаДокумента" Тогда	
		
	ИначеЕсли ИмяФормы = "Документ.ОтчетОПроизводствеЕГАИС.Форма.ФормаДокумента" Тогда
		
	ИначеЕсли ИмяФормы = "Документ.УведомлениеОПланируемомИмпортеЕГАИС.Форма.ФормаДокумента" Тогда
		
	ИначеЕсли ИмяФормы = "Документ.ОтчетОбИмпортеЕГАИС.Форма.ФормаДокумента" Тогда
		
	ИначеЕсли ИмяФормы = "Документ.АктИнвентаризацииСАТУРН.Форма.ФормаДокумента" Тогда
		
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "СписаниеТоваров",  			НСтр("ru = 'Списание товаров'"));
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "ОприходованиеТоваров",		НСтр("ru = 'Оприходование товаров'"));

	ИначеЕсли ИмяФормы = "Документ.ИмпортПродукцииСАТУРН.Форма.ФормаДокумента" Тогда
		
    	ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "ПоступлениеТоваровУслуг",	НСтр("ru = 'Поступление товаров и услуг'"));
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуОформить(Команды, "ПоступлениеТоваровУслуг",   НСтр("ru = 'Поступление товаров и услуг'"))
		
	ИначеЕсли ИмяФормы = "Документ.НакладнаяСАТУРН.Форма.ФормаДокумента" Тогда
		
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "ПоступлениеТоваровУслуг",	НСтр("ru = 'Поступление товаров и услуг'"));
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "РеализацияТоваровУслуг", 	НСтр("ru = 'Реализация товаров и услуг'"));
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "ПеремещениеТоваров", 		НСтр("ru = 'Перемещение товаров'"));
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "ВозвратТоваровОтПокупателя", НСтр("ru = 'Возврат товаров от покупателя'"));
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "ТребованиеНакладная",    	НСтр("ru = 'Расход материалов'"));
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "ОтчетОРозничныхПродажах",    НСтр("ru = 'Отчет о розничных продажах'"));
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "ВозвратТоваровПоставщику",   НСТР("ru = 'Возврат товаров поставщику'"));
		//
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуОформить(Команды, "ПоступлениеТоваровУслуг",  	НСтр("ru = 'Поступление товаров'"));
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуОформить(Команды, "ВозвратТоваровОтПокупателя",НСтр("ru = 'Возврат товаров от покупателя'"));

		
	ИначеЕсли ИмяФормы = "Документ.ПроизводственнаяОперацияСАТУРН.Форма.ФормаДокумента" Тогда
		
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "ОтчетПроизводстваЗаСмену",  	НСтр("ru = 'Выпуск продукции (Отчет производства за смену)'"));
		
	ИначеЕсли ИмяФормы = "Документ.АктПримененияСАТУРН.Форма.ФормаДокумента" Тогда
		
		ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "СписаниеТоваров",  			НСтр("ru = 'Списание товаров'"));
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриНастройкеВидимостиКоманд(Форма, КомандыОбъекта) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	Если ИмяФормы = "Документ.ВходящаяТранспортнаяОперацияВЕТИС.Форма.ФормаДокумента" Тогда
		
	ИначеЕсли ИмяФормы = "Документ.ИсходящаяТранспортнаяОперацияВЕТИС.Форма.ФормаДокумента" Тогда
		
	ИначеЕсли ИмяФормы = "Документ.ИнвентаризацияПродукцииВЕТИС.Форма.ФормаДокумента" Тогда
		
	ИначеЕсли ИмяФормы = "Документ.ПроизводственнаяОперацияВЕТИС.Форма.ФормаДокумента" Тогда
		
	ИначеЕсли ИмяФормы = "Документ.МаркировкаТоваровИСМП.Форма.ФормаДокумента" Тогда
		
	ИначеЕсли ИмяФормы = "Документ.ВыводИзОборотаИСМП.Форма.ФормаДокумента" Тогда
		
		ИнтеграцияИСБПКлиентСервер.УправлениеВидимостьюКомандВыводаВОборота(Форма, КомандыОбъекта);
		
	ИначеЕсли ИмяФормы = "Документ.ПеремаркировкаТоваровИСМП.Форма.ФормаДокумента" Тогда
		
	ИначеЕсли ИмяФормы = "Документ.ОтгрузкаТоваровИСМП.Форма.ФормаДокумента" Тогда
		
	ИначеЕсли ИмяФормы = "Документ.НакладнаяСАТУРН.Форма.ФормаДокумента" Тогда
		
		ИнтеграцияСАТУРНКлиентСерверПереопределяемый.УправлениеВидимостьюКомандНакладнаяСАТУРН(Форма, КомандыОбъекта);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Форма.Объект.ДокументОснование)Тогда
		Форма.Элементы.ГруппаКомандыЗаполненияОснования.Видимость = Ложь;
		Возврат;
	Иначе 
		Форма.Элементы.ГруппаКомандыЗаполненияОснования.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
