////////////////////////////////////////////////////////////////////////////////
// Подсистема "Документооборот с Банком России".
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Функция ОтправитьОтчет(Организация, СсылкаНаОтчет, Пакет, ПараметрыАутентификации) Экспорт
	
	Возврат УдалитьДокументооборотСБанкомРоссии.ОтправитьОтчет(Организация, СсылкаНаОтчет, Пакет, ПараметрыАутентификации);

КонецФункции

Функция ПолучитьСтатусОтчета(Ссылка, ПараметрыАутентификации) Экспорт
	
	Возврат УдалитьДокументооборотСБанкомРоссии.ПолучитьСтатусОтчета(Ссылка, ПараметрыАутентификации);
	
КонецФункции

Функция ПроверитьВозможностьВыполненияОперации(ПараметрыАутентификации) Экспорт
	
	Возврат УдалитьДокументооборотСБанкомРоссии.ПроверитьВозможностьВыполненияОперации(ПараметрыАутентификации);
	
КонецФункции

Функция ПолучитьНастройки(Организация) Экспорт
	
	Возврат УдалитьДокументооборотСБанкомРоссии.ПолучитьНастройки(Организация);
	
КонецФункции

Функция СохранитьНастройки(Организация, Сертификат) Экспорт
	
	Возврат УдалитьДокументооборотСБанкомРоссии.СохранитьНастройки(Организация, Сертификат);
	
КонецФункции

Функция ПолучитьНеЗавершенныеОтправки(Организация) Экспорт
	
	Возврат УдалитьДокументооборотСБанкомРоссии.ПолучитьНеЗавершенныеОтправки(Организация);
	
КонецФункции

Функция ПолучитьПоследнююОтправкуОтчета(ОтчетСсылка) Экспорт
	
	Возврат УдалитьДокументооборотСБанкомРоссии.ПолучитьПоследнююОтправкуОтчета(ОтчетСсылка);
	
КонецФункции

#КонецОбласти