///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "ИнтернетПоддержкаПользователей.СистемаБыстрыхПлатежей.ПереводыСБПc2b.
// ОбщийМодуль.ПереводыСБПc2bКлиентСервер.
//
// Клиент-серверные процедуры общих настроек и статических идентификаторов:
//  - преобразование функциональных ссылок.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Формирует URL функциональной ссылки СБП для записи на NFC.
//
// Параметры:
//  ФункциональнаяСсылка - Строка - URL кассовой ссылки или платежной ссылки СБП.
//
// Возвращаемое значение:
//  Строка - функциональная ссылка СБП для записи на NFC.
//
Функция ФункциональнаяСсылкаNFC(ФункциональнаяСсылка) Экспорт
	
	РезультатURL = "";
	СтруктураURIСсылки = ОбщегоНазначенияКлиентСервер.СтруктураURI(ФункциональнаяСсылка);
	
	Если ПустаяСтрока(СтруктураURIСсылки.ПутьНаСервере) Или ПустаяСтрока(СтруктураURIСсылки.Схема) Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Передан некорректный URL кассовой ссылки: %1'"),
			ФункциональнаяСсылка);
	Иначе
		
		Если Не ПустаяСтрока(СтруктураURIСсылки.Схема) Тогда
			РезультатURL = РезультатURL + СтруктураURIСсылки.Схема + "://";
		КонецЕсли;
		
		Если Не ПустаяСтрока(СтруктураURIСсылки.Логин) Тогда
			РезультатURL = РезультатURL + СтруктураURIСсылки.Логин + ":" + СтруктураURIСсылки.Пароль + "@";
		КонецЕсли;
		
		РезультатURL = РезультатURL + "web." + СтруктураURIСсылки.Хост;
		
		Если Не ПустаяСтрока(СтруктураURIСсылки.Порт) Тогда
			РезультатURL = РезультатURL + ":" 
				+ ?(ТипЗнч(СтруктураURIСсылки.Порт) = Тип("Число"), Формат(СтруктураURIСсылки.Порт, ""), СтруктураURIСсылки.Порт);
		КонецЕсли;
		
		РезультатURL = РезультатURL + "/" + СтруктураURIСсылки.ПутьНаСервере;
		
	КонецЕсли;
	
	Возврат РезультатURL;
	
КонецФункции

#КонецОбласти
