#Область КомандыФормы

&НаКлиенте
Процедура Печать(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.КассоваяСсылка) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("ru = 'Кассовая ссылка не сформирована'");
		Возврат;
	КонецЕсли;
	
	ДанныеСсылки = Новый Структура("КассоваяСсылка, ИдентификаторОплаты");
	ЗаполнитьЗначенияСвойств(ДанныеСсылки, ТекущиеДанные);
	
	МакетКарточкиКассовойСсылки = СформироватьКарточкуКассовойСсылки(ДанныеСсылки);
	
	Если МакетКарточкиКассовойСсылки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторПечатнойФормы = "ПечатнаяФорма";
	НазваниеПечатнойФормы = НСтр("ru = 'Ссылка QR'");
	
	КоллекцияПечатныхФорм               = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(ИдентификаторПечатнойФормы);
	ПечатнаяФорма                       = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, ИдентификаторПечатнойФормы);
	ПечатнаяФорма.СинонимМакета         = НазваниеПечатнойФормы;
	ПечатнаяФорма.ТабличныйДокумент     = МакетКарточкиКассовойСсылки;
	ПечатнаяФорма.ИмяФайлаПечатнойФормы = НазваниеПечатнойФормы;
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм);
КонецПроцедуры

#КонецОбласти 


&НаСервереБезКонтекста
Функция СформироватьКарточкуКассовойСсылки(ДанныеСсылки)

	Возврат ИнтеграцияСПлатежнымиСистемами.СформироватьКарточкуКассовойСсылки(ДанныеСсылки, Новый Структура("ТипПечати", 1));

КонецФункции 
