
#Область КомандыФормы

&НаКлиенте
Процедура ДокументыПерсучета(Команда)
	
	ОткрытьФормуВОкнеФормы("ЖурналДокументов.АнкетыПерсонифицированногоУчета.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ДобровольноеПенсионноеСтрахование(Команда)
	
	ОткрытьФормуВОкнеФормы("ЖурналДокументов.ДобровольноеПенсионноеСтрахованиеПФР.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ОперацииУчетаВзносов(Команда)
	
	ОткрытьФормуВОкнеФормы("Документ.ОперацияУчетаПоСтраховымВзносам.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ПерсонифицированныйУчет(Команда)
	
	ОткрытьФормуВОкнеФормы("ЖурналДокументов.ПерсонифицированныйУчет.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура СправкиДляРасчетаПособий(Команда)
	
	ОткрытьФормуВОкнеФормы("Документ.ИсходящаяСправкаОЗаработкеДляРасчетаПособий.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ПерерасчетыСтраховыхВзносов(Команда)
	
	ОткрытьФормуВОкнеФормы("Документ.ПерерасчетСтраховыхВзносов.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура АктыПроверокСтраховыхВзносов(Команда)
	
	ОткрытьФормуВОкнеФормы("Документ.АктПроверкиСтраховыхВзносов.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ВходящиеЗапросыФССДляРасчетаПособий(Команда)
	
	ОткрытьФормуВОкнеФормы("Документ.ВходящийЗапросФССДляРасчетаПособия.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветыНаЗапросыФССДляРасчетаПособий(Команда)
	
	ОткрытьФормуВОкнеФормы("Документ.ОтветНаЗапросФССДляРасчетаПособия.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ИзвещенияФСС(Команда)
	
	ОткрытьФормуВОкнеФормы("Документ.ИзвещениеФСС.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ПередачаВФСССведенийОПособиях(Команда)
	
	ОткрытьФормуВОкнеФормы("ЖурналДокументов.ЗаявленияОписиИРеестрыНаВыплатуПособий.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияОбЭЛН(Команда)
	
	ОткрытьФормуВОкнеФормы("РегистрСведений.СведенияОбЭЛН.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура БольничныеЛисты(Команда)
	
	ОткрытьФормуВОкнеФормы("Документ.БольничныйЛист.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ПособияЗаСчетФСС(Команда)
	
	ОткрытьФормуВОкнеФормы("Обработка.ПособияВыплачиваемыеФСС.Форма");
	
КонецПроцедуры

&НаКлиенте
Процедура ИсходящиеСообщенияОСтраховыхСлучаяхФСС(Команда)
	
	ОткрытьФормуВОкнеФормы("Документ.ИсходящееСообщениеОСтраховомСлучаеФСС.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапросыСреднегоЗаработкаСЭДО(Команда)
	
	ОткрытьФормуВОкнеФормы("Документ.ЗапросСреднегоЗаработкаСЭДО.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура СреднийЗаработокСЭДО(Команда)
	
	ОткрытьФормуВОкнеФормы("Документ.СреднийЗаработокСЭДО.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗастрахованныеЛицаСЭДО(Команда)
	
	ОткрытьФормуВОкнеФормы("РегистрСведений.ЗастрахованныеЛицаСЭДО.ФормаСписка");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьФормуВОкнеФормы(ИмяФормы)
	
	ОткрытьФорму(ИмяФормы, , ЭтотОбъект, ИмяФормы, Окно);
	
КонецПроцедуры

#КонецОбласти