#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Если Значение И Не ТарификацияБП.РазрешенаОбщаяСистемаНалогообложения() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
	ТарификацияБП.КонстантаИспользуемойСистемыНалогообложенияПриЗаписи(Метаданные().Имя, Значение, Отказ);
	
	Если Не Отказ Тогда
		УстановитьПривилегированныйРежим(Истина);
		Константы.НеИспользуетсяОСНО.Установить(Не Значение);
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли