
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.АдресДанных) Тогда
		ДанныеПоПатентам = ПолучитьИзВременногоХранилища(Параметры.АдресДанных);
		ОтображаемыеСтроки = Новый Массив;
		Для Каждого Строка Из ДанныеПоПатентам Цикл
			Если Строка.ВозможноУменьшить > 0 Тогда
				ОтображаемыеСтроки.Добавить(Строка);
			КонецЕсли;
		КонецЦикла;
		УменьшаемыеПатенты.Загрузить(ДанныеПоПатентам.Скопировать(ОтображаемыеСтроки, "ДокументПатент"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУменьшаемыеПатенты

&НаКлиенте
Процедура УменьшаемыеПатентыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УменьшаемыеПатентыПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ПоместитьДанныеВХранилище(ВладелецФормы.УникальныйИдентификатор);
	Закрыть(АдресДанных);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПоместитьДанныеВХранилище(Ключ)
	
	АдресДанных = ПоместитьВоВременноеХранилище(УменьшаемыеПатенты.Выгрузить(), Ключ);
	
КонецПроцедуры

#КонецОбласти