#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если (ЗначениеЗаполнено(ДатаНачалаСписания) Или ЗначениеЗаполнено(ДатаОкончанияСписания))
		И ДатаНачалаСписания > ДатаОкончанияСписания
		И ЗначениеЗаполнено(ВидРБП)
		И Справочники.РасходыБудущихПериодов.ПрочиеРасходы().НайтиПоЗначению(ВидРБП) = Неопределено Тогда
		
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Дата окончания действия договора страхования не может быть меньше даты начала'"),
			ЭтотОбъект,
			"ДатаОкончанияСписания",
			,
			Отказ);
			
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли