
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если ЭтоЧекНаВозврат(ПараметрКоманды) Тогда
		ВызватьИсключение НСтр("ru = 'Оформление возврата по чеку с видом операции ""Возврат"" невозможен.'");
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	ЗначенияЗаполнения  = Новый Структура;
	
	ЗначенияЗаполнения.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ВидыОперацийРозничнаяПродажа.Возврат"));
	ЗначенияЗаполнения.Вставить("Основание",   ПараметрКоманды);
	
	СтруктураПараметров.Вставить("ЗначенияЗаполнения",  ЗначенияЗаполнения);
	СтруктураПараметров.Вставить("ИзменитьВидОперации", Истина);
	
	ОткрытьФорму("Документ.РозничнаяПродажа.Форма.ФормаДокументаОбщая", СтруктураПараметров, ЭтотОбъект, ПараметрКоманды);
КонецПроцедуры 

&НаСервере
Функция ЭтоЧекНаВозврат(Ссылка)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ВидОперации") = Перечисления.ВидыОперацийРозничнаяПродажа.Возврат;
КонецФункции 

