////////////////////////////////////////////////////////////////////////////////
// ЕдиныйНалоговыйСчетИнтеграцияФормыКлиентПереопределяемый:
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура СоздатьПлатежныйДокумент(Форма) Экспорт
	
	ЕдиныйНалоговыйСчетИнтеграцияКлиентБП.СоздатьПлатежныйДокумент(Форма);
	
КонецПроцедуры

Процедура ОтразитьВУчетеНачисления(Данные, Результат) Экспорт
	
КонецПроцедуры

Процедура ОтразитьВУчетеПениШтрафы(Данные, Результат) Экспорт
	
КонецПроцедуры

#КонецОбласти
