#Область СлужебныйПрограммныйИнтерфейс

// Возвращает результат операции проверки и корректировки имени файла.
// 
// Параметры:
// 	ИмяФайла - Строка
// 	Кодировка - Строка - Строковое представление кодировки
// 	
// Возвращаемое значение:
//  Структура:
//  * ИмеютсяНекорректныеСимволы - Булево
//  * ИмяФайлаДоКорректировки - Строка
//  * ИмяФайлаПослеКорректировки - Строка
//
Функция ПроверитьИмяФайлаСУчетомКодировки(Знач ИмяФайла, Кодировка = "windows-1251") Экспорт
	
	// Запланированная обработка частного сценария с наличием в имени файла комбинируемых символов.
	// Эти комбинации символов встречаются довольно часто, 
	// поэтому преобразуем их до вызова метода "ПроверитьИмяФайлаСУчетомКодировки" для исключения частого оповещения 
	// пользователей о некорректности данных символов в имени файла.
	ИмяФайла = СтрЗаменить(ИмяФайла, "и" + Символ(774), "й");
	ИмяФайла = СтрЗаменить(ИмяФайла, "е" + Символ(776), "е");
	
	ИмяФайла = 
		ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ИмяФайла, "_");
	
	ИмяФайлаПослеКорректировки = 
		ПолучитьСтрокуИзДвоичныхДанных(
			ПолучитьДвоичныеДанныеИзСтроки(ИмяФайла, Кодировка), Кодировка);
			
	ИмяФайлаПослеКорректировки = ДопустимоеИмяФайла(ИмяФайлаПослеКорректировки, Истина);
	
	ИмеютсяНекорректныеСимволы = ИмяФайла <> ИмяФайлаПослеКорректировки;
		
	Результат = Новый Структура;
	Результат.Вставить("ИмеютсяНекорректныеСимволы", ИмеютсяНекорректныеСимволы);
	Результат.Вставить("ИмяФайлаДоКорректировки", ИмяФайла);
	Результат.Вставить("ИмяФайлаПослеКорректировки", ИмяФайлаПослеКорректировки);
	
	Возврат Результат;
	
КонецФункции

// Возвращает вид ошибки, возникающей при работе с файлами.
// 
// Возвращаемое значение:
// 	См. ОбработкаНеисправностейБЭДКлиентСервер.НовоеОписаниеВидаОшибки
Функция ВидОшибкиРаботаСФайлами() Экспорт
	
	ОбработчикВыполненияДиагностики = "ОбработкаНеисправностейБЭДКлиент.ОткрытьМастерДиагностики";
	
	ВидОшибки = ОбработкаНеисправностейБЭДКлиентСервер.НовоеОписаниеВидаОшибки();
	ВидОшибки.Идентификатор = "ОшибкаРаботыСФайлами";
	ВидОшибки.ВыполнятьОбработчикАвтоматически = Истина;
	ВидОшибки.АвтоматическиВыполняемыйОбработчик = ОбработчикВыполненияДиагностики;
	ВидОшибки.ЗаголовокПроблемы = НСтр("ru = 'Ошибка работы с файлами'");
	ВидОшибки.ОписаниеРешения = НСтр("ru = '<a href = ""Выполните"">Выполните</a> диагностику работы с файлами'");
	ВидОшибки.ОбработчикиНажатия.Вставить("Выполните", ОбработчикВыполненияДиагностики);
	
	Возврат ВидОшибки;
	
КонецФункции

// Возвращает пустую структуру описания файла.
// 
// Возвращаемое значение:
// 	Структура - Описание:
//  * ИмяФайла - Строка - имя файла.
//  * ДвоичныеДанные - ДвоичныеДанные - двоичные данные файла.
//                   - Неопределено
// 
Функция НовоеОписаниеФайла() Экспорт
	
	ОписаниеФайла = Новый Структура;
	
	ОписаниеФайла.Вставить("ИмяФайла", "");
	ОписаниеФайла.Вставить("ДвоичныеДанные", Неопределено);
	
	Возврат ОписаниеФайла;
		
КонецФункции

// Возвращает уникальное имя файла, полученное от исходного добавлением порядкового номера.
// 
// Параметры:
//  ИсходноеИмяФайла - Строка - Имя файла.
//  ЭтоКаталог - Булево - Истина, если это каталог.
//  
//  Возвращаемое значение:
//   Строка - Уникальное имя файла.
//
Функция ОпределитьУникальноеИмяФайла(Знач ИсходноеИмяФайла, Знач ЭтоКаталог = Ложь) Экспорт
	
	ПозицияДляДополнения = СтрНайти(ИсходноеИмяФайла, ".", НаправлениеПоиска.СКонца);
	Если ПозицияДляДополнения = 0 Или ЭтоКаталог Тогда
		ПозицияДляДополнения = СтрДлина(ИсходноеИмяФайла) + 1;
	КонецЕсли;
	
	Счетчик = 0;
	Пока Истина Цикл
		
		ДополнениеИмени = ?(Счетчик = 0, "", СтрШаблон(" (%1)", Формат(Счетчик, "ЧГ=0;")));
		ИмяФайла = Лев(ИсходноеИмяФайла, ПозицияДляДополнения - 1) + ДополнениеИмени
			+ Сред(ИсходноеИмяФайла, ПозицияДляДополнения);

		Файл = Новый Файл(ИмяФайла);
		Если Не Файл.Существует() Тогда
			Прервать;
		КонецЕсли;
		
		Счетчик = Счетчик + 1;
		
	КонецЦикла;
	
	Возврат ИмяФайла;
	
КонецФункции

// Проверяет имя файла на наличие недопустимых символов.
//
// Параметры:
//  ИмяФайла - Строка - проверяемое имя файла
//  УдалятьНекорректные - Булево - Если установлено значение Истина, то будет произведено удаление некорректных
//  							   символов из переданной строки, если установлено значение Ложь, 
//  							   тогда вызываем исключение с оповещением пользователя.
// Возвращаемое значение:
//  Строка
Функция ДопустимоеИмяФайла(Знач ИмяФайла, УдалятьНекорректные = Ложь) Экспорт
	
	НедопустимыеСимволы = ОбщегоНазначенияКлиентСервер.ПолучитьНедопустимыеСимволыВИмениФайла();
	НедопустимыеСимволы = НедопустимыеСимволы + "№";
	Результат = Истина;
	
	ИтоговоеИмяФайла = ИмяФайла;
	
	Для Сч = 1 По СтрДлина(НедопустимыеСимволы) Цикл
		Символ = Сред(НедопустимыеСимволы, Сч, 1);
		Если СтрНайти(ИмяФайла, Символ) <> 0 Тогда
			Если УдалятьНекорректные Тогда
				ИтоговоеИмяФайла = СтрЗаменить(ИтоговоеИмяФайла, Символ, "");
			Иначе
				Результат = Ложь;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Не Результат Тогда
		Текст = НСтр("ru = 'В имени файла не должно быть следующих символов: %1
		|Имя файла: %2'");
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст, НедопустимыеСимволы, ИмяФайла);
		ВызватьИсключение ТекстОшибки;
	Иначе
		Возврат ИтоговоеИмяФайла;
	КонецЕсли;
	
КонецФункции

// Параметры:
//  СписокРасширений - Строка - Список расширений, разделенных пробелами.
//  РасширениеФайла - Строка - Расширение с точкой или без точки.
// 
// Возвращаемое значение:
//  Булево - Истина, если файл с таким расширением находится в списке расширений.
//
Функция РасширениеФайлаВСписке(СписокРасширений, РасширениеФайла) Экспорт
	
	РасширениеФайлаБезТочки = ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(РасширениеФайла);
	
	МассивРасширений = СтрРазделить(
		НРег(СписокРасширений), " ", Ложь);
	
	Если МассивРасширений.Найти(РасширениеФайлаБезТочки) <> Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Возвращает информацию, является ли расширение форматом PDF.
// 
// Параметры:
//  Расширение - Строка - Расширение файла без точки
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоРасширениеФайлаPDF(Расширение) Экспорт
	
	Возврат ВРег(Расширение) = "PDF"
		Или ВРег(Расширение) = ".PDF";
	
КонецФункции

// Возвращает представление файла в виде: [ИмяФайла] ([РазмерФайлаВКилобайтах] Кб), где РазмерФайлаВКилобайтах -
// преобразованное значение параметра РазмерФайлаВБайтах. Если РазмерФайлаВБайтах не задан, возвращает ИмяФайла.
//
// Параметры:
//  ИмяФайла			- Строка
//  РазмерФайлаВБайтах	- Число
//  					- Неопределено
//
// Возвращаемое значение:
//  Строка
Функция ПредставлениеФайлаСРазмеромВКилобайтах(Знач ИмяФайла, Знач РазмерФайлаВБайтах) Экспорт

	Если РазмерФайлаВБайтах = Неопределено Тогда
		Возврат ИмяФайла;
	КонецЕсли;
	
	РазмерФайлаВКилобайтах = Окр(РазмерФайлаВБайтах / 1024, 0);
	РазмерФайлаВКилобайтах = ?(РазмерФайлаВКилобайтах = 0, 1, РазмерФайлаВКилобайтах);
	Возврат СтрШаблон(НСтр("ru = '%1 (%2 Кб)'"), ИмяФайла, РазмерФайлаВКилобайтах);

КонецФункции

#КонецОбласти
