#Область СлужебныеПроцедурыИФункции

// Добавляет замер в статистику, хранящуюся в ПараметрыПриложения[БухгалтерияПредприятия.СтатистикаОткрытияФорм].
//
Процедура Подключаемый_ДобавитьСтатистикуОткрытия() Экспорт

	ОбщегоНазначенияБПКлиент.ДобавитьСтатистикуОткрытия();
	
КонецПроцедуры

// Добавляет статистику по СНО Организаций
//
Процедура Подключаемый_ДобавитьСтатистикуПоСНООрганизаций() Экспорт

	ОбщегоНазначенияБПВызовСервера.ДобавитьСтатистикуПоСНООрганизаций(Истина);
	
КонецПроцедуры

#КонецОбласти