#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ПриЗаписи(Отказ)
	
	Если Не ЦентрМониторинга.ЗаписыватьОперацииБизнесСтатистики() Тогда
		Возврат;
	КонецЕсли;

	// Регистрируем инцидент в pult.1c.ru или в ЦКК.
	Если Значение Тогда
		ЦентрМониторинга.ЗаписатьОперациюБизнесСтатистики(
			"СтатистикаБП.РазрешитьВыполнениеОперацииБезКонтроляПредыдущих.Да",
			1);
	Иначе
		ЦентрМониторинга.ЗаписатьОперациюБизнесСтатистики(
			"СтатистикаБП.РазрешитьВыполнениеОперацииБезКонтроляПредыдущих.Нет",
			1);
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
