#Область ПрограммныйИнтерфейс

// Возвращает ставки налога АУСН, указанные в НК РФ
//
// Возвращаемое значение:
//  Структура - ставки налогов:
//    * СтавкаАУСНДоходы - Число
//    * СтавкаАУСНДоходыМинусРасходы - Число
//    * СтавкаМинимальногоНалогаАУСНДоходыМинусРасходы - Число
//
Функция НалоговыеСтавкиАУСН() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("СтавкаАУСНДоходы", 8);
	Результат.Вставить("СтавкаАУСНДоходыМинусРасходы", 20);
	Результат.Вставить("СтавкаМинимальногоНалогаАУСНДоходыМинусРасходы", 3);
	
	Возврат Результат;
	
КонецФункции

// Возвращает адрес личного кабинета налогоплательщика АУСН на сайте ФНС.
//
// Возвращаемое значение:
//   Строка - адрес гиперссылки
//
Функция АдресЛичногоКабинетаПлательщикаАУСН() Экспорт
	
	Возврат "https://lk-ausn.nalog.gov.ru";
	
КонецФункции

#КонецОбласти