#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВремяДокументаПоУмолчанию() Экспорт
	
	Возврат Новый Структура("Часы, Минуты", 22, 0);
	
КонецФункции

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"ПрисоединитьДополнительныеТаблицы
	|ЭтотСписок КАК ЭтотСписок
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК ОбособленныеПодразделения 
	|	ПО ОбособленныеПодразделения.ГоловнаяОрганизация = ЭтотСписок.Организация
	|;
	|РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ОбособленныеПодразделения.Ссылка)
	|";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// ПОДГОТОВКА ПАРАМЕТРОВ ПРОВЕДЕНИЯ ДОКУМЕНТА

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, КлассифицироватьНоменклатуруПоОперациям0, Отказ) Экспорт
	
	ПараметрыПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("КлассифицироватьНоменклатуруПоОперациям0", КлассифицироватьНоменклатуруПоОперациям0);
	Запрос.Текст = ТекстЗапросаРеквизитыДокумента();
	Результат = Запрос.Выполнить();

	Реквизиты = ОбщегоНазначенияБПВызовСервера.ПолучитьСтруктуруИзРезультатаЗапроса(Результат);
 
	Если НЕ УчетнаяПолитика.Существует(Реквизиты.Организация, Реквизиты.Период, Истина, ДокументСсылка) Тогда
		Отказ = Истина;
		Возврат ПараметрыПроведения;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Период", Реквизиты.Период);
	Запрос.УстановитьПараметр("Организация", Реквизиты.Организация);
	
	ПараметрыПроведения.Вставить("ТаблицаРеквизиты", Результат.Выгрузить());
	
	НомераТаблиц = Новый Структура;
	
	Запрос.Текст = ТекстЗапросаТаблицыДокумента(НомераТаблиц)
		+ ТекстЗапросаСтавкаПодтверждена(НомераТаблиц, Реквизиты.КлассифицироватьНоменклатуруПоОперациям0)
		+ ТекстЗапросаСтавкаНеПодтверждена(НомераТаблиц, Реквизиты.КлассифицироватьНоменклатуруПоОперациям0)
		+ ТекстЗапросаПоФормированиюРегламентнойОперации(НомераТаблиц);
		
	Результат = Запрос.ВыполнитьПакет();
	
	Для каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
	
	Возврат ПараметрыПроведения;
		
КонецФункции

Функция ТекстЗапросаРеквизитыДокумента()

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Организация,
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.СтатьяПрочихРасходов КАК СтатьяПрочихРасходов,
	|	&КлассифицироватьНоменклатуруПоОперациям0 КАК КлассифицироватьНоменклатуруПоОперациям0
	|ИЗ
	|	Документ.ПодтверждениеНулевойСтавкиНДС КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицыДокумента(НомераТаблиц)

	НомераТаблиц.Вставить("ВременнаяТаблицаСостав", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Состав.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА Состав.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Товары)
	|		ИНАЧЕ Состав.ВидЦенности
	|	КОНЕЦ КАК ВидЦенности,
	|	Состав.Покупатель КАК Покупатель,
	|	Состав.ДокументОтгрузки КАК СчетФактура,
	|	ЕСТЬNULL(ДанныеПервичныхДокументов.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРеализации,
	|	Состав.Событие КАК Событие,
	|	Состав.Ссылка.Дата КАК ДатаСобытия,
	|	Состав.ПродажиСНДС0 КАК СуммаБезНДС,
	|	Состав.СтавкаНДС КАК СтавкаНДС,
	|	Состав.СуммаНДС КАК НДС,
	|	Состав.КурсоваяРазница КАК КурсоваяРазница,
	|	Состав.СчетФактураВыданный КАК СчетФактураВыданный,
	|	Состав.Ссылка КАК Ссылка,
	|	Состав.КлючСтроки КАК КлючСтроки,
	|	Состав.ДокументОтгрузки КАК ДокументОтгрузки
	|ПОМЕСТИТЬ ВременнаяТаблицаСостав
	|ИЗ
	|	Документ.ПодтверждениеНулевойСтавкиНДС.Состав КАК Состав
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|		ПО Состав.ДокументОтгрузки = ДанныеПервичныхДокументов.Документ
	|ГДЕ
	|	Состав.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаСтавкаПодтверждена(НомераТаблиц,КлассифицироватьНоменклатуруПоОперациям0)
	
	НомераТаблиц.Вставить("ТаблицаСтавкаПодтвержденаРеализация0",	НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТаблицаСтавкаПодтверждена",				НомераТаблиц.Количество());
	
	Если КлассифицироватьНоменклатуруПоОперациям0 Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.ОжидаетсяПодтверждение) КАК Состояние,
		|	Состав.СчетФактура КАК СчетФактура,
		|	Состав.ВидЦенности КАК ВидЦенности,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0) КАК СтавкаНДС,
		|	Состав.Покупатель КАК Покупатель,
		|	Состав.СуммаБезНДС КАК СуммаБезНДС,
		|	0 КАК НДС,
		|	Состав.КурсоваяРазница КАК КурсоваяРазница,
		|	Состав.ДатаСобытия КАК ДатаСобытия,
		|	Состав.Событие КАК Событие
		|ИЗ
		|	ВременнаяТаблицаСостав КАК Состав
		|ГДЕ
		|	Состав.Событие = ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПродажи.ПодтвержденаСтавка0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Состав.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Состав.СчетФактура КАК СчетФактура,
		|	ЕСТЬNULL(РеквизитыДокументовРасчетов.ДатаРегистратора, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРеализации,
		|	Состав.ВидЦенности КАК ВидЦенности,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0) КАК СтавкаНДС,
		|	Состав.Покупатель КАК Покупатель,
		|	ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.ПодтвержденаРеализация0) КАК Состояние,
		|	ЗНАЧЕНИЕ(Перечисление.НДСВидНачисления.Реализация0) КАК ВидНачисления,
		|	Состав.КурсоваяРазница КАК КурсоваяРазница,
		|	Состав.ДатаСобытия КАК ДатаСобытия,
		|	Состав.Событие КАК Событие,
		|	""Подтвержден НДС 0% по реализации"" КАК Содержание,
		|	ЕСТЬNULL(ПодтверждениеНулевойСтавкиНДСКодыОперацийНалоговаяБаза.НесырьевыеТовары, ЛОЖЬ) КАК НесырьевыеТовары,
		|	ЕСТЬNULL(ПодтверждениеНулевойСтавкиНДСКодыОперацийНалоговаяБаза.ПродажиСНДС0, Состав.СуммаБезНДС) КАК СуммаБезНДС,
		|	0 КАК НДС,
		|	ПодтверждениеНулевойСтавкиНДСКодыОперацийНалоговаяБаза.КодОперации КАК КодОперации0,
		|	Состав.НомерСтроки
		|ИЗ
		|	ВременнаяТаблицаСостав КАК Состав
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК РеквизитыДокументовРасчетов
		|		ПО (РеквизитыДокументовРасчетов.Организация = &Организация)
		|			И Состав.СчетФактура = РеквизитыДокументовРасчетов.Документ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПодтверждениеНулевойСтавкиНДС.КодыОперацийНалоговаяБаза КАК ПодтверждениеНулевойСтавкиНДСКодыОперацийНалоговаяБаза
		|		ПО Состав.КлючСтроки = ПодтверждениеНулевойСтавкиНДСКодыОперацийНалоговаяБаза.КлючСтроки
		|ГДЕ
		|	Состав.Событие = ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПродажи.ПодтвержденаСтавка0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Состав.НомерСтроки";
		
	Иначе
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.ОжидаетсяПодтверждение) КАК Состояние,
		|	Состав.СчетФактура,
		|	Состав.ВидЦенности,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0) КАК СтавкаНДС,
		|	Состав.Покупатель,
		|	Состав.СуммаБезНДС КАК СуммаБезНДС,
		|	0 КАК НДС,
		|	Состав.КурсоваяРазница,
		|	Состав.ДатаСобытия,
		|	Состав.Событие
		|ИЗ
		|	ВременнаяТаблицаСостав КАК Состав
		|ГДЕ
		|	Состав.Событие = ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПродажи.ПодтвержденаСтавка0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Состав.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Состав.СчетФактура,
		|	ЕСТЬNULL(РеквизитыДокументовРасчетов.ДатаРегистратора, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРеализации,
		|	Состав.ВидЦенности,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0) КАК СтавкаНДС,
		|	Состав.Покупатель,
		|	ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.ПодтвержденаРеализация0) КАК Состояние,
		|	ЗНАЧЕНИЕ(Перечисление.НДСВидНачисления.Реализация0) КАК ВидНачисления,
		|	Состав.СуммаБезНДС КАК СуммаБезНДС,
		|	Состав.КурсоваяРазница КАК КурсоваяРазница,
		|	0 КАК НДС,
		|	Состав.ДатаСобытия,
		|	Состав.Событие,
		|	""Подтвержден НДС 0% по реализации"" КАК Содержание
		|ИЗ
		|	ВременнаяТаблицаСостав КАК Состав
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК РеквизитыДокументовРасчетов
		|		ПО (РеквизитыДокументовРасчетов.Организация = &Организация)
		|			И Состав.СчетФактура = РеквизитыДокументовРасчетов.Документ
		|ГДЕ
		|	Состав.Событие = ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПродажи.ПодтвержденаСтавка0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Состав.НомерСтроки";

	КонецЕсли;
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаСтавкаНеПодтверждена(НомераТаблиц,КлассифицироватьНоменклатуруПоОперациям0)
	
	НомераТаблиц.Вставить("ТаблицаСтавкаНеПодтвержденаРеализация0",	НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТаблицаСтавкаНеПодтверждена",			НомераТаблиц.Количество());
	
	Если КлассифицироватьНоменклатуруПоОперациям0 Тогда
	
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.ОжидаетсяПодтверждение) КАК Состояние,
		|	Состав.СчетФактура КАК СчетФактура,
		|	Состав.ВидЦенности КАК ВидЦенности,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0) КАК СтавкаНДС,
		|	Состав.Покупатель КАК Покупатель,
		|	Состав.СуммаБезНДС КАК СуммаБезНДС,
		|	0 КАК НДС,
		|	Состав.КурсоваяРазница КАК КурсоваяРазница,
		|	Состав.ДатаСобытия КАК ДатаСобытия,
		|	Состав.Событие КАК Событие
		|ИЗ
		|	ВременнаяТаблицаСостав КАК Состав
		|ГДЕ
		|	Состав.Событие = ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПродажи.НеПодтвержденаСтавка0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Состав.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.НеПодтвержденаРеализация0) КАК Состояние,
		|	Состав.СчетФактура КАК СчетФактура,
		|	Состав.ВидЦенности КАК ВидЦенности,
		|	Состав.СтавкаНДС КАК СтавкаНДС,
		|	Состав.Покупатель КАК Покупатель,
		|	ЗНАЧЕНИЕ(Перечисление.НДСВидНачисления.Реализация0) КАК ВидНачисления,
		|	Состав.ДатаСобытия КАК ДатаСобытия,
		|	Состав.Событие КАК Событие,
		|	""Не подтвержден НДС 0% по реализации"" КАК Содержание,
		|	ВЫБОР
		|		КОГДА &Период >= ДАТАВРЕМЯ(2024, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
		|		КОГДА КОНЕЦПЕРИОДА(Состав.ДатаРеализации, КВАРТАЛ) <> КОНЕЦПЕРИОДА(&Период, КВАРТАЛ)
		|			ТОГДА НАЧАЛОПЕРИОДА(Состав.ДатаРеализации, КВАРТАЛ)
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ КАК КорректируемыйПериод,
		|	ВЫБОР
		|		КОГДА &Период >= ДАТАВРЕМЯ(2024, 1, 1)
		|			ТОГДА ЛОЖЬ
		|		КОГДА КОНЕЦПЕРИОДА(Состав.ДатаРеализации, КВАРТАЛ) <> КОНЕЦПЕРИОДА(&Период, КВАРТАЛ)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЗаписьДополнительногоЛиста,
		|	Состав.СчетФактураВыданный КАК СчетФактураВыданный,
		|	ЕСТЬNULL(ПодтверждениеНулевойСтавкиНДСКодыОперацийНалоговаяБаза.НесырьевыеТовары, ЛОЖЬ) КАК НесырьевыеТовары,
		|	ЕСТЬNULL(ПодтверждениеНулевойСтавкиНДСКодыОперацийНалоговаяБаза.ПродажиСНДС0, Состав.СуммаБезНДС) КАК СуммаБезНДС,
		|	ЕСТЬNULL(ПодтверждениеНулевойСтавкиНДСКодыОперацийНалоговаяБаза.СуммаНДС, Состав.НДС) КАК НДС,
		|	ПодтверждениеНулевойСтавкиНДСКодыОперацийНалоговаяБаза.КодОперации КАК КодОперации0,
		|	Состав.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	ВременнаяТаблицаСостав КАК Состав
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПодтверждениеНулевойСтавкиНДС.КодыОперацийНалоговаяБаза КАК ПодтверждениеНулевойСтавкиНДСКодыОперацийНалоговаяБаза
		|		ПО Состав.КлючСтроки = ПодтверждениеНулевойСтавкиНДСКодыОперацийНалоговаяБаза.КлючСтроки
		|ГДЕ
		|	Состав.Событие = ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПродажи.НеПодтвержденаСтавка0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Состав.НомерСтроки";
	
	Иначе
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.ОжидаетсяПодтверждение) КАК Состояние,
		|	Состав.СчетФактура КАК СчетФактура,
		|	Состав.ВидЦенности КАК ВидЦенности,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0) КАК СтавкаНДС,
		|	Состав.Покупатель КАК Покупатель,
		|	Состав.СуммаБезНДС КАК СуммаБезНДС,
		|	0 КАК НДС,
		|	Состав.КурсоваяРазница КАК КурсоваяРазница,
		|	Состав.ДатаСобытия КАК ДатаСобытия,
		|	Состав.Событие КАК Событие
		|ИЗ
		|	ВременнаяТаблицаСостав КАК Состав
		|ГДЕ
		|	Состав.Событие = ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПродажи.НеПодтвержденаСтавка0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Состав.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.НеПодтвержденаРеализация0) КАК Состояние,
		|	Состав.СчетФактура КАК СчетФактура,
		|	Состав.ВидЦенности КАК ВидЦенности,
		|	Состав.СтавкаНДС КАК СтавкаНДС,
		|	Состав.Покупатель КАК Покупатель,
		|	ЗНАЧЕНИЕ(Перечисление.НДСВидНачисления.Реализация0) КАК ВидНачисления,
		|	Состав.СуммаБезНДС КАК СуммаБезНДС,
		|	Состав.НДС КАК НДС,
		|	Состав.ДатаСобытия КАК ДатаСобытия,
		|	Состав.Событие КАК Событие,
		|	""Не подтвержден НДС 0% по реализации"" КАК Содержание,
		|	ВЫБОР
		|		КОГДА &Период >= ДАТАВРЕМЯ(2024, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
		|		КОГДА КОНЕЦПЕРИОДА(Состав.ДатаРеализации, КВАРТАЛ) <> КОНЕЦПЕРИОДА(&Период, КВАРТАЛ)
		|			ТОГДА НАЧАЛОПЕРИОДА(Состав.ДатаРеализации, КВАРТАЛ)
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ КАК КорректируемыйПериод,
		|	ВЫБОР
		|		КОГДА &Период >= ДАТАВРЕМЯ(2024, 1, 1)
		|			ТОГДА ЛОЖЬ
		|		КОГДА КОНЕЦПЕРИОДА(Состав.ДатаРеализации, КВАРТАЛ) <> КОНЕЦПЕРИОДА(&Период, КВАРТАЛ)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЗаписьДополнительногоЛиста,
		|	Состав.СчетФактураВыданный КАК СчетФактураВыданный
		|ИЗ
		|	ВременнаяТаблицаСостав КАК Состав
		|ГДЕ
		|	Состав.Событие = ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПродажи.НеПодтвержденаСтавка0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Состав.НомерСтроки";

	КонецЕсли;
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();

КонецФункции

Функция ТекстЗапросаПоФормированиюРегламентнойОперации(НомераТаблиц)

	НомераТаблиц.Вставить("ДанныеРегламентнойОперации", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Регистратор,
	|	НАЧАЛОПЕРИОДА(Реквизиты.Дата, КВАРТАЛ) КАК Период,
	|	Реквизиты.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Перечисление.РегламентныеОперации.ПодтверждениеНулевойСтавкиНДС) КАК РегламентнаяОперация
	|ИЗ
	|	Документ.ПодтверждениеНулевойСтавкиНДС КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции 

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	// Счета-фактуры
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СчетФактура";
	КомандаПечати.Представление = НСтр("ru = 'Счета-фактуры'");
	КомандаПечати.Обработчик    = "УчетНДСКлиент.ВыполнитьКомандуПечатиСчетовФактур";

КонецПроцедуры

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетФактура") Тогда
		МассивСчетовФактур = ПолучитьМассивСчетовФактурОбъктов(МассивОбъектов);
		Документы.СчетФактураВыданный.Печать(МассивСчетовФактур, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	КонецЕсли;
	
	ОбщегоНазначенияБП.ЗаполнитьДополнительныеПараметрыПечати(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);	
	
КонецПроцедуры

Функция ПолучитьМассивСчетовФактурОбъктов(МассивОбъектов)
	
	Запрос = Новый Запрос();
	Запрос.Параметры.Вставить("МассивОбъектов", МассивОбъектов);
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ПодтверждениеНулевойСтавкиСостав.СчетФактураВыданный
	|ИЗ
	|	Документ.ПодтверждениеНулевойСтавкиНДС.Состав КАК ПодтверждениеНулевойСтавкиСостав
	|ГДЕ
	|	ПодтверждениеНулевойСтавкиСостав.Ссылка В (&МассивОбъектов)
	|	И ПодтверждениеНулевойСтавкиСостав.СчетФактураВыданный <> ЗНАЧЕНИЕ(Документ.СчетФактураВыданный.ПустаяСсылка)";
	
	Запрос.Текст = ТекстЗапроса;
	
	Возврат (Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СчетФактура"));
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Производит заполнение документа
//
// Параметры:
//   СтруктураПараметров - Струкутра - структура входных параметров с ключами:
//     * Организация           - СправочникСсылка.Организация - организация, для которой будут получены данные для заполнения документа.
//     * Дата                  - Дата - дата, на которую будут получены данные для заполнения документа.
//     * КлассифицироватьНоменклатуруПоОперациям0 - Булево значение ресурса КлассифицироватьНоменклатуруПоОперациям0 регистра НастройкиУчетаНДС.
//     * ТаблицаКодовОпераций0 - ТаблицаЗначений - содержит значания общего макета ПереченьКодовОпераций0.
//   АдресХранилища - Строка - адрес временного хранилища для помещения результата выполнения.
Процедура ЗаполнитьДокумент(СтруктураПараметров, АдресХранилища) Экспорт
	
	Дата = СтруктураПараметров.Дата;
	Организация = СтруктураПараметров.Организация;
	КлассифицироватьНоменклатуруПоОперациям0 = СтруктураПараметров.КлассифицироватьНоменклатуруПоОперациям0;
	
	Состав = Новый ТаблицаЗначений();
	Для Каждого КолонкаТабличнойЧасти Из Метаданные.Документы.ПодтверждениеНулевойСтавкиНДС.ТабличныеЧасти.Состав.Реквизиты Цикл
		Состав.Колонки.Добавить(КолонкаТабличнойЧасти.Имя, КолонкаТабличнойЧасти.Тип);
	КонецЦикла;
	
	ДанныеДляЗаполнения = Новый Структура;
	
	Если КлассифицироватьНоменклатуруПоОперациям0
		И УчетНДСПереопределяемый.ВерсияПостановленияНДС1137(Дата) >= 3 Тогда
		
		КодыОперацийНалоговаяБаза = Новый ТаблицаЗначений();
		Для Каждого КолонкаТабличнойЧасти Из Метаданные.Документы.ПодтверждениеНулевойСтавкиНДС.ТабличныеЧасти.КодыОперацийНалоговаяБаза.Реквизиты Цикл
			КодыОперацийНалоговаяБаза.Колонки.Добавить(КолонкаТабличнойЧасти.Имя, КолонкаТабличнойЧасти.Тип);
		КонецЦикла;
		
		ТаблицаКодовОпераций0 = СтруктураПараметров.ТаблицаКодовОпераций0;
		
		ДатаЗапроса = Дата;
		
		Если НЕ ЗначениеЗаполнено(ДатаЗапроса) Тогда
			
			ДатаЗапроса = КонецДня(ТекущаяДатаСеанса());
			
		КонецЕсли;
		
		ВалютаРеглУчета = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("КонецПериода",            Новый Граница(КонецДня(ДатаЗапроса), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("Организация",             Организация);
		Запрос.УстановитьПараметр("СостояниеПредположения0", Перечисления.НДССостоянияРеализация0.ОжидаетсяПодтверждение);
		Запрос.Параметры.Вставить("ДатаЗапроса",             ДатаЗапроса);
		Запрос.Параметры.Вставить("Офшоры",                  УчетОфшоров.СписокОфшоров(ДатаЗапроса));
		Запрос.Параметры.Вставить("ВалютаРеглУчета",         ВалютаРеглУчета);
		Запрос.Параметры.Вставить("ТаблицаКодовОпераций0",   ТаблицаКодовОпераций0);
		Запрос.Параметры.Вставить("КодОперацииПоУмолчанию",  "1010400"); // Значение в случае неопределения конкретной операции НДС 0%
		Запрос.Параметры.Вставить("РФ",                      Справочники.СтраныМира.Россия);
		Запрос.Параметры.Вставить("СтраныЕАЭС",              СтраныЕАЭС());
		
		Если ЗначениеЗаполнено(Организация) Тогда
			
			Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация, "ОбособленноеПодразделение, ГоловнаяОрганизация");
			
			Если Реквизиты.ОбособленноеПодразделение Тогда
				Запрос.УстановитьПараметр("ГоловнаяОрганизация", Реквизиты.ГоловнаяОрганизация);
			Иначе
				Запрос.УстановитьПараметр("ГоловнаяОрганизация", Организация);
			КонецЕсли;
			
		Иначе
			Запрос.УстановитьПараметр("ГоловнаяОрганизация", Организация);
		КонецЕсли;
		
		Запрос.Текст = ТекстЗапросаРасчетКодовОпераций0();
		
		Событие = Перечисления.СобытияПоНДСПродажи.ПодтвержденаСтавка0;
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			Ном = 0;
			ВыборкаЗакончилась = Ложь;
			
			Пока Ном < Выборка.Количество() И НЕ ВыборкаЗакончилась Цикл
				
				СтрокаСостава = Состав.Добавить();
				КлючСтроки = Новый УникальныйИдентификатор;
				
				СтрокаСостава.ДокументОтгрузки = Выборка.ДокументОтгрузки;
				СтрокаСостава.Покупатель = Выборка.Покупатель;
				СтрокаСостава.Событие = Событие;
				СтрокаСостава.ПродажиСНДС0 = Выборка.НалоговаяБазаДокументаОтгрузки;
				СтрокаСостава.КлючСтроки = КлючСтроки;
				
				КолвоКодовДокументаОтгрузки = 0;
				
				Пока СтрокаСостава.ДокументОтгрузки = Выборка.ДокументОтгрузки
					И СтрокаСостава.Покупатель = Выборка.Покупатель Цикл
					
					СтрокаКодыОпераций = КодыОперацийНалоговаяБаза.Добавить();
					СтрокаКодыОпераций.КлючСтроки = КлючСтроки;
					СтрокаКодыОпераций.КодОперации = Выборка.Код;
					СтрокаКодыОпераций.НесырьевыеТовары = Выборка.НесырьевыеТовары;
					СтрокаКодыОпераций.ПродажиСНДС0 = Выборка.НалоговаяБазаКодаОперации;
					
					Если КолвоКодовДокументаОтгрузки < 2 Тогда
						
						СтрокаСостава.КодыОперацийПредставление = СтрокаСостава.КодыОперацийПредставление +
									?(ЗначениеЗаполнено(СтрокаСостава.КодыОперацийПредставление), ";", "") + Выборка.Код;
						
					КонецЕсли;
					
					Ном = Ном + 1;
					КолвоКодовДокументаОтгрузки = КолвоКодовДокументаОтгрузки + 1;
					
					Если Не Выборка.Следующий() Тогда
						
						ВыборкаЗакончилась = Истина;
						Прервать;
						
					КонецЕсли;
					
				КонецЦикла;
				
				Если КолвоКодовДокументаОтгрузки > 2 Тогда
					
					СтрокаСостава.КодыОперацийПредставление = СтрокаСостава.КодыОперацийПредставление +
									СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
											НСтр("ru = ' и ещё %1'"),
											КолвоКодовДокументаОтгрузки - 2);
				КонецЕсли;
				
			КонецЦикла;
		
		КонецЕсли;
		
		ДанныеДляЗаполнения.Вставить("КодыОперацийНалоговаяБаза",КодыОперацийНалоговаяБаза);
		
	Иначе
		
		// Старый алгоритм, в котором 1 реализации соответствует 1 код операции НДС 0%
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("КонецПериода",            Новый Граница(КонецДня(Дата), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("Организация",             Организация);
		Запрос.УстановитьПараметр("СостояниеПредположения0", Перечисления.НДССостоянияРеализация0.ОжидаетсяПодтверждение);
		
		ТекстПостановление1137 = 
		"ВЫБРАТЬ
		|	НДСРеализация0Остатки.СчетФактура КАК ДокументОтгрузки,
		|	НДСРеализация0Остатки.ВидЦенности,
		|	НДСРеализация0Остатки.СтавкаНДС,
		|	НДСРеализация0Остатки.СуммаБезНДСОстаток + НДСРеализация0Остатки.НДСОстаток КАК ПродажиСНДС0,
		|	НДСРеализация0Остатки.КурсоваяРазницаОстаток КАК КурсоваяРазница,
		|	НДСРеализация0Остатки.Покупатель,
		|	ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПродажи.ПодтвержденаСтавка0) КАК Событие
		|ИЗ
		|	РегистрНакопления.НДСРеализация0.Остатки(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И Состояние = &СостояниеПредположения0) КАК НДСРеализация0Остатки";

		ТекстПостановление735 = 
		"ВЫБРАТЬ
		|	НДСРеализация0Остатки.СчетФактура КАК ДокументОтгрузки,
		|	НДСРеализация0Остатки.СуммаБезНДСОстаток КАК ПродажиСНДС0,
		|	НДСРеализация0Остатки.Покупатель,
		|	ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПродажи.ПодтвержденаСтавка0) КАК Событие
		|ИЗ
		|	РегистрНакопления.НДСРеализация0.Остатки(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И Состояние = &СостояниеПредположения0) КАК НДСРеализация0Остатки";
		
		Если УчетНДСПереопределяемый.ВерсияПостановленияНДС1137(Дата) >= 3 Тогда
			Запрос.Текст = ТекстПостановление735;
		Иначе
			Запрос.Текст = ТекстПостановление1137;
		КонецЕсли;
		
		РезультатЗапроса = Запрос.Выполнить();
			
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
				
			Пока Выборка.Следующий() Цикл
				
				СтрокаСостава = Состав.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаСостава, Выборка);
				
			КонецЦикла;
				
		КонецЕсли;
		
	КонецЕсли;
	
	ДанныеДляЗаполнения.Вставить("Состав",Состав);
	
	ПоместитьВоВременноеХранилище(ДанныеДляЗаполнения, АдресХранилища);

КонецПроцедуры

Функция ТекстЗапросаРасчетКодовОпераций0()

	Если ПолучитьФункциональнуюОпцию("ИспользоватьУведомленияОКонтролируемыхСделках") Тогда
		
		ТипВзаимозависимости =
		"ВЫБОР
		|		КОГДА ВзаимозависимыеЛицаСрезПоследних.ТипВзаимозависимости = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.ВзаимозависимыПоКодексу)
		|			ТОГДА ""Да""
		|		ИНАЧЕ ""Нет""
		|	КОНЕЦ";
		
		ЛевоеСоединение = 
		"ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВзаимозависимыеЛица.СрезПоследних(&ДатаЗапроса, Организация = &ГоловнаяОрганизация) КАК ВзаимозависимыеЛицаСрезПоследних
		|		ПО ОтгрузкиДляОпределенияОфшоровИВзаимозависимости.Покупатель = ВзаимозависимыеЛицаСрезПоследних.Контрагент";
		
	Иначе
		ТипВзаимозависимости = """Нет""";
		ЛевоеСоединение = "";
	КонецЕсли;
	
	ТекстЗапроса = СтрШаблон(
	"ВЫБРАТЬ
	|	НДСРеализация0Остатки.СчетФактура КАК ДокументОтгрузки,
	|	НДСРеализация0Остатки.Покупатель КАК Покупатель,
	|	НДСРеализация0Остатки.Покупатель.СтранаРегистрации КАК СтранаРегистрации,
	|	НДСРеализация0Остатки.СуммаБезНДСОстаток КАК НалоговаяБазаДокументаОтгрузки
	|ПОМЕСТИТЬ ПараметрыДокументовОтгрузки
	|ИЗ
	|	РегистрНакопления.НДСРеализация0.Остатки(
	|			&КонецПериода,
	|			Организация = &Организация
	|				И Состояние = &СостояниеПредположения0) КАК НДСРеализация0Остатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОтгрузки,
	|	Покупатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПараметрыДокументовОтгрузки.ДокументОтгрузки КАК ДокументОтгрузки,
	|	&КодОперацииПоУмолчанию КАК Код,
	|	ИСТИНА КАК НесырьевыеТовары,
	|	ИСТИНА КАК СырьевыеТовары,
	|	ПараметрыДокументовОтгрузки.НалоговаяБазаДокументаОтгрузки КАК НалоговаяБазаКодаОперации,
	|	ПараметрыДокументовОтгрузки.Покупатель КАК Покупатель,
	|	ПараметрыДокументовОтгрузки.НалоговаяБазаДокументаОтгрузки КАК НалоговаяБазаДокументаОтгрузки
	|ПОМЕСТИТЬ ОтгрузкиСКодомПоУмолчанию
	|ИЗ
	|	ПараметрыДокументовОтгрузки КАК ПараметрыДокументовОтгрузки
	|ГДЕ
	|	(ПараметрыДокументовОтгрузки.ДокументОтгрузки ССЫЛКА Документ.ДокументРасчетовСКонтрагентом
	|			ИЛИ ПараметрыДокументовОтгрузки.ДокументОтгрузки ССЫЛКА Документ.ОтражениеНачисленияНДС
	|			ИЛИ ПараметрыДокументовОтгрузки.ДокументОтгрузки ССЫЛКА Документ.ВозвратТоваровПоставщику
	|			ИЛИ ПараметрыДокументовОтгрузки.ДокументОтгрузки ССЫЛКА Документ.ПередачаНМА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(ОтчетОРозничныхПродажахТовары.Номенклатура.Операции0.Код, ""ОперацииНДС0"") КАК Классификация,
	|	"""" КАК КонтрагентИЗОфшора,
	|	"""" КАК КонтрагентВзаимозависимоеЛицо,
	|	"""" КАК СтранаРеализацииЕАЭСЗаПределамиЕАЭС,
	|	"""" КАК СтранаРеализацииЗаПределамиРФ,
	|	ПараметрыДокументовОтгрузки.ДокументОтгрузки КАК ДокументОтгрузки,
	|	ПараметрыДокументовОтгрузки.Покупатель КАК Покупатель,
	|	СУММА(ЕСТЬNULL(ОтчетОРозничныхПродажахТовары.Сумма, 0)) КАК ПродажиСНДС0,
	|	ПараметрыДокументовОтгрузки.НалоговаяБазаДокументаОтгрузки КАК НалоговаяБазаДокументаОтгрузки
	|ПОМЕСТИТЬ УслугиГостиниц
	|ИЗ
	|	ПараметрыДокументовОтгрузки КАК ПараметрыДокументовОтгрузки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетОРозничныхПродажах.Товары КАК ОтчетОРозничныхПродажахТовары
	|		ПО ПараметрыДокументовОтгрузки.ДокументОтгрузки = ОтчетОРозничныхПродажахТовары.Ссылка
	|ГДЕ
	|	ОтчетОРозничныхПродажахТовары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПараметрыДокументовОтгрузки.Покупатель,
	|	ПараметрыДокументовОтгрузки.НалоговаяБазаДокументаОтгрузки,
	|	ЕСТЬNULL(ОтчетОРозничныхПродажахТовары.Номенклатура.Операции0.Код, ""ОперацииНДС0""),
	|	ПараметрыДокументовОтгрузки.ДокументОтгрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""НеСырьевыеТоварыВДругиеСтраныОбщаяСтавкаНДС"" КАК Классификация,
	|	ПараметрыДокументовОтгрузки.СтранаРегистрации КАК СтранаРеализации,
	|	ПараметрыДокументовОтгрузки.СтранаРегистрации КАК СтранаРегистрации,
	|	ПараметрыДокументовОтгрузки.ДокументОтгрузки КАК ДокументОтгрузки,
	|	ПараметрыДокументовОтгрузки.Покупатель КАК Покупатель,
	|	ПараметрыДокументовОтгрузки.НалоговаяБазаДокументаОтгрузки КАК ПродажиСНДС0,
	|	ПараметрыДокументовОтгрузки.НалоговаяБазаДокументаОтгрузки КАК НалоговаяБазаДокументаОтгрузки
	|ПОМЕСТИТЬ ОтгрузкиСЕдинойКлассификацией
	|ИЗ
	|	ПараметрыДокументовОтгрузки КАК ПараметрыДокументовОтгрузки
	|ГДЕ
	|	ПараметрыДокументовОтгрузки.ДокументОтгрузки ССЫЛКА Документ.ПередачаОС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""НеСырьевыеТоварыВДругиеСтраныОбщаяСтавкаНДС"",
	|	ПараметрыДокументовОтгрузки.СтранаРегистрации,
	|	ПараметрыДокументовОтгрузки.СтранаРегистрации,
	|	ПараметрыДокументовОтгрузки.ДокументОтгрузки,
	|	ПараметрыДокументовОтгрузки.Покупатель,
	|	ПараметрыДокументовОтгрузки.НалоговаяБазаДокументаОтгрузки,
	|	ПараметрыДокументовОтгрузки.НалоговаяБазаДокументаОтгрузки
	|ИЗ
	|	ПараметрыДокументовОтгрузки КАК ПараметрыДокументовОтгрузки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияОтгруженныхТоваров КАК РеализацияОтгруженныхТоваров
	|		ПО ПараметрыДокументовОтгрузки.ДокументОтгрузки = РеализацияОтгруженныхТоваров.Ссылка
	|ГДЕ
	|	РеализацияОтгруженныхТоваров.ДокументОтгрузки ССЫЛКА Документ.ПередачаОС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""ПереработкаТоваров"",
	|	ПараметрыДокументовОтгрузки.СтранаРегистрации,
	|	ПараметрыДокументовОтгрузки.СтранаРегистрации,
	|	ПараметрыДокументовОтгрузки.ДокументОтгрузки,
	|	ПараметрыДокументовОтгрузки.Покупатель,
	|	ПараметрыДокументовОтгрузки.НалоговаяБазаДокументаОтгрузки,
	|	ПараметрыДокументовОтгрузки.НалоговаяБазаДокументаОтгрузки
	|ИЗ
	|	ПараметрыДокументовОтгрузки КАК ПараметрыДокументовОтгрузки
	|ГДЕ
	|	ПараметрыДокументовОтгрузки.ДокументОтгрузки ССЫЛКА Документ.РеализацияУслугПоПереработке
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ПараметрыДокументовОтгрузки.ДокументОтгрузки КАК Документ.ОтчетКомитентуОПродажах).УслугаПоВознаграждению.Операции0.Код, ""ОперацииНДС0""),
	|	ПараметрыДокументовОтгрузки.СтранаРегистрации,
	|	ПараметрыДокументовОтгрузки.СтранаРегистрации,
	|	ПараметрыДокументовОтгрузки.ДокументОтгрузки,
	|	ПараметрыДокументовОтгрузки.Покупатель,
	|	ПараметрыДокументовОтгрузки.НалоговаяБазаДокументаОтгрузки,
	|	ПараметрыДокументовОтгрузки.НалоговаяБазаДокументаОтгрузки
	|ИЗ
	|	ПараметрыДокументовОтгрузки КАК ПараметрыДокументовОтгрузки
	|ГДЕ
	|	ПараметрыДокументовОтгрузки.ДокументОтгрузки ССЫЛКА Документ.ОтчетКомитентуОПродажах
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПараметрыДокументовОтгрузки.ДокументОтгрузки КАК ДокументОтгрузки,
	|	ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Услуги) КАК ТабличныеЧастиДокументов,
	|	АктОбОказанииПроизводственныхУслугУслуги.НомерСтроки КАК НомерСтроки,
	|	АктОбОказанииПроизводственныхУслугУслуги.Номенклатура КАК Номенклатура,
	|	АктОбОказанииПроизводственныхУслугУслуги.Сумма КАК Сумма,
	|	ПараметрыДокументовОтгрузки.Покупатель КАК Покупатель,
	|	ПараметрыДокументовОтгрузки.СтранаРегистрации КАК СтранаРеализации,
	|	ПараметрыДокументовОтгрузки.СтранаРегистрации КАК СтранаРегистрации,
	|	ПараметрыДокументовОтгрузки.НалоговаяБазаДокументаОтгрузки КАК НалоговаяБазаДокументаОтгрузки
	|ПОМЕСТИТЬ АктОбОказанииПроизводственныхУслугКлассификация
	|ИЗ
	|	ПараметрыДокументовОтгрузки КАК ПараметрыДокументовОтгрузки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктОбОказанииПроизводственныхУслуг.Услуги КАК АктОбОказанииПроизводственныхУслугУслуги
	|		ПО ПараметрыДокументовОтгрузки.ДокументОтгрузки = АктОбОказанииПроизводственныхУслугУслуги.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОтгрузки,
	|	ТабличныеЧастиДокументов,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПараметрыДокументовОтгрузки.ДокументОтгрузки КАК ДокументОтгрузки,
	|	ПараметрыДокументовОтгрузки.НалоговаяБазаДокументаОтгрузки КАК НалоговаяБазаДокументаОтгрузки,
	|	ВЫРАЗИТЬ(ПараметрыДокументовОтгрузки.ДокументОтгрузки КАК Документ.СчетФактураВыданный).ДокументОснование КАК ДокументОснование,
	|	ПараметрыДокументовОтгрузки.Покупатель КАК Покупатель,
	|	ПараметрыДокументовОтгрузки.СтранаРегистрации КАК СтранаРеализации,
	|	ПараметрыДокументовОтгрузки.СтранаРегистрации КАК СтранаРегистрации
	|ПОМЕСТИТЬ ДокументОтгрузкиДокументОснование
	|ИЗ
	|	ПараметрыДокументовОтгрузки КАК ПараметрыДокументовОтгрузки
	|ГДЕ
	|	ПараметрыДокументовОтгрузки.ДокументОтгрузки ССЫЛКА Документ.СчетФактураВыданный
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ДокументОтгрузкиДокументОснование.ДокументОснование КАК Документ.ОказаниеУслуг).Номенклатура.Операции0.Код, ""ОперацииНДС0"") КАК Классификация,
	|	ДокументОтгрузкиДокументОснование.СтранаРеализации КАК СтранаРеализации,
	|	ДокументОтгрузкиДокументОснование.СтранаРегистрации КАК СтранаРегистрации,
	|	ДокументОтгрузкиДокументОснование.ДокументОтгрузки КАК ДокументОтгрузки,
	|	ДокументОтгрузкиДокументОснование.Покупатель КАК Покупатель,
	|	ДокументОтгрузкиДокументОснование.НалоговаяБазаДокументаОтгрузки КАК ПродажиНДС0,
	|	ДокументОтгрузкиДокументОснование.НалоговаяБазаДокументаОтгрузки КАК НалоговаяБазаДокументаОтгрузки
	|ПОМЕСТИТЬ ОказаниеУслугСЕдинойКлассификацией
	|ИЗ
	|	ДокументОтгрузкиДокументОснование КАК ДокументОтгрузкиДокументОснование
	|ГДЕ
	|	ДокументОтгрузкиДокументОснование.ДокументОснование ССЫЛКА Документ.ОказаниеУслуг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументОтгрузкиДокументОснование.ДокументОснование КАК ДокументОснование,
	|	ДокументОтгрузкиДокументОснование.Покупатель КАК Покупатель,
	|	ДокументОтгрузкиДокументОснование.ДокументОтгрузки КАК ДокументОтгрузки,
	|	ДокументОтгрузкиДокументОснование.НалоговаяБазаДокументаОтгрузки КАК НалоговаяБазаДокументаОтгрузки,
	|	ДокументОтгрузкиДокументОснование.СтранаРеализации КАК СтранаРеализации,
	|	ДокументОтгрузкиДокументОснование.СтранаРегистрации КАК СтранаРегистрации
	|ПОМЕСТИТЬ НалоговаяБазаОтчетовКомиссионера
	|ИЗ
	|	ДокументОтгрузкиДокументОснование КАК ДокументОтгрузкиДокументОснование
	|ГДЕ
	|	ДокументОтгрузкиДокументОснование.ДокументОснование ССЫЛКА Документ.ОтчетКомиссионераОПродажах
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПараметрыДокументовОтгрузки.ДокументОтгрузки,
	|	ПараметрыДокументовОтгрузки.Покупатель,
	|	ПараметрыДокументовОтгрузки.ДокументОтгрузки,
	|	ПараметрыДокументовОтгрузки.НалоговаяБазаДокументаОтгрузки,
	|	ПараметрыДокументовОтгрузки.СтранаРегистрации,
	|	ПараметрыДокументовОтгрузки.СтранаРегистрации
	|ИЗ
	|	ПараметрыДокументовОтгрузки КАК ПараметрыДокументовОтгрузки
	|ГДЕ
	|	ПараметрыДокументовОтгрузки.ДокументОтгрузки ССЫЛКА Документ.ОтчетКомиссионераОПродажах
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОснование,
	|	Покупатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДокументОтгрузкиДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	НалоговаяБазаОтчетовКомиссионера.ДокументОснование КАК ДокументОснование,
	|	ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Товары) КАК ТабличныеЧастиДокументов,
	|	ОтчетКомиссионераОПродажахТовары.НомерСтроки КАК НомерСтроки,
	|	ОтчетКомиссионераОПродажахТовары.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ОтчетКомиссионераОПродажахТовары.Сумма, 0) КАК Сумма,
	|	НалоговаяБазаОтчетовКомиссионера.ДокументОтгрузки КАК ДокументОтгрузки,
	|	НалоговаяБазаОтчетовКомиссионера.Покупатель КАК Покупатель,
	|	НалоговаяБазаОтчетовКомиссионера.НалоговаяБазаДокументаОтгрузки КАК НалоговаяБазаДокументаОтгрузки,
	|	НалоговаяБазаОтчетовКомиссионера.СтранаРеализации КАК СтранаРеализации,
	|	НалоговаяБазаОтчетовКомиссионера.СтранаРегистрации КАК СтранаРегистрации
	|ПОМЕСТИТЬ ОтчетКомиссионераКлассификация
	|ИЗ
	|	НалоговаяБазаОтчетовКомиссионера КАК НалоговаяБазаОтчетовКомиссионера
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионераОПродажах.Товары КАК ОтчетКомиссионераОПродажахТовары
	|		ПО НалоговаяБазаОтчетовКомиссионера.ДокументОснование = ОтчетКомиссионераОПродажахТовары.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионераОПродажах.Покупатели КАК ОтчетКомиссионераОПродажахПокупатели
	|		ПО НалоговаяБазаОтчетовКомиссионера.Покупатель = ОтчетКомиссионераОПродажахПокупатели.Покупатель
	|			И НалоговаяБазаОтчетовКомиссионера.ДокументОснование = ОтчетКомиссионераОПродажахПокупатели.Ссылка
	|			И (ОтчетКомиссионераОПродажахТовары.КлючСтроки = ОтчетКомиссионераОПродажахПокупатели.КлючСтроки)
	|ГДЕ
	|	ОтчетКомиссионераОПродажахТовары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|	И ОтчетКомиссионераОПродажахТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомиссионера.ОтчетОПродажах)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НалоговаяБазаОтчетовКомиссионера.ДокументОснование,
	|	ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Услуги),
	|	ОтчетКомиссионераОПродажахУслуги.НомерСтроки,
	|	ЕСТЬNULL(ОтчетКомиссионераОПродажахУслуги.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)),
	|	ЕСТЬNULL(ОтчетКомиссионераОПродажахУслуги.Сумма, 0),
	|	НалоговаяБазаОтчетовКомиссионера.ДокументОтгрузки,
	|	НалоговаяБазаОтчетовКомиссионера.Покупатель,
	|	НалоговаяБазаОтчетовКомиссионера.НалоговаяБазаДокументаОтгрузки,
	|	НалоговаяБазаОтчетовКомиссионера.СтранаРеализации,
	|	НалоговаяБазаОтчетовКомиссионера.СтранаРегистрации
	|ИЗ
	|	НалоговаяБазаОтчетовКомиссионера КАК НалоговаяБазаОтчетовКомиссионера
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионераОПродажах.Услуги КАК ОтчетКомиссионераОПродажахУслуги
	|		ПО НалоговаяБазаОтчетовКомиссионера.ДокументОснование = ОтчетКомиссионераОПродажахУслуги.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионераОПродажах.Покупатели КАК ОтчетКомиссионераОПродажахПокупатели
	|		ПО НалоговаяБазаОтчетовКомиссионера.Покупатель = ОтчетКомиссионераОПродажахПокупатели.Покупатель
	|			И НалоговаяБазаОтчетовКомиссионера.ДокументОснование = ОтчетКомиссионераОПродажахПокупатели.Ссылка
	|			И (ОтчетКомиссионераОПродажахУслуги.КлючСтроки = ОтчетКомиссионераОПродажахПокупатели.КлючСтроки)
	|ГДЕ
	|	ОтчетКомиссионераОПродажахУслуги.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|	И ОтчетКомиссионераОПродажахУслуги.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомиссионера.ОтчетОПродажах)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОснование,
	|	ТабличныеЧастиДокументов,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НалоговаяБазаОтчетовКомиссионера
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Товары) КАК ТабличныеЧастиДокументов,
	|	РеализацияТоваровУслуг.ВидОперации КАК ВидОперации,
	|	РеализацияТоваровУслуг.ВалютаДокумента КАК ВалютаДокумента,
	|	РеализацияТоваровУслугТовары.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(РеализацияТоваровУслугТовары.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	|	РеализацияТоваровУслугТовары.Сумма КАК Сумма,
	|	РеализацияТоваровУслуг.СтранаРеализации КАК СтранаРеализации
	|ПОМЕСТИТЬ Реализации0
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ПО РеализацияТоваровУслуг.Ссылка = РеализацияТоваровУслугТовары.Ссылка
	|ГДЕ
	|	РеализацияТоваровУслугТовары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|	И РеализацияТоваровУслуг.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Услуги),
	|	РеализацияТоваровУслуг.ВидОперации,
	|	РеализацияТоваровУслуг.ВалютаДокумента,
	|	РеализацияТоваровУслугУслуги.НомерСтроки,
	|	ЕСТЬNULL(РеализацияТоваровУслугУслуги.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)),
	|	РеализацияТоваровУслугУслуги.Сумма,
	|	РеализацияТоваровУслуг.СтранаРеализации
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	|		ПО РеализацияТоваровУслуг.Ссылка = РеализацияТоваровУслугУслуги.Ссылка
	|ГДЕ
	|	РеализацияТоваровУслугУслуги.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|	И РеализацияТоваровУслуг.Проведен
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	ТабличныеЧастиДокументов,
	|	ВидОперации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПараметрыДокументовОтгрузки.ДокументОтгрузки КАК ДокументОтгрузки,
	|	Реализации0.ТабличныеЧастиДокументов КАК ТабличныеЧастиДокументов,
	|	Реализации0.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Реализации0.СтранаРеализации, ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
	|			ТОГДА Реализации0.СтранаРеализации
	|		ИНАЧЕ ПараметрыДокументовОтгрузки.СтранаРегистрации
	|	КОНЕЦ КАК СтранаРеализации,
	|	ПараметрыДокументовОтгрузки.СтранаРегистрации КАК СтранаРегистрации,
	|	Реализации0.Номенклатура КАК Номенклатура,
	|	Реализации0.Сумма КАК Сумма,
	|	ПараметрыДокументовОтгрузки.Покупатель КАК Покупатель,
	|	ПараметрыДокументовОтгрузки.НалоговаяБазаДокументаОтгрузки КАК НалоговаяБазаДокументаОтгрузки
	|ПОМЕСТИТЬ РеализацияКлассификация
	|ИЗ
	|	ПараметрыДокументовОтгрузки КАК ПараметрыДокументовОтгрузки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Реализации0 КАК Реализации0
	|		ПО ПараметрыДокументовОтгрузки.ДокументОтгрузки = Реализации0.Ссылка
	|ГДЕ
	|	(Реализации0.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРеализацияТоваров.ОтгрузкаБезПереходаПраваСобственности)
	|			ИЛИ Реализации0.ТабличныеЧастиДокументов = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Товары)
	|				И Реализации0.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРеализацияТоваров.ОтгрузкаБезПереходаПраваСобственности))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОтгрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПараметрыДокументовОтгрузки.ДокументОтгрузки КАК РОТ,
	|	ВЫРАЗИТЬ(ПараметрыДокументовОтгрузки.ДокументОтгрузки КАК Документ.РеализацияОтгруженныхТоваров).ДокументОтгрузки КАК ДокументОтгрузки,
	|	ПараметрыДокументовОтгрузки.Покупатель КАК Покупатель,
	|	ПараметрыДокументовОтгрузки.СтранаРегистрации КАК СтранаРеализации,
	|	ПараметрыДокументовОтгрузки.СтранаРегистрации КАК СтранаРегистрации,
	|	ПараметрыДокументовОтгрузки.НалоговаяБазаДокументаОтгрузки КАК НалоговаяБазаДокументаОтгрузки
	|ПОМЕСТИТЬ РОТ0
	|ИЗ
	|	ПараметрыДокументовОтгрузки КАК ПараметрыДокументовОтгрузки
	|ГДЕ
	|	ПараметрыДокументовОтгрузки.ДокументОтгрузки ССЫЛКА Документ.РеализацияОтгруженныхТоваров
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РОТ,
	|	ДокументОтгрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПараметрыДокументовОтгрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(НастройкиУчетаНДС.Период) КАК Период,
	|	НастройкиУчетаНДС.Организация КАК Организация,
	|	РОТ0.ДокументОтгрузки КАК ДокументОтгрузки,
	|	РОТ0.РОТ КАК РОТ,
	|	РОТ0.Покупатель КАК Покупатель,
	|	РОТ0.СтранаРеализации КАК СтранаРеализации,
	|	РОТ0.СтранаРегистрации КАК СтранаРегистрации,
	|	РОТ0.НалоговаяБазаДокументаОтгрузки КАК НалоговаяБазаДокументаОтгрузки
	|ПОМЕСТИТЬ ДатыНачисленийНДСПоОтгрузке
	|ИЗ
	|	РОТ0 КАК РОТ0
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|		ПО РОТ0.ДокументОтгрузки = ДанныеПервичныхДокументов.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаНДС КАК НастройкиУчетаНДС
	|		ПО (ДанныеПервичныхДокументов.Дата >= НастройкиУчетаНДС.Период)
	|ГДЕ
	|	НастройкиУчетаНДС.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	НастройкиУчетаНДС.Организация,
	|	РОТ0.ДокументОтгрузки,
	|	РОТ0.РОТ,
	|	РОТ0.Покупатель,
	|	РОТ0.СтранаРеализации,
	|	РОТ0.СтранаРегистрации,
	|	РОТ0.НалоговаяБазаДокументаОтгрузки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ РОТ0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДатыНачисленийНДСПоОтгрузке.РОТ КАК РОТ,
	|	ДатыНачисленийНДСПоОтгрузке.ДокументОтгрузки КАК ДокументОтгрузки,
	|	ЕСТЬNULL(НастройкиУчетаНДС.НачислятьНДСПоОтгрузке, ЛОЖЬ) КАК НачислятьНДСПоОтгрузке,
	|	ДатыНачисленийНДСПоОтгрузке.Покупатель КАК Покупатель,
	|	ДатыНачисленийНДСПоОтгрузке.СтранаРеализации КАК СтранаРеализации,
	|	ДатыНачисленийНДСПоОтгрузке.СтранаРегистрации КАК СтранаРегистрации,
	|	ДатыНачисленийНДСПоОтгрузке.НалоговаяБазаДокументаОтгрузки КАК НалоговаяБазаДокументаОтгрузки
	|ПОМЕСТИТЬ POTНачислятьНДСПоОтгрузке
	|ИЗ
	|	ДатыНачисленийНДСПоОтгрузке КАК ДатыНачисленийНДСПоОтгрузке
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаНДС КАК НастройкиУчетаНДС
	|		ПО ДатыНачисленийНДСПоОтгрузке.Период = НастройкиУчетаНДС.Период
	|			И ДатыНачисленийНДСПоОтгрузке.Организация = НастройкиУчетаНДС.Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РОТ,
	|	ДокументОтгрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДатыНачисленийНДСПоОтгрузке
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	POTНачислятьНДСПоОтгрузке.ДокументОтгрузки КАК ДокументОтгрузки,
	|	РублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента КАК ТабличнаяЧастьДокумента,
	|	РублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента КАК НомерСтрокиДокумента,
	|	POTНачислятьНДСПоОтгрузке.РОТ КАК РОТ,
	|	РублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС КАК НалоговаяБазаНДС,
	|	POTНачислятьНДСПоОтгрузке.Покупатель КАК Покупатель,
	|	POTНачислятьНДСПоОтгрузке.СтранаРеализации КАК СтранаРеализации,
	|	POTНачислятьНДСПоОтгрузке.СтранаРегистрации КАК СтранаРегистрации,
	|	POTНачислятьНДСПоОтгрузке.НалоговаяБазаДокументаОтгрузки КАК НалоговаяБазаДокументаОтгрузки
	|ПОМЕСТИТЬ РОТ0Валюта
	|ИЗ
	|	POTНачислятьНДСПоОтгрузке КАК POTНачислятьНДСПоОтгрузке
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РублевыеСуммыДокументовВВалюте КАК РублевыеСуммыДокументовВВалюте
	|		ПО POTНачислятьНДСПоОтгрузке.РОТ = РублевыеСуммыДокументовВВалюте.Регистратор
	|ГДЕ
	|	(НЕ POTНачислятьНДСПоОтгрузке.НачислятьНДСПоОтгрузке
	|			ИЛИ РублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Услуги))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РОТ0Валюта.РОТ КАК ДокументОтгрузки,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Реализации0.Номенклатура.Операции0, ЗНАЧЕНИЕ(Справочник.Операции0.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Операции0.ПустаяСсылка)
	|			ТОГДА Реализации0.Номенклатура.Операции0.Код
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Реализации0.ТабличныеЧастиДокументов = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Товары)
	|						И ЕСТЬNULL(Реализации0.Номенклатура.Услуга, ЛОЖЬ) = ЛОЖЬ
	|						И ЕСТЬNULL(Реализации0.Номенклатура.КодТНВЭД.СырьевойТовар, ЛОЖЬ) = ИСТИНА
	|					ТОГДА ""РеализацияСырьевыхВДругиеСтраны""
	|				КОГДА Реализации0.ТабличныеЧастиДокументов = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Товары)
	|						И ЕСТЬNULL(Реализации0.Номенклатура.Услуга, ЛОЖЬ) = ЛОЖЬ
	|						И ЕСТЬNULL(Реализации0.Номенклатура.КодТНВЭД.СырьевойТовар, ЛОЖЬ) = ЛОЖЬ
	|					ТОГДА ""НеСырьевыеТоварыВДругиеСтраныОбщаяСтавкаНДС""
	|				ИНАЧЕ ""ОперацииНДС0""
	|			КОНЕЦ
	|	КОНЕЦ КАК Классификация,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Реализации0.СтранаРеализации, ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
	|			ТОГДА Реализации0.СтранаРеализации
	|		ИНАЧЕ РОТ0Валюта.СтранаРеализации
	|	КОНЕЦ КАК СтранаРеализации,
	|	РОТ0Валюта.СтранаРегистрации КАК СтранаРегистрации,
	|	РОТ0Валюта.Покупатель КАК Покупатель,
	|	СУММА(РОТ0Валюта.НалоговаяБазаНДС) КАК ПродажиНДС0,
	|	РОТ0Валюта.НалоговаяБазаДокументаОтгрузки КАК НалоговаяБазаДокументаОтгрузки
	|ПОМЕСТИТЬ РОТКлассификацияНалоговаяБаза
	|ИЗ
	|	РОТ0Валюта КАК РОТ0Валюта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реализации0 КАК Реализации0
	|		ПО РОТ0Валюта.ДокументОтгрузки = Реализации0.Ссылка
	|			И РОТ0Валюта.ТабличнаяЧастьДокумента = Реализации0.ТабличныеЧастиДокументов
	|			И РОТ0Валюта.НомерСтрокиДокумента = Реализации0.НомерСтроки
	|
	|СГРУППИРОВАТЬ ПО
	|	РОТ0Валюта.РОТ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Реализации0.Номенклатура.Операции0, ЗНАЧЕНИЕ(Справочник.Операции0.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Операции0.ПустаяСсылка)
	|			ТОГДА Реализации0.Номенклатура.Операции0.Код
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Реализации0.ТабличныеЧастиДокументов = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Товары)
	|						И ЕСТЬNULL(Реализации0.Номенклатура.Услуга, ЛОЖЬ) = ЛОЖЬ
	|						И ЕСТЬNULL(Реализации0.Номенклатура.КодТНВЭД.СырьевойТовар, ЛОЖЬ) = ИСТИНА
	|					ТОГДА ""РеализацияСырьевыхВДругиеСтраны""
	|				КОГДА Реализации0.ТабличныеЧастиДокументов = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Товары)
	|						И ЕСТЬNULL(Реализации0.Номенклатура.Услуга, ЛОЖЬ) = ЛОЖЬ
	|						И ЕСТЬNULL(Реализации0.Номенклатура.КодТНВЭД.СырьевойТовар, ЛОЖЬ) = ЛОЖЬ
	|					ТОГДА ""НеСырьевыеТоварыВДругиеСтраныОбщаяСтавкаНДС""
	|				ИНАЧЕ ""ОперацииНДС0""
	|			КОНЕЦ
	|	КОНЕЦ,
	|	РОТ0Валюта.Покупатель,
	|	РОТ0Валюта.НалоговаяБазаДокументаОтгрузки,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Реализации0.СтранаРеализации, ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
	|			ТОГДА Реализации0.СтранаРеализации
	|		ИНАЧЕ РОТ0Валюта.СтранаРеализации
	|	КОНЕЦ,
	|	РОТ0Валюта.СтранаРегистрации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	POTНачислятьНДСПоОтгрузке.РОТ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Реализации0.Номенклатура.Операции0, ЗНАЧЕНИЕ(Справочник.Операции0.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Операции0.ПустаяСсылка)
	|			ТОГДА Реализации0.Номенклатура.Операции0.Код
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Реализации0.ТабличныеЧастиДокументов = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Товары)
	|						И ЕСТЬNULL(Реализации0.Номенклатура.Услуга, ЛОЖЬ) = ЛОЖЬ
	|						И ЕСТЬNULL(Реализации0.Номенклатура.КодТНВЭД.СырьевойТовар, ЛОЖЬ) = ИСТИНА
	|					ТОГДА ""РеализацияСырьевыхВДругиеСтраны""
	|				КОГДА Реализации0.ТабличныеЧастиДокументов = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Товары)
	|						И ЕСТЬNULL(Реализации0.Номенклатура.Услуга, ЛОЖЬ) = ЛОЖЬ
	|						И ЕСТЬNULL(Реализации0.Номенклатура.КодТНВЭД.СырьевойТовар, ЛОЖЬ) = ЛОЖЬ
	|					ТОГДА ""НеСырьевыеТоварыВДругиеСтраныОбщаяСтавкаНДС""
	|				ИНАЧЕ ""ОперацииНДС0""
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Реализации0.СтранаРеализации, ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
	|			ТОГДА Реализации0.СтранаРеализации
	|		ИНАЧЕ POTНачислятьНДСПоОтгрузке.СтранаРеализации
	|	КОНЕЦ,
	|	POTНачислятьНДСПоОтгрузке.СтранаРегистрации,
	|	POTНачислятьНДСПоОтгрузке.Покупатель,
	|	СУММА(ЕСТЬNULL(Реализации0.Сумма, 0)),
	|	POTНачислятьНДСПоОтгрузке.НалоговаяБазаДокументаОтгрузки
	|ИЗ
	|	POTНачислятьНДСПоОтгрузке КАК POTНачислятьНДСПоОтгрузке
	|		ЛЕВОЕ СОЕДИНЕНИЕ Реализации0 КАК Реализации0
	|		ПО POTНачислятьНДСПоОтгрузке.ДокументОтгрузки = Реализации0.Ссылка
	|ГДЕ
	|	Реализации0.ВалютаДокумента = &ВалютаРеглУчета
	|	И (НЕ POTНачислятьНДСПоОтгрузке.НачислятьНДСПоОтгрузке
	|			ИЛИ Реализации0.ТабличныеЧастиДокументов = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Услуги))
	|
	|СГРУППИРОВАТЬ ПО
	|	POTНачислятьНДСПоОтгрузке.РОТ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Реализации0.Номенклатура.Операции0, ЗНАЧЕНИЕ(Справочник.Операции0.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Операции0.ПустаяСсылка)
	|			ТОГДА Реализации0.Номенклатура.Операции0.Код
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Реализации0.ТабличныеЧастиДокументов = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Товары)
	|						И ЕСТЬNULL(Реализации0.Номенклатура.Услуга, ЛОЖЬ) = ЛОЖЬ
	|						И ЕСТЬNULL(Реализации0.Номенклатура.КодТНВЭД.СырьевойТовар, ЛОЖЬ) = ИСТИНА
	|					ТОГДА ""РеализацияСырьевыхВДругиеСтраны""
	|				КОГДА Реализации0.ТабличныеЧастиДокументов = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Товары)
	|						И ЕСТЬNULL(Реализации0.Номенклатура.Услуга, ЛОЖЬ) = ЛОЖЬ
	|						И ЕСТЬNULL(Реализации0.Номенклатура.КодТНВЭД.СырьевойТовар, ЛОЖЬ) = ЛОЖЬ
	|					ТОГДА ""НеСырьевыеТоварыВДругиеСтраныОбщаяСтавкаНДС""
	|				ИНАЧЕ ""ОперацииНДС0""
	|			КОНЕЦ
	|	КОНЕЦ,
	|	POTНачислятьНДСПоОтгрузке.Покупатель,
	|	POTНачислятьНДСПоОтгрузке.НалоговаяБазаДокументаОтгрузки,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Реализации0.СтранаРеализации, ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
	|			ТОГДА Реализации0.СтранаРеализации
	|		ИНАЧЕ POTНачислятьНДСПоОтгрузке.СтранаРеализации
	|	КОНЕЦ,
	|	POTНачислятьНДСПоОтгрузке.СтранаРегистрации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Реализации0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ РОТ0Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ POTНачислятьНДСПоОтгрузке
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияКлассификация.Покупатель КАК Покупатель,
	|	РеализацияКлассификация.СтранаРегистрации КАК СтранаРегистрации,
	|	РеализацияКлассификация.СтранаРеализации КАК СтранаРеализации,
	|	СУММА(ЕСТЬNULL(РублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС, РеализацияКлассификация.Сумма)) КАК ПродажиНДС0,
	|	РеализацияКлассификация.НалоговаяБазаДокументаОтгрузки КАК НалоговаяБазаДокументаОтгрузки,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РеализацияКлассификация.Номенклатура.Операции0, ЗНАЧЕНИЕ(Справочник.Операции0.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Операции0.ПустаяСсылка)
	|			ТОГДА РеализацияКлассификация.Номенклатура.Операции0.Код
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РеализацияКлассификация.ТабличныеЧастиДокументов = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Товары)
	|						И ЕСТЬNULL(РеализацияКлассификация.Номенклатура.Услуга, ЛОЖЬ) = ЛОЖЬ
	|						И ЕСТЬNULL(РеализацияКлассификация.Номенклатура.КодТНВЭД.СырьевойТовар, ЛОЖЬ) = ИСТИНА
	|					ТОГДА ""РеализацияСырьевыхВДругиеСтраны""
	|				КОГДА РеализацияКлассификация.ТабличныеЧастиДокументов = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Товары)
	|						И ЕСТЬNULL(РеализацияКлассификация.Номенклатура.Услуга, ЛОЖЬ) = ЛОЖЬ
	|						И ЕСТЬNULL(РеализацияКлассификация.Номенклатура.КодТНВЭД.СырьевойТовар, ЛОЖЬ) = ЛОЖЬ
	|					ТОГДА ""НеСырьевыеТоварыВДругиеСтраныОбщаяСтавкаНДС""
	|				ИНАЧЕ ""ОперацииНДС0""
	|			КОНЕЦ
	|	КОНЕЦ КАК Классификация,
	|	РеализацияКлассификация.ДокументОтгрузки КАК ДокументОтгрузки
	|ПОМЕСТИТЬ ОтгрузкиДляОпределенияОфшоровИВзаимозависимости
	|ИЗ
	|	РеализацияКлассификация КАК РеализацияКлассификация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РублевыеСуммыДокументовВВалюте КАК РублевыеСуммыДокументовВВалюте
	|		ПО РеализацияКлассификация.ДокументОтгрузки = РублевыеСуммыДокументовВВалюте.Регистратор
	|			И РеализацияКлассификация.ТабличныеЧастиДокументов = РублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента
	|			И РеализацияКлассификация.НомерСтроки = РублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияКлассификация.Покупатель,
	|	РеализацияКлассификация.СтранаРегистрации,
	|	РеализацияКлассификация.СтранаРеализации,
	|	РеализацияКлассификация.НалоговаяБазаДокументаОтгрузки,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РеализацияКлассификация.Номенклатура.Операции0, ЗНАЧЕНИЕ(Справочник.Операции0.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Операции0.ПустаяСсылка)
	|			ТОГДА РеализацияКлассификация.Номенклатура.Операции0.Код
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РеализацияКлассификация.ТабличныеЧастиДокументов = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Товары)
	|						И ЕСТЬNULL(РеализацияКлассификация.Номенклатура.Услуга, ЛОЖЬ) = ЛОЖЬ
	|						И ЕСТЬNULL(РеализацияКлассификация.Номенклатура.КодТНВЭД.СырьевойТовар, ЛОЖЬ) = ИСТИНА
	|					ТОГДА ""РеализацияСырьевыхВДругиеСтраны""
	|				КОГДА РеализацияКлассификация.ТабличныеЧастиДокументов = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Товары)
	|						И ЕСТЬNULL(РеализацияКлассификация.Номенклатура.Услуга, ЛОЖЬ) = ЛОЖЬ
	|						И ЕСТЬNULL(РеализацияКлассификация.Номенклатура.КодТНВЭД.СырьевойТовар, ЛОЖЬ) = ЛОЖЬ
	|					ТОГДА ""НеСырьевыеТоварыВДругиеСтраныОбщаяСтавкаНДС""
	|				ИНАЧЕ ""ОперацииНДС0""
	|			КОНЕЦ
	|	КОНЕЦ,
	|	РеализацияКлассификация.ДокументОтгрузки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтчетКомиссионераКлассификация.Покупатель,
	|	ОтчетКомиссионераКлассификация.СтранаРегистрации,
	|	ОтчетКомиссионераКлассификация.СтранаРеализации,
	|	СУММА(ЕСТЬNULL(РублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС, ОтчетКомиссионераКлассификация.Сумма)),
	|	ОтчетКомиссионераКлассификация.НалоговаяБазаДокументаОтгрузки,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОтчетКомиссионераКлассификация.Номенклатура.Операции0, ЗНАЧЕНИЕ(Справочник.Операции0.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Операции0.ПустаяСсылка)
	|			ТОГДА ОтчетКомиссионераКлассификация.Номенклатура.Операции0.Код
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ОтчетКомиссионераКлассификация.ТабличныеЧастиДокументов = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Товары)
	|						И ЕСТЬNULL(ОтчетКомиссионераКлассификация.Номенклатура.Услуга, ЛОЖЬ) = ЛОЖЬ
	|						И ЕСТЬNULL(ОтчетКомиссионераКлассификация.Номенклатура.КодТНВЭД.СырьевойТовар, ЛОЖЬ) = ИСТИНА
	|					ТОГДА ""РеализацияСырьевыхВДругиеСтраны""
	|				КОГДА ОтчетКомиссионераКлассификация.ТабличныеЧастиДокументов = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Товары)
	|						И ЕСТЬNULL(ОтчетКомиссионераКлассификация.Номенклатура.Услуга, ЛОЖЬ) = ЛОЖЬ
	|						И ЕСТЬNULL(ОтчетКомиссионераКлассификация.Номенклатура.КодТНВЭД.СырьевойТовар, ЛОЖЬ) = ЛОЖЬ
	|					ТОГДА ""НеСырьевыеТоварыВДругиеСтраныОбщаяСтавкаНДС""
	|				ИНАЧЕ ""ОперацииНДС0""
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ОтчетКомиссионераКлассификация.ДокументОтгрузки
	|ИЗ
	|	ОтчетКомиссионераКлассификация КАК ОтчетКомиссионераКлассификация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РублевыеСуммыДокументовВВалюте КАК РублевыеСуммыДокументовВВалюте
	|		ПО ОтчетКомиссионераКлассификация.ДокументОснование = РублевыеСуммыДокументовВВалюте.Регистратор
	|			И ОтчетКомиссионераКлассификация.ТабличныеЧастиДокументов = РублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента
	|			И ОтчетКомиссионераКлассификация.НомерСтроки = РублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтчетКомиссионераКлассификация.Покупатель,
	|	ОтчетКомиссионераКлассификация.СтранаРегистрации,
	|	ОтчетКомиссионераКлассификация.СтранаРеализации,
	|	ОтчетКомиссионераКлассификация.НалоговаяБазаДокументаОтгрузки,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОтчетКомиссионераКлассификация.Номенклатура.Операции0, ЗНАЧЕНИЕ(Справочник.Операции0.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Операции0.ПустаяСсылка)
	|			ТОГДА ОтчетКомиссионераКлассификация.Номенклатура.Операции0.Код
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ОтчетКомиссионераКлассификация.ТабличныеЧастиДокументов = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Товары)
	|						И ЕСТЬNULL(ОтчетКомиссионераКлассификация.Номенклатура.Услуга, ЛОЖЬ) = ЛОЖЬ
	|						И ЕСТЬNULL(ОтчетКомиссионераКлассификация.Номенклатура.КодТНВЭД.СырьевойТовар, ЛОЖЬ) = ИСТИНА
	|					ТОГДА ""РеализацияСырьевыхВДругиеСтраны""
	|				КОГДА ОтчетКомиссионераКлассификация.ТабличныеЧастиДокументов = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Товары)
	|						И ЕСТЬNULL(ОтчетКомиссионераКлассификация.Номенклатура.Услуга, ЛОЖЬ) = ЛОЖЬ
	|						И ЕСТЬNULL(ОтчетКомиссионераКлассификация.Номенклатура.КодТНВЭД.СырьевойТовар, ЛОЖЬ) = ЛОЖЬ
	|					ТОГДА ""НеСырьевыеТоварыВДругиеСтраныОбщаяСтавкаНДС""
	|				ИНАЧЕ ""ОперацииНДС0""
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ОтчетКомиссионераКлассификация.ДокументОтгрузки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АктОбОказанииПроизводственныхУслугКлассификация.Покупатель,
	|	АктОбОказанииПроизводственныхУслугКлассификация.СтранаРегистрации,
	|	АктОбОказанииПроизводственныхУслугКлассификация.СтранаРеализации,
	|	СУММА(ЕСТЬNULL(РублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС, АктОбОказанииПроизводственныхУслугКлассификация.Сумма)),
	|	АктОбОказанииПроизводственныхУслугКлассификация.НалоговаяБазаДокументаОтгрузки,
	|	ЕСТЬNULL(АктОбОказанииПроизводственныхУслугКлассификация.Номенклатура.Операции0.Код, ""ОперацииНДС0""),
	|	АктОбОказанииПроизводственныхУслугКлассификация.ДокументОтгрузки
	|ИЗ
	|	АктОбОказанииПроизводственныхУслугКлассификация КАК АктОбОказанииПроизводственныхУслугКлассификация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РублевыеСуммыДокументовВВалюте КАК РублевыеСуммыДокументовВВалюте
	|		ПО АктОбОказанииПроизводственныхУслугКлассификация.ДокументОтгрузки = РублевыеСуммыДокументовВВалюте.Регистратор
	|			И АктОбОказанииПроизводственныхУслугКлассификация.ТабличныеЧастиДокументов = РублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента
	|			И АктОбОказанииПроизводственныхУслугКлассификация.НомерСтроки = РублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента
	|
	|СГРУППИРОВАТЬ ПО
	|	АктОбОказанииПроизводственныхУслугКлассификация.Покупатель,
	|	АктОбОказанииПроизводственныхУслугКлассификация.СтранаРегистрации,
	|	АктОбОказанииПроизводственныхУслугКлассификация.СтранаРеализации,
	|	АктОбОказанииПроизводственныхУслугКлассификация.НалоговаяБазаДокументаОтгрузки,
	|	ЕСТЬNULL(АктОбОказанииПроизводственныхУслугКлассификация.Номенклатура.Операции0.Код, ""ОперацииНДС0""),
	|	АктОбОказанииПроизводственныхУслугКлассификация.ДокументОтгрузки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтгрузкиСЕдинойКлассификацией.Покупатель,
	|	ОтгрузкиСЕдинойКлассификацией.СтранаРегистрации,
	|	ОтгрузкиСЕдинойКлассификацией.СтранаРеализации,
	|	ОтгрузкиСЕдинойКлассификацией.ПродажиСНДС0,
	|	ОтгрузкиСЕдинойКлассификацией.НалоговаяБазаДокументаОтгрузки,
	|	ОтгрузкиСЕдинойКлассификацией.Классификация,
	|	ОтгрузкиСЕдинойКлассификацией.ДокументОтгрузки
	|ИЗ
	|	ОтгрузкиСЕдинойКлассификацией КАК ОтгрузкиСЕдинойКлассификацией
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОказаниеУслугСЕдинойКлассификацией.Покупатель,
	|	ОказаниеУслугСЕдинойКлассификацией.СтранаРегистрации,
	|	ОказаниеУслугСЕдинойКлассификацией.СтранаРеализации,
	|	ОказаниеУслугСЕдинойКлассификацией.ПродажиНДС0,
	|	ОказаниеУслугСЕдинойКлассификацией.НалоговаяБазаДокументаОтгрузки,
	|	ОказаниеУслугСЕдинойКлассификацией.Классификация,
	|	ОказаниеУслугСЕдинойКлассификацией.ДокументОтгрузки
	|ИЗ
	|	ОказаниеУслугСЕдинойКлассификацией КАК ОказаниеУслугСЕдинойКлассификацией
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РОТКлассификацияНалоговаяБаза.Покупатель,
	|	РОТКлассификацияНалоговаяБаза.СтранаРегистрации,
	|	РОТКлассификацияНалоговаяБаза.СтранаРеализации,
	|	РОТКлассификацияНалоговаяБаза.ПродажиНДС0,
	|	РОТКлассификацияНалоговаяБаза.НалоговаяБазаДокументаОтгрузки,
	|	РОТКлассификацияНалоговаяБаза.Классификация,
	|	РОТКлассификацияНалоговаяБаза.ДокументОтгрузки
	|ИЗ
	|	РОТКлассификацияНалоговаяБаза КАК РОТКлассификацияНалоговаяБаза
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Покупатель,
	|	СтранаРегистрации,
	|	СтранаРеализации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ РеализацияКлассификация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОтчетКомиссионераКлассификация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ АктОбОказанииПроизводственныхУслугКлассификация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОтгрузкиСЕдинойКлассификацией
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОказаниеУслугСЕдинойКлассификацией
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ РОТКлассификацияНалоговаяБаза
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтгрузкиДляОпределенияОфшоровИВзаимозависимости.Классификация КАК Классификация,
	|	ВЫБОР
	|		КОГДА ОтгрузкиДляОпределенияОфшоровИВзаимозависимости.СтранаРегистрации В (&Офшоры)
	|			ТОГДА ""Да""
	|		ИНАЧЕ ""Нет""
	|	КОНЕЦ КАК КонтрагентИЗОфшора,
	|	%1 КАК КонтрагентВзаимозависимоеЛицо,
	|	ВЫБОР
	|		КОГДА ОтгрузкиДляОпределенияОфшоровИВзаимозависимости.СтранаРеализации <> &РФ
	|				И ОтгрузкиДляОпределенияОфшоровИВзаимозависимости.СтранаРеализации В (&СтраныЕАЭС)
	|			ТОГДА ""ЕАЭС""
	|		КОГДА ОтгрузкиДляОпределенияОфшоровИВзаимозависимости.СтранаРеализации <> &РФ
	|				И НЕ ОтгрузкиДляОпределенияОфшоровИВзаимозависимости.СтранаРеализации В (&СтраныЕАЭС)
	|			ТОГДА ""За пределами ЕАЭС""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК СтранаРеализацииЕАЭСЗаПределамиЕАЭС,
	|	ВЫБОР
	|		КОГДА ОтгрузкиДляОпределенияОфшоровИВзаимозависимости.СтранаРеализации <> &РФ
	|			ТОГДА ""За пределами РФ""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК СтранаРеализацииЗаПределамиРФ,
	|	ОтгрузкиДляОпределенияОфшоровИВзаимозависимости.ДокументОтгрузки КАК ДокументОтгрузки,
	|	ОтгрузкиДляОпределенияОфшоровИВзаимозависимости.Покупатель КАК Покупатель,
	|	ОтгрузкиДляОпределенияОфшоровИВзаимозависимости.ПродажиНДС0 КАК ПродажиСНДС0,
	|	ОтгрузкиДляОпределенияОфшоровИВзаимозависимости.НалоговаяБазаДокументаОтгрузки КАК НалоговаяБазаДокументаОтгрузки
	|ПОМЕСТИТЬ ОтгрузкиДляОпределенияКодовОпераций
	|ИЗ
	|	ОтгрузкиДляОпределенияОфшоровИВзаимозависимости КАК ОтгрузкиДляОпределенияОфшоровИВзаимозависимости
	|	%2
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УслугиГостиниц.Классификация,
	|	УслугиГостиниц.КонтрагентИЗОфшора,
	|	УслугиГостиниц.КонтрагентВзаимозависимоеЛицо,
	|	УслугиГостиниц.СтранаРеализацииЕАЭСЗаПределамиЕАЭС,
	|	УслугиГостиниц.СтранаРеализацииЗаПределамиРФ,
	|	УслугиГостиниц.ДокументОтгрузки,
	|	УслугиГостиниц.Покупатель,
	|	УслугиГостиниц.ПродажиСНДС0,
	|	УслугиГостиниц.НалоговаяБазаДокументаОтгрузки
	|ИЗ
	|	УслугиГостиниц КАК УслугиГостиниц
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Классификация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОтгрузкиДляОпределенияОфшоровИВзаимозависимости
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ УслугиГостиниц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаКодовОпераций0.Код КАК Код,
	|	ТаблицаКодовОпераций0.ДатаНачала КАК ДатаНачала,
	|	ТаблицаКодовОпераций0.ДатаОкончания КАК ДатаОкончания,
	|	ТаблицаКодовОпераций0.Классификация КАК Классификация,
	|	ТаблицаКодовОпераций0.КонтрагентИЗОфшора КАК КонтрагентИЗОфшора,
	|	ТаблицаКодовОпераций0.КонтрагентВзаимозависимоеЛицо КАК КонтрагентВзаимозависимоеЛицо,
	|	ТаблицаКодовОпераций0.СтранаРеализации КАК СтранаРеализации,
	|	ТаблицаКодовОпераций0.НесырьевыеТовары КАК НесырьевыеТовары,
	|	ТаблицаКодовОпераций0.СырьевыеТовары КАК СырьевыеТовары
	|ПОМЕСТИТЬ КодыОпераций0
	|ИЗ
	|	&ТаблицаКодовОпераций0 КАК ТаблицаКодовОпераций0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Классификация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтгрузкиДляОпределенияКодовОпераций.ДокументОтгрузки КАК ДокументОтгрузки,
	|	ЕСТЬNULL(КодыОпераций0.Код, &КодОперацииПоУмолчанию) КАК Код,
	|	ЕСТЬNULL(КодыОпераций0.НесырьевыеТовары, ИСТИНА) КАК НесырьевыеТовары,
	|	ЕСТЬNULL(КодыОпераций0.СырьевыеТовары, ИСТИНА) КАК СырьевыеТовары,
	|	СУММА(ОтгрузкиДляОпределенияКодовОпераций.ПродажиСНДС0) КАК НалоговаяБазаКодаОперации,
	|	ОтгрузкиДляОпределенияКодовОпераций.Покупатель КАК Покупатель,
	|	ОтгрузкиДляОпределенияКодовОпераций.НалоговаяБазаДокументаОтгрузки КАК НалоговаяБазаДокументаОтгрузки
	|ИЗ
	|	ОтгрузкиДляОпределенияКодовОпераций КАК ОтгрузкиДляОпределенияКодовОпераций
	|		ЛЕВОЕ СОЕДИНЕНИЕ КодыОпераций0 КАК КодыОпераций0
	|		ПО ОтгрузкиДляОпределенияКодовОпераций.Классификация = КодыОпераций0.Классификация
	|			И (КодыОпераций0.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|					И КодыОпераций0.ДатаНачала <= &ДатаЗапроса
	|				ИЛИ &ДатаЗапроса МЕЖДУ КодыОпераций0.ДатаНачала И КодыОпераций0.ДатаОкончания)
	|			И (КодыОпераций0.КонтрагентИЗОфшора В ("""", ОтгрузкиДляОпределенияКодовОпераций.КонтрагентИЗОфшора))
	|			И (КодыОпераций0.КонтрагентВзаимозависимоеЛицо В ("""", ОтгрузкиДляОпределенияКодовОпераций.КонтрагентВзаимозависимоеЛицо))
	|			И (КодыОпераций0.СтранаРеализации В ("""", ОтгрузкиДляОпределенияКодовОпераций.СтранаРеализацииЕАЭСЗаПределамиЕАЭС, ОтгрузкиДляОпределенияКодовОпераций.СтранаРеализацииЗаПределамиРФ))
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтгрузкиДляОпределенияКодовОпераций.ДокументОтгрузки,
	|	ОтгрузкиДляОпределенияКодовОпераций.Покупатель,
	|	ОтгрузкиДляОпределенияКодовОпераций.НалоговаяБазаДокументаОтгрузки,
	|	ЕСТЬNULL(КодыОпераций0.Код, &КодОперацииПоУмолчанию),
	|	ЕСТЬNULL(КодыОпераций0.НесырьевыеТовары, ИСТИНА),
	|	ЕСТЬNULL(КодыОпераций0.СырьевыеТовары, ИСТИНА)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтгрузкиСКодомПоУмолчанию.ДокументОтгрузки,
	|	ОтгрузкиСКодомПоУмолчанию.Код,
	|	ОтгрузкиСКодомПоУмолчанию.НесырьевыеТовары,
	|	ОтгрузкиСКодомПоУмолчанию.СырьевыеТовары,
	|	ОтгрузкиСКодомПоУмолчанию.НалоговаяБазаКодаОперации,
	|	ОтгрузкиСКодомПоУмолчанию.Покупатель,
	|	ОтгрузкиСКодомПоУмолчанию.НалоговаяБазаДокументаОтгрузки
	|ИЗ
	|	ОтгрузкиСКодомПоУмолчанию КАК ОтгрузкиСКодомПоУмолчанию
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументОтгрузки,
	|	Покупатель,
	|	Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОтгрузкиДляОпределенияКодовОпераций
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ КодыОпераций0", ТипВзаимозависимости, ЛевоеСоединение);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция СтраныЕАЭС()
	
	СтраныЕАЭС = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтраныМира.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтраныМира КАК СтраныМира
	|ГДЕ
	|	СтраныМира.УчастникЕАЭС";
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтраныЕАЭС.Добавить(Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;
	
	Возврат СтраныЕАЭС;
	
КонецФункции


#КонецЕсли