
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
    	Возврат;
    КонецЕсли;
	
	ТарификацияБП.КонстантаИспользуемойСистемыНалогообложенияПриЗаписи(Метаданные().Имя, Значение, Отказ);
	
	Если Значение И Не Отказ Тогда
		Справочники.ВидыНоменклатуры.СоздатьЭлементыУслугаЕНВД();
		КлассификаторыДоходовРасходов.ОбеспечитьФункциональность(Справочники.СтатьиЗатрат, "ИспользуетсяЕНВД");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли