
#Область СлужебныйПрограммныйИнтерфейс

Функция НовыеСвойстваФайла() Экспорт
	
	СвойстваФайла = Новый Структура;
	СвойстваФайла.Вставить("Имя", "");
	СвойстваФайла.Вставить("Расширение", "");
	СвойстваФайла.Вставить("Хранение", "");
	СвойстваФайла.Вставить("ДвоичныеДанные");
	Возврат СвойстваФайла;
	
КонецФункции

Функция ПоддерживаемыеРасширения() Экспорт
	
	Расширения = Новый Массив;
	Расширения.Добавить("zip");
	Расширения.Добавить("csv");
	Расширения.Добавить("xls");
	Расширения.Добавить("xlsx");
	Возврат Расширения;
	
КонецФункции

Функция ЭтоZipАрхив(Расширение) Экспорт
	
	Возврат Расширение = "zip";
	
КонецФункции

Функция РасширениеТекстовогоФайла() Экспорт
	
	Возврат "csv";
	
КонецФункции

Функция ОбработатьПожеланиеДляЗаписи(Пожелание) Экспорт
	
	СтрокиПожелания = СтрРазделить(Пожелание, " ");
	ОбработанныеСтроки = Новый Массив;
	Для Каждого Строка Из СтрокиПожелания Цикл
		ДлинаСтроки = СтрДлина(Строка);
		Строка = ТРег(Строка);
		ПромежуточныеДанные = Новый Массив;
		Для Сч = 1 По ДлинаСтроки Цикл
			ПроверяемыйСимвол = Сред(Строка, Сч, 1);
			Если СтроковыеФункцииКлиентСерверРФ.ТолькоКириллицаВСтроке(ПроверяемыйСимвол)
				Или СтроковыеФункцииКлиентСервер.ТолькоЛатиницаВСтроке(ПроверяемыйСимвол)
				Или СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ПроверяемыйСимвол) Тогда
				ПромежуточныеДанные.Добавить(ПроверяемыйСимвол);
			КонецЕсли;
		КонецЦикла;
		Если ЗначениеЗаполнено(ПромежуточныеДанные) Тогда
			ОбработанныеСтроки.Добавить(СтрСоединить(ПромежуточныеДанные));
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтрСоединить(ОбработанныеСтроки);
	
КонецФункции

#КонецОбласти