#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьНумерациюДоговоровСПокупателямиПриИзменении(Элемент)
	СохранитьЗначениеКонстанты("ИспользоватьНумерациюДоговоровСПокупателями");
	Оповестить("Запись_ИспользоватьНумерациюДоговоровСПокупателями");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СохранитьЗначениеКонстанты(ИмяКонстанты)
	
	КонстантаМенеджер = Константы[ИмяКонстанты];
	КонстантаЗначение = НаборКонстант[ИмяКонстанты];
	
	Если КонстантаМенеджер.Получить() <> КонстантаЗначение Тогда
		КонстантаМенеджер.Установить(КонстантаЗначение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
