#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает ИСТИНА, если вид дохода иностранной организации не облагается налогом в РФ, ЛОЖЬ - в ином случае. 
//
// Параметры:
//   ВидДохода - ПеречислениеСсылка.ВидыДоходовИностранныхОрганизаций.
//
// Возвращаемое значение:
//   Булево - признак облагаемости налогом.
Функция ЭтоНеОблагаемыйНалогомВидДохода(ВидДохода) Экспорт
	
	Результат = (ВидДохода = ДоходыТовары)
	ИЛИ (ВидДохода = ДоходыИноеИмуществоНеОблагаемые)
	ИЛИ (ВидДохода = ДоходыИмущественныеПраваНеОблагаемые)
	ИЛИ (ВидДохода = ДоходыУслугиНеОблагаемые)
	ИЛИ (ВидДохода = ДоходыОблигацииНеОблагаемые)
	ИЛИ (ВидДохода = ДоходыВПределахВкладаАкционера)
	ИЛИ (ВидДохода = ИныеДоходыНеОблагаемые);	
	
	Возврат Результат;

КонецФункции

Функция КодВидаДохода(ВидДохода) Экспорт
	
	Возврат Лев(ВидДохода, 2);
	
КонецФункции

#КонецОбласти

#КонецЕсли