#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Ключ аналитики базы распределения.
// 
// Возвращаемое значение:
//  Строка - Состоит из имен измерений регистра, перечисленных через запятую.
//
Функция КлючАналитикиБазыРаспределения() Экспорт 
	
	// Соответствует фактическому ключу регистра РасчетБазыРаспределенияКосвенныхЗатрат
	
	Возврат "СчетВыпуска, Подразделение, НоменклатурнаяГруппа, СтатьяЗатрат, Продукция";
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли