#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет виды налогообложения деятельности организации в конкретном периоде (месяце)
//
// Параметры:
//  Период     - Дата - характеризует проверяемый месяц
//  Организация - СправочникСсылка.Организации - налогоплательщик
// 
// Возвращаемое значение:
//  Массив Из ПеречислениеСсылка.ВидыДеятельностиДляНалоговогоУчетаЗатрат
//
Функция ПрименяемыеВидыДеятельности(Период, Организация) Экспорт
	
	ВидыДеятельности = Новый Массив;
	
	Если Не УчетнаяПолитика.ТолькоОсновнаяСистемаНалогообложения(Организация, Период) Тогда
		ВидыДеятельности.Добавить(ОсобыйПорядокНалогообложения);
	КонецЕсли;
	Если Не УчетнаяПолитика.ТолькоОсобыйПорядокНалогообложения(Организация, Период) Тогда
		ВидыДеятельности.Добавить(ОсновнаяСистемаНалогообложения);
	КонецЕсли;
	
	Возврат ВидыДеятельности;
	
КонецФункции

#КонецОбласти

#КонецЕсли
