
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОткрытьФорму("Обработка.ПомощникУплатыНПД.Форма", ПараметрыПомощника());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПараметрыПомощника()
	
	ПараметрыПомощника = Новый Структура;
	ПараметрыПомощника.Вставить("КонтекстныйВызов", Ложь);
	
	ОсновнаяОрганизация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
	Если ЗначениеЗаполнено(ОсновнаяОрганизация)
		И Не ОбщегоНазначенияБПВызовСервераПовтИсп.ЭтоЮрЛицо(ОсновнаяОрганизация) Тогда
		ПараметрыПомощника.Вставить("Организация", ОсновнаяОрганизация);
	КонецЕсли;
	
	Возврат ПараметрыПомощника;
	
КонецФункции

#КонецОбласти
