


&НаКлиенте
Процедура Готово(Команда)
	Результат = Новый СписокЗначений;
	
	Для каждого КлючИЗначение Из СписокЗначенийРеквизитов Цикл
		Результат.Добавить(КлючИЗначение.Значение, КлючИЗначение.Представление);
	КонецЦикла; 
	
	Закрыть(Результат);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Параметры.Свойство("СписокЗначений") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли; 
	
	Если ТипЗнч(Параметры.СписокЗначений) = Тип("СписокЗначений") Тогда
		Для каждого КлючИЗначение Из Параметры.СписокЗначений Цикл
			ЗаполнитьЗначенияСвойств(СписокЗначенийРеквизитов.Добавить(), КлючИЗначение);
		КонецЦикла; 
	КонецЕсли; 
КонецПроцедуры


