#Область СлужебныйПрограммныйИнтерфейс

#Область Системные

Асинх Процедура ПодключаемоеОборудование_ПроверкаКМ() Экспорт
	
	КонтекстОперации = Неопределено;
	МенеджерОборудованияМаркировкаКлиент.ВосстановитьКонтекстОперации(КонтекстОперации);
	
	Операция = КонтекстОперации.Операции[0];
	СписокОпераций = КонтекстОперации.СписокОпераций;
	
	Если Операция = СписокОпераций.ЗапросОИСМ Тогда
		МенеджерОборудованияМаркировкаКлиент.ПроверкаКМ(КонтекстОперации);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти