///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "ИнтернетПоддержкаПользователей.СистемаБыстрыхПлатежей.ПереводыСБПc2b".
// ОбщийМодуль.ИнтеграцияСПлатежнымиСистемамиКлиентСервер.
//
// Устаревшие Клиент-серверные процедуры и функции.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область УстаревшиеПроцедурыИФункции

// Устарела. Следует использовать СистемаБыстрыхПлатежейКлиентСервер.СтатусОперацииВыполнена.
//
Функция СтатусОперацииВыполнена() Экспорт
	
	Возврат СистемаБыстрыхПлатежейКлиентСервер.СтатусОперацииВыполнена();
	
КонецФункции

// Устарела. Следует использовать СистемаБыстрыхПлатежейКлиентСервер.СтатусОперацииВыполняется.
//
Функция СтатусОперацииВыполняется() Экспорт
	
	Возврат СистемаБыстрыхПлатежейКлиентСервер.СтатусОперацииВыполняется();
	
КонецФункции

// Устарела. Следует использовать СистемаБыстрыхПлатежейКлиентСервер.СтатусОперацииОтменена.
//
Функция СтатусОперацииОтменена() Экспорт
	
	Возврат СистемаБыстрыхПлатежейКлиентСервер.СтатусОперацииОтменена();
	
КонецФункции

// Устарела. Следует использовать СистемаБыстрыхПлатежейКлиентСервер.СтатусОперацииОшибка.
//
Функция СтатусОперацииОшибка() Экспорт
	
	Возврат СистемаБыстрыхПлатежейКлиентСервер.СтатусОперацииОшибка();
	
КонецФункции

// Устарела. Следует использовать СистемаБыстрыхПлатежейКлиентСервер.СтатусОперацииТребуетсяПодтверждение.
//
Функция СтатусОперацииТребуетсяПодтверждение() Экспорт
	
	Возврат СистемаБыстрыхПлатежейКлиентСервер.СтатусОперацииТребуетсяПодтверждение();
	
КонецФункции

// Устарела. Следует использовать ПереводыСБПc2bКлиентСервер.ФункциональнаяСсылкаNFC.
//
Функция ФункциональнаяСсылкаNFC(ФункциональнаяСсылка) Экспорт
	
	Возврат ПереводыСБПc2bКлиентСервер.ФункциональнаяСсылкаNFC(ФункциональнаяСсылка);
	
КонецФункции

#КонецОбласти

#КонецОбласти
