
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыОткрытия = ОбщегоНазначенияБПКлиентСервер.ПараметрыОткрытияФормыСОжиданием(ПараметрыВыполненияКоманды);
	ПараметрыОткрытия.Заголовок = НСтр("ru = 'Изменение условий аренды'");
	ПараметрыОткрытия.ИмяФормы = "Документ.ИзменениеУсловийАренды.ФормаСписка";
	ПараметрыОткрытия.Уникальность = "ФормаСписка_ИзменениеУсловийАренды";
	ПараметрыОткрытия.ЗамерПроизводительности = "СозданиеФормыСпискаИзменениеУсловийАренды";
	
	Отбор = Новый Структура;
	Отбор.Вставить("ВидОперации", 
		ПредопределенноеЗначение("Перечисление.ВидыОперацийИзменениеУсловийАренды.ИзменениеУсловийАренды"));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", ПараметрыОткрытия.Заголовок);
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	ОбщегоНазначенияБПКлиент.ОткрытьФормуСОжиданием(ПараметрыОткрытия, ПараметрыФормы);
	
КонецПроцедуры
