
#Область СлужебныйПрограммныйИнтерфейс

Процедура ОповеститьОЗаписиПлатежаНаУплатуНалога(ДанныеОбъекта, ДокументОплачен) Экспорт
	
	ПараметрыНалога = Новый Структура;
	ПараметрыНалога.Вставить("Организация",       ДанныеОбъекта.Организация);
	ПараметрыНалога.Вставить("Налог",             ДанныеОбъекта.Налог);
	ПараметрыНалога.Вставить("ДокументОснование", ДанныеОбъекта.ДокументОснование);
	ПараметрыНалога.Вставить("ПоказательПериода", ДанныеОбъекта.ПоказательПериода);
	ПараметрыНалога.Вставить("КБК",               ДанныеОбъекта.КодБК);
	ПараметрыНалога.Вставить("ОКАТО",             ДанныеОбъекта.КодОКАТО);
	ПараметрыНалога.Вставить("Ссылка",            ДанныеОбъекта.Ссылка);
	ПараметрыНалога.Вставить("Оплачено",          ДокументОплачен);
	ПараметрыНалога.Вставить("Сумма",             ДанныеОбъекта.СуммаДокумента);
	Оповестить("Запись_ПлатежныйДокумент_УплатаНалогов", ПараметрыНалога);
	
КонецПроцедуры

#КонецОбласти