#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЕстьПравоПросмотрСчетПокупателю = ПравоДоступа("Просмотр", Метаданные.Документы.СчетНаОплатуПокупателю);
	ЕстьПравоПросмотрРеализацияТоваровУслуг = ПравоДоступа("Просмотр", Метаданные.Документы.РеализацияТоваровУслуг);
	ЕстьПравоПросмотрСчетФактураВыданный = ПравоДоступа("Просмотр", Метаданные.Документы.СчетФактураВыданный);
	ЕстьПравоПросмотрКорректировкаРеализации = ПравоДоступа("Просмотр", Метаданные.Документы.КорректировкаРеализации);
	ЕстьПравоПросмотрВозвратТоваровОтПокупателя =
		ПравоДоступа("Просмотр", Метаданные.Документы.ВозвратТоваровОтПокупателя);
	ЕстьПравоПросмотрРозничныеПродажи = ПравоДоступа("Просмотр", Метаданные.ЖурналыДокументов.РозничныеПродажи);
	ЕстьПравоИспользованиеОжидаемаяОплатаОтПокупателей =
		ПравоДоступа("Использование", Метаданные.Обработки.ОжидаемаяОплатаОтПокупателей); 
	ЕстьПравоПросмотрКоммерческоеПредложение = ПравоДоступа("Просмотр", Метаданные.Документы.КоммерческоеПредложение);
	ЕстьПравоПросмотрАктОРасхожденияхПолученный = ПравоДоступа("Просмотр",
		Метаданные.Документы.АктОРасхожденияхПолученный);
	
	Элементы.СчетаПокупателям.Видимость = ЕстьПравоПросмотрСчетПокупателю;
	Элементы.Реализация.Видимость = ЕстьПравоПросмотрРеализацияТоваровУслуг;
	Элементы.СчетаФактурыВыданные.Видимость = ЕстьПравоПросмотрСчетФактураВыданный;
	Элементы.КорректировкаРеализации.Видимость = ЕстьПравоПросмотрКорректировкаРеализации;
	Элементы.ВозвратыОтПокупателей.Видимость = ЕстьПравоПросмотрВозвратТоваровОтПокупателя;
	Элементы.РозничныеПродажи.Видимость = ЕстьПравоПросмотрРозничныеПродажи;
	Элементы.ВсеНеоплаченныеСчета.Видимость = ЕстьПравоИспользованиеОжидаемаяОплатаОтПокупателей;
	Элементы.КоммерческиеПредложения.Видимость = ЕстьПравоПросмотрКоммерческоеПредложение;
	Элементы.АктыОРасхожденияхПолученные.Видимость = ЕстьПравоПросмотрАктОРасхожденияхПолученный;
	
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура СчетаПокупателям(Команда)
	
	ОткрытьФормуВОкнеФормы("Документ.СчетНаОплатуПокупателю.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура Реализация(Команда)
	
	ОткрытьФормуВОкнеФормы("Документ.РеализацияТоваровУслуг.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура СчетаФактурыВыданные(Команда)
	
	ОткрытьФормуВОкнеФормы("Документ.СчетФактураВыданный.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаРеализации(Команда)
	
	ОткрытьФормуВОкнеФормы("Документ.КорректировкаРеализации.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ВозвратыОтПокупателей(Команда)
	
	ОткрытьФормуВОкнеФормы("Документ.ВозвратТоваровОтПокупателя.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура РозничныеПродажи(Команда)
	
	ОткрытьФормуВОкнеФормы("ЖурналДокументов.РозничныеПродажи.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ВсеНеоплаченныеСчета(Команда)
	
	ОткрытьФормуВОкнеФормы("Обработка.ОжидаемаяОплатаОтПокупателей.Форма");
	
КонецПроцедуры

&НаКлиенте
Процедура КоммерческиеПредложения(Команда)
	
	ОткрытьФормуВОкнеФормы("Документ.КоммерческоеПредложение.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура АктыОРасхожденияхПолученные(Команда)
	
	ОткрытьФормуВОкнеФормы("Документ.АктОРасхожденияхПолученный.ФормаСписка");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьФормуВОкнеФормы(ИмяФормы)
	
	ОткрытьФорму(ИмяФормы, , ЭтотОбъект, ИмяФормы, Окно);
	
КонецПроцедуры

#КонецОбласти