#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Процедура ЗаписатьИдентификаторМаркетплейса(Номенклатура, Маркетплейс, ИдентификаторМаркетплейса) Экспорт
	
	Если НЕ (ЗначениеЗаполнено(ИдентификаторМаркетплейса)
		И ЗначениеЗаполнено(Маркетплейс)) Тогда
		Возврат;
	КонецЕсли;

	МенеджерЗаписи              = РегистрыСведений.НоменклатураМаркетплейсов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Номенклатура = Номенклатура;
	МенеджерЗаписи.Маркетплейс  = Маркетплейс;
	МенеджерЗаписи.ИдентификаторТовара = ИдентификаторМаркетплейса;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли

	