#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		
#Область ПрограммныйИнтерфейс

// Возвращает идентификатор статуса документа сервиса Автоматизированная УСН
//
// Параметры:
//  Статус - ПеречислениеСссылка.СтатусыДокументовАУСН
//
// Возвращаемое значение:
//  Строка - строковый идентификатор статуса, указанного в параметре
//
Функция Идентификатор(Статус) Экспорт
	
	Если Не ЗначениеЗаполнено(Статус) Тогда
		Возврат "";
	КонецЕсли;
	
	Статусы = ВсеСтатусы();
	Возврат Статусы[Статус];
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВсеСтатусы()
	
	Статусы = Новый Соответствие;
	Статусы.Вставить(ОтправленоВБанк, "SENT_TO_BANK");
	Статусы.Вставить(ДоставленоВБанк, "DELIVERED_TO_BANK");
	Статусы.Вставить(ОбрабатываетсяБанком, "IN_PROCESSING_BY_BANK");
	Статусы.Вставить(ОбработаноБанком, "PROCESSED_BY_BANK_SUCCESS");
	Статусы.Вставить(ОшибкаОбработкиБанком, "PROCESSED_BY_BANK_ERROR");
	Статусы.Вставить(ОтправленоПользователю, "SENT_TO_USER"); 
	Статусы.Вставить(ДоставленоПользователю, "DELIVERED_TO_USER");
	Статусы.Вставить(ОбрабатываетсяПользователем, "IN_PROCESSING_BY_USER");
	Статусы.Вставить(ОбработаноПользователем, "PROCESSED_BY_USER_SUCCESS");
	Статусы.Вставить(ОшибкаОбработкиПользователем, "PROCESSED_BY_USER_ERROR");
	Статусы.Вставить(ОжидаетОтправкиВБанк, "WAITING");
	
	Возврат Статусы; 
	
КонецФункции

#КонецОбласти
		
#КонецЕсли