#Область ПрограммныйИнтерфейс

#Область ФоноваяПроверкаОтрицательныхОстатков

Функция ЗапуститьПроверкуОтрицательныхОстатковНаСервере(Организация, Период, УникальныйИдентификатор) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Проверка отрицательных остатков в учете'");
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"ИнформированиеОтрицательныеОстатки.ПроверитьОтрицательныеОстаткиВФоне",
		Организация,
		Период);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

// Получение количества позиций с отрицательными остатками, рассчитанного фоновым заданием в
// ИнформированиеОтрицательныеОстатки.КоличествоПозицийСОтрицательнымиОстатками
//
// Параметры:
//  АдресРезультата	 - Строка 
// 
// Возвращаемое значение:
// КоличествоПозиций  - Число 
//
Функция РезультатПроверки(Знач АдресРезультата) Экспорт
	
	КоличествоПозиций = ПолучитьИзВременногоХранилища(АдресРезультата);
	Возврат КоличествоПозиций;
	
КонецФункции

#КонецОбласти

#КонецОбласти