#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ИнтеграцияИСПереопределяемый.ПередЗаписьюОбъекта(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	КоличествоСоставляющихТукосмеси = СоставТукосмеси.Количество();

	Если Не ВидПродукции = Перечисления.ВидыПродукцииСАТУРН.Тукосмесь Тогда
		ПроверяемыеРеквизиты.Удалить("СоставТукосмеси");
	ИначеЕсли КоличествоСоставляющихТукосмеси < 2 Тогда
		
		Шаблон = НСтр("ru = 'Количество ПА в составе тукосмеси - %1. 
					  |Должно быть не менее 2.'");
		
		ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон(Шаблон, Формат(КоличествоСоставляющихТукосмеси, "ЧДЦ=0; ЧГ=3,0;")),,
			"СоставТукосмеси",,
			Отказ);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли