
#Область ПрограммныйИнтерфейс

// Возвращает структуру параметров, по данным которой можно будет открыть помощник
// подготовки регламентированного отчета, уведомления ЕНС.
//
Функция НовыйПараметрыПомощника() Экспорт
	
	Параметры = Новый Структура;
	
	Параметры.Вставить("Организация", Неопределено);
	Параметры.Вставить("РегистрацияВНалоговомОргане", Неопределено);
	Параметры.Вставить("Срок", Дата(1,1,1));
	Параметры.Вставить("ПериодСобытия", Дата(1,1,1));
	Параметры.Вставить("КонецПериода", Дата(1,1,1));
	Параметры.Вставить("Наименование", "");
	Параметры.Вставить("ИдентификаторЗадачи", "");
	Параметры.Вставить("Правило", Неопределено);
	Параметры.Вставить("ЭтоУведомление", Ложь);
	
	Возврат Параметры;
	
КонецФункции

// Возвращает структуру параметров, необходимых для передачи в параметрах ссылки, чтобы
// приложение могло выполнить переход в помощник подготовки отчета, уведомления ЕНС.
//
Функция НовыйПараметрыНавигационнойСсылки() Экспорт
	
	Параметры = Новый Структура;
	
	// Параметр ссылки, указывающий на то, как следует обработать эту внешнюю ссылку.
	// Сейчас доступно только одно действие - открыть помощник подготовки бухгалтерской отчетности.
	// При добавлении других действий следует их список вынести в отдельную структуру данных.
	Параметры.Вставить("action", "open_assistant");
	
	Параметры.Вставить("application_id", ""); // идентификатор приложения, сгенерировавшего ссылку
	Параметры.Вставить("organization", ""); // GUID элемента справочника "Организации"
	Параметры.Вставить("registration", ""); // регистрация в налоговом органе (строка, 4 символа)
	Параметры.Вставить("limit", ""); // крайний срок сдачи отчета (например, "20240131")
	Параметры.Вставить("period", ""); // период, за который сдается отчет (например, "20240131")
	Параметры.Вставить("description", ""); // полное название отчета, которое будет выведено в заголовок формы
										   // помощника (например, "Бухгалтерская отчетность за 2023 г.")
	Параметры.Вставить("task_id", ""); // идентификатор задачи бухгалтера (например, "БухгалтерскаяОтчетность")
	Параметры.Вставить("rule_id", ""); // идентификатор правила сдачи отчета (например, "2013_ОбщаяФорма")
	Параметры.Вставить("is_notification", ""); // признак, является ли эта задача уведомлением по ЕНС (значения "true" или "false")
	
	Возврат Параметры;
	
КонецФункции

Функция ПустоеЗначениеПараметраНавигационнойСсылки() Экспорт
	
	Возврат "none";
	
КонецФункции

// Возвращает ключ хранения в безопасном хранилище списка организаций этого облачного приложения,
// по которым не нужно формировать календарь отчетности.
//
Функция КлючХраненияСпискаОтключенныхОрганизаций() Экспорт
	
	Возврат "ОтключенныеОрганизацииКалендаряОтчетности";
	
КонецФункции

#КонецОбласти