#Область ПрограммныйИнтерфейс

// Возвращает настройки для баннера при смене объекта УСН
//
// Параметры:
//   Организация - СправочникСсылка.Организации - ссылка на проверяемую организацию
// 
// Возвращаемое значение:
//   Структура - см. НовыеНастройкиДляБаннераСменыОбъектаУСН
//
Функция НастройкиДляБаннераСменыОбъектаУСН(Организация) Экспорт
	// Запрос должен получить год учета, признак объекта (доход или расход) и признак напоминания
	// Можно было бы это сделать из одного регистра НастройкиУчетаУСН, но в нем нет признака объекта
	// в нем есть только ставка, а ставка подвержена изменению, поэтому связываем с регистром НастройкиСистемыНалогообложения
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НастройкиСистемыНалогообложенияСрезПоследних.Период КАК Период,
		|	НастройкиСистемыНалогообложенияСрезПоследних.ПрименяетсяУСНДоходы КАК ПрименяетсяУСНДоходы
		|ПОМЕСТИТЬ втСистемаНалогообложения
		|ИЗ
		|	РегистрСведений.НастройкиСистемыНалогообложения.СрезПоследних(
		|			&ДатаФормирования,
		|			Организация = &Организация
		|				И (ПрименяетсяУСНДоходы
		|					ИЛИ ПрименяетсяУСНДоходыМинусРасходы)) КАК НастройкиСистемыНалогообложенияСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	НастройкиУчетаУСНСрезПоследних.НапоминатьОВведенииОстатков КАК НапоминатьОВведенииОстатков
		|ПОМЕСТИТЬ втУчетУСН
		|ИЗ
		|	РегистрСведений.НастройкиУчетаУСН.СрезПоследних(&ДатаФормирования, Организация = &Организация) КАК НастройкиУчетаУСНСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втСистемаНалогообложения.Период КАК Период,
		|	втСистемаНалогообложения.ПрименяетсяУСНДоходы КАК ПрименяетсяУСНДоходы,
		|	втУчетУСН.НапоминатьОВведенииОстатков КАК НапоминатьОВведенииОстатков
		|ИЗ
		|	втСистемаНалогообложения КАК втСистемаНалогообложения,
		|	втУчетУСН КАК втУчетУСН";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаФормирования", ТекущаяДатаСеанса());
	ПериодыПерехода = Запрос.Выполнить().Выбрать();
	
	Если ПериодыПерехода.Следующий() Тогда
		Настройки = НовыеНастройкиДляБаннераСменыОбъектаУСН();
		Настройки.Год         = Формат(ПериодыПерехода.Период, "ДФ=yyyy");
		Настройки.ОбъектДоход = ПериодыПерехода.ПрименяетсяУСНДоходы;
		Настройки.Напоминать  = ПериодыПерехода.НапоминатьОВведенииОстатков;
		
		Возврат Настройки;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИспользуетсяДатаИзменения(Организация, СистемаНалогообложения = Неопределено) Экспорт
	
	Возврат НастройкиСистемыНалогообложенияФормы.ИспользуетсяДатаИзменения(Организация, СистемаНалогообложения);
	
КонецФункции

Функция НовыеНастройкиДляБаннераСменыОбъектаУСН()
	Настройки = Новый Структура;
	Настройки.Вставить("Год", "");
	Настройки.Вставить("ОбъектДоход", Ложь);
	Настройки.Вставить("Напоминать", Ложь);
	
	Возврат Настройки;
КонецФункции

#КонецОбласти