////////////////////////////////////////////////////////////////////////////////
// ЕдиныйНалоговыйСчетЛичныйКабинетПереопределяемый
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОсновнаяОрганизация(ТекущаяОрганизация) Экспорт
	
КонецПроцедуры

Процедура ГоловнаяОрганизация(ТекущаяОрганизация) Экспорт
	
	ТекущаяОрганизация = РегламентированнаяОтчетность.ГоловнаяОрганизация(ТекущаяОрганизация);
	
КонецПроцедуры

Процедура ДоступныеОрганизации(ТаблицаОрганизация) Экспорт
	
	ЕдиныйНалоговыйСчетИнтеграцияБП.ДоступныеОрганизации(ТаблицаОрганизация);
	
КонецПроцедуры

Процедура ОсновнаяРегистрацияВНалоговомОргане(Организация, ТекущаяРегистрация) Экспорт
	
КонецПроцедуры

Процедура ПриСозданииНаСервере(Форма) Экспорт
	
КонецПроцедуры

Процедура ПодготовитьФормуНаСервере(Форма) Экспорт
	
КонецПроцедуры

Процедура УправлениеФормой(Форма) Экспорт
	
КонецПроцедуры

Процедура УстановитьУсловноеОформление(Форма) Экспорт
	
КонецПроцедуры

Процедура ПереключениеКомандПлатежиРасхождение(Форма) Экспорт
	
КонецПроцедуры

Процедура ПереключениеКомандОтчетыРасхождение(Форма) Экспорт
	
КонецПроцедуры

Процедура ПереключениеКомандНачисленияРасхождение(Форма) Экспорт
	
КонецПроцедуры

Процедура ПереключениеКомандПениШтрафыРасхождение(Форма) Экспорт
	
КонецПроцедуры

Процедура ПоддерживаетсяРежимСверки(Признак) Экспорт
	
	ЕдиныйНалоговыйСчетИнтеграцияБП.ПоддерживаетсяРежимСверки(Признак);
	
КонецПроцедуры

Процедура ПоддерживаетсяРежимСверкиПлатежи(Признак) Экспорт
	
	ЕдиныйНалоговыйСчетИнтеграцияБП.ПоддерживаетсяРежимСверкиПлатежи(Признак);
	
КонецПроцедуры

Процедура ПоддерживаетсяРежимСверкиОтчеты(Признак) Экспорт
	
	ЕдиныйНалоговыйСчетИнтеграцияБП.ПоддерживаетсяРежимСверкиОтчеты(Признак);
	
КонецПроцедуры

Процедура ПоддерживаетсяРежимСверкиНачисления(Признак) Экспорт
	
	ЕдиныйНалоговыйСчетИнтеграцияБП.ПоддерживаетсяРежимСверкиНачисления(Признак);
	
КонецПроцедуры

Процедура ПоддерживаетсяРежимСверкиПениШтрафы(Признак) Экспорт
	
	ЕдиныйНалоговыйСчетИнтеграцияБП.ПоддерживаетсяРежимСверкиПениШтрафы(Признак);
	
КонецПроцедуры

Процедура ПоддерживаетсяАвтоматическаяРегистрацияУплат(Признак) Экспорт
	
	ЕдиныйНалоговыйСчетИнтеграцияБП.ПоддерживаетсяАвтоматическаяРегистрацияУплат(Признак);
	
КонецПроцедуры

Процедура ПериодОбработкиДанныхДляРегистрацииУплат(Организация, НачалоПериода, КонецПериода) Экспорт
	
	ЕдиныйНалоговыйСчетИнтеграцияБП.ПериодОбработкиДанныхДляРегистрацииУплат(Организация, НачалоПериода, КонецПериода);
	
КонецПроцедуры

Процедура ДоступноОтражениеВУчетеНачислений(Признак) Экспорт
	
КонецПроцедуры

Процедура ДоступноОтражениеВУчетеПениШтрафов(Признак) Экспорт
	
КонецПроцедуры

Процедура ОтражениеВУчетеДоступноСтрокаНачисления(ДанныеСтроки, Признак) Экспорт
	
КонецПроцедуры

Процедура ОтражениеВУчетеДоступноСтрокаПениШтрафы(ДанныеСтроки, Признак) Экспорт
	
КонецПроцедуры

#КонецОбласти
