
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КлючВарианта",            "РасшифровкаЗачетаАвансовНаЕНС");
	Параметрыформы.Вставить("НачалоПериода",           НачалоГода(ТекущаяДата()));
	Параметрыформы.Вставить("КонецПериода",            КонецДня(ТекущаяДата()));
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	
	ОткрытьФорму("Отчет.СправкаРасчетЗачетАвансаПоЕдиномуНалоговомуСчету.Форма.ФормаОтчета", ПараметрыФормы);
	
КонецПроцедуры
