#Область ПрограммныйИнтерфейс

// Возвращает список доступных типов оборудования.
// 
// Параметры:
//   СписокТиповОборудования - Массив из ПеречислениеСсылка.ТипыПодключаемогоОборудования - 
//                             доступные типы подключаемого оборудования в конфигурации.
//   СтандартнаяОбработка - Булево - признак выполнения стандартной обработки.
// Пример:
//   СписокТиповОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ККТ).
//
Процедура ДоступныеТипыОборудования(СписокТиповОборудования, СтандартнаяОбработка) Экспорт
	СтандартнаяОбработка = Ложь;
	
	// Сканеры штрихкода
	СписокТиповОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.СканерШтрихкода);
	// Конец Сканеры штрихкода
	
	// Считыватели RFID
	СписокТиповОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.СчитывательRFID);
	// Конец Считыватели RFID.
	
	// ККТ с передачей данных ОФД
	СписокТиповОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ККТ);
	// Конец ККТ с передачей данных ОФД.
	
	// Принтеры чеков
	СписокТиповОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ПринтерЧеков);
	// Конец принтеры чеков.
	
	// Терминалы сбора данных
	СписокТиповОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных);
	// Конец Терминалы сбора данных.

	// Эквайринговые терминалы
	СписокТиповОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ЭквайринговыйТерминал);
	// Конец Эквайринговые терминалы.
	
	// Дисплеи покупателя
	СписокТиповОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ДисплейПокупателя);
	// Конец Дисплеи покупателя.
	
	// Принтер этикеток
	СписокТиповОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ПринтерЭтикеток);
	// Конец Принтер этикеток
КонецПроцедуры

// Возвращает флаг возможности добавления новых драйверов оборудования в справочник.
// Параметры:
//   ДобавлениеНовыхДрайверовДоступно - Булево - флаг возможности добавления новых компонент подключения оборудования.
//   СтандартнаяОбработка - Булево - признак выполнения стандартной обработки,
// Пример:
//   ДобавлениеНовыхДрайверовДоступно = Ложь;
//   СтандартнаяОбработка = Ложь. 
//
Процедура ДоступноДобавлениеНовыхДрайверов(ДобавлениеНовыхДрайверовДоступно, СтандартнаяОбработка) Экспорт
	СтандартнаяОбработка = Ложь;
	ДобавлениеНовыхДрайверовДоступно = ПравоДоступа("Добавление", Метаданные.Справочники.ПодключаемоеОборудование);
КонецПроцедуры

// Возвращает доступность сетевого оборудования.
//
// Параметры:
//  СетевоеОборудованиеДоступно - Булево - Сетевое оборудование доступно.
//  СтандартнаяОбработка - Булево - Стандартная обработка.
//
Процедура ДоступноСетевоеОборудование(СетевоеОборудованиеДоступно, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;     
	СетевоеОборудованиеДоступно = Ложь;
	
КонецПроцедуры

// Возвращает доступность инкассации в форме управление фискальным устройством.
//  
// Параметры:
//  ИнкассацияДоступна - Булево - Доступность инкассации.
//  СтандартнаяОбработка - Булево - Стандартная обработка.
//
Процедура ДоступноИнкассацияВУправлениеФискальнымУстройством(ИнкассацияДоступна, СтандартнаяОбработка) Экспорт

КонецПроцедуры

// Доступны возвраты без карты.       
//
// Параметры:
//  ВозвратыБезКарты - Структура - Доступны возвраты без карты:
//  * ВозвратПоПлатежнойКарте - Булево
//  * ВозвратЭлектроннымСертификатом - Булево
//
Процедура ДоступноВозвратыБезКарты(ВозвратыБезКарты) Экспорт
	
КонецПроцедуры  

// Переопределяемая процедура для подсистемы управление доступом СтандартныеПодсистемы
// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
//
// Параметры:
//  Менеджер - Строка 
//  Ограничение - Структура:
//    * Текст                             - Строка - ограничение доступа для пользователей.
//                                          Если пустая строка, значит, доступ разрешен.
//    * ТекстДляВнешнихПользователей      - Строка - ограничение доступа для внешних пользователей.
//                                          Если пустая строка, значит, доступ запрещен.
//    * ПоВладельцуБезЗаписиКлючейДоступа - Неопределено - определить автоматически.
//                                        - Булево - если Ложь, то всегда записывать ключи доступа,
//                                          если Истина, тогда не записывать ключи доступа,
//                                          а использовать ключи доступа владельца (требуется,
//                                          чтобы ограничение было строго по объекту-владельцу).
//   * ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей - Неопределено, Булево - также
//                                          как у параметра ПоВладельцуБезЗаписиКлючейДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Менеджер, Ограничение) Экспорт
	МенеджерОборудованияБП.ПриЗаполненииОграниченияДоступа(Менеджер, Ограничение);
КонецПроцедуры

#Область Обновление

// Переопределяемая часть процедуры обновления с БПО 3
//  
// Параметры:
//  СсылкаПодключаемоеОборудование - СправочникСсылка.ПодключаемоеОборудование - оборудование для обновления перехода с БПО 3
//
Процедура ОбновитьСправочникПодключаемогоОборудования(СсылкаПодключаемоеОборудование) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ОборудованиеККТ

// Процедура заполняет реквизиты организации для регистрации ФН.
//  
// Параметры:
//  Организация - ОпределяемыйТип.ОрганизацияБПО - организация для заполнения реквизитов.
//  ПараметрыРегистрации - Структура - параметры регистрации ФН.
//
Процедура ЗаполнитьРеквизитыОрганизацииДляРегистрацииФН(Организация, ПараметрыРегистрации) Экспорт
	СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Организация);
	
	ПараметрыРегистрации.Вставить("ОрганизацияНазвание",     СведенияОбОрганизации.НаименованиеДляПечатныхФорм);
	ПараметрыРегистрации.Вставить("ОрганизацияИНН",          СведенияОбОрганизации.ИНН);
	ПараметрыРегистрации.Вставить("АдресПроведенияРасчетов", СведенияОбОрганизации.ФактическийАдрес);
КонецПроцедуры

// Переопределяет формируемый шаблон чека.
//
// Параметры:
//  ШаблонЧека - см. ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОперацииФискализацииЧека
//  ОбщиеПараметры - см. ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОперацииФискализацииЧека
//  ДополнительныйТекст - Строка - Дополнительный текст шаблона чека.
//  СтандартнаяОбработка - Булево - Признак стандартной обработки.
//  ТипОборудования - Строка - Типы оборудования строкой.
//
Процедура СформироватьШаблонЧека(ШаблонЧека, ОбщиеПараметры, ДополнительныйТекст, СтандартнаяОбработка, ТипОборудования = "") Экспорт

КонецПроцедуры

// Возвращает для каких типов идентификаторов будет заполняться тег 1162 (код товара).
//
// Параметры:
//  ТипыИдентификаторов - Массив из ПеречислениеСсылка.ТипыИдентификаторовТовараККТ
//  СтандартнаяОбработка - Булево - Стандартная обработка
//
Процедура КодТовараЗаполняетсяДляТиповИдентификаторов(ТипыИдентификаторов, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Возвращает, для каких типов товаров будет заполняться отраслевой реквизит.
//
// Параметры:
//  ТипыТоваров - Структура:
//  * ИзделияИзНатуральногоМеха - Булево - Заполнения для изделия из натурального меха. 
//  * ОбъемноСортовойУчет - Булево - Заполнения для товаров объемно сортового учета.
//
Процедура ОтраслевойРеквизитЗаполняетсяДляТиповТоваров(ТипыТоваров) Экспорт
	ТипыТоваров.ОбъемноСортовойУчет = МенеджерОборудованияБП.ВедетсяОбъемноСортовойУчет();
	ТипыТоваров.ИзделияИзНатуральногоМеха 
		= ИнтеграцияИСМПКлиентСерверПовтИсп.ВестиУчетМаркируемойПродукции(Перечисления.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха);
		
КонецПроцедуры

// Ведется учет ИСМП в конфигурации
// Параметры:
//  УчетПродукцииИСМП - Булево - Ведется учет ИСМП в конфигурации 
//  СтандартнаяОбработка - Булево - Выполнение стандартной обработки
//
Процедура ВедетсяУчетПродукцииИСМП(УчетПродукцииИСМП, СтандартнаяОбработка) Экспорт
	СтандартнаяОбработка = Ложь;
	УчетПродукцииИСМП = ПолучитьФункциональнуюОпцию("ВестиУчетМаркируемойПродукцииИСМП");
КонецПроцедуры

// Ведется объемно сортовой учет в конфигурации
// Параметры:
//  ОбъемноСортовойУчет - Булево - Ведется объемно сортовой учет в конфигурации 
//  СтандартнаяОбработка - Булево - Выполнение стандартной обработки
//
Процедура ВедетсяОбъемноСортовойУчет(ОбъемноСортовойУчет, СтандартнаяОбработка) Экспорт
	СтандартнаяОбработка = Ложь;
	
	ОбъемноСортовойУчет = МенеджерОборудованияБП.ВедетсяОбъемноСортовойУчет();

КонецПроцедуры

// Процедура где можно добавить любой текст при формировании чека в формате PDF.
//
// Параметры:
//   ТекстЗаголовка - Строка - Текст который будет выведен при формировании кассового чека в формате PDF
//   ТекстПодвала - Строка - Текст который будет выведен при формировании кассового чека в формате PDF
Процедура ДополнительныйТекстПриФормированииЧекаPDF(ТекстЗаголовка, ТекстПодвала) Экспорт
	
КонецПроцедуры

// Вызвается после открытия кассовой смены
// Параметры:
//  ИдентификаторУстройства - СправочникСсылка.ПодключамоеОборудование - ссылка на оборудование, 
//                              на котором выполняется открытие смены
//  Результат - Структура - результат открытия кассовой смены:
//   * Результат - Булево - результат закрытия смены
//   * ОписаниеОшибки - Строка - описание ошибки
//   * НомерСменыККТ - Строка
//   * НомерЧекаККТ - Строка
//   * ПараметрыККТ - см. ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыФискальногоНакопителяОбщие.
Процедура ПослеОткрытияКассовойСмены(ИдентификаторУстройства, Результат) Экспорт
	
КонецПроцедуры

// Вызвается после закрытия кассовой смены
// Параметры:
//  ИдентификаторУстройства - СправочникСсылка.ПодключамоеОборудование - ссылка на оборудование, 
//                              на котором выполняется закрытие смены
//  Результат - Структура - результат закрытия кассовой смены:
//   * Результат - Булево - результат закрытия смены
//   * ОписаниеОшибки - Строка - описание ошибки
//   * КассоваяСмена - ДокументСсылка.КассоваяСмена
//   * НомерСменыККТ - Строка
//   * НомерЧекаККТ - Строка
Процедура ПослеЗакрытияКассовойСмены(ИдентификаторУстройства, Результат) Экспорт
	
КонецПроцедуры

// Вызывается после проверки кодов маркировки на ККТ
//
// Параметры:
//   ДанныеОбмена - Массив из Структура :
//     * ЗапросКМ - Строка - текст запроса к ККТ в виде XML
//     * ЛокальныйОтветКМ - Строка, Неопределено - текст ответа от ККТ в виде XML, если содержит Неопределено, тогда результат не получен
//     * УдаленныйОтветКМ - Массив из Строка, Неопределено - текст ответа от удаленного сервера проверки кода маркировки в виде XML, 
//                      если содержит Неопределено, тогда результат не получен
//
Процедура ПослеПроверкиКодовМаркировки(ДанныеОбмена) Экспорт
	
	ЛогированиеЗапросовИСМП.ПослеПроверкиКодовМаркировки(ДанныеОбмена);
	
КонецПроцедуры

#КонецОбласти

// ++ Локализация

#Область Маркировка

#КонецОбласти

// Заполняет сведения об организации по сслыке типа ОпределяемыеТипы.Организация, для отображения 
// на форме просмотра фискализированного чека, если установлен флаг СтандартнаяОбработка,
// тогда в качестве наименования будет использовано представление значения Организация.
//
// Параметры:
//  Организация - ОпределяемыеТипы.Организация
//  СведенияОбОрганизации - Структура:
//        * Наименование - Строка
//  СтандартнаяОбработка - Булево
//
Процедура СведенияОбОрганизации(Организация, СведенияОбОрганизации, СтандартнаяОбработка) Экспорт
	СтандартнаяОбработка = Ложь;
	СведенияОбОрганизации.Вставить("Наименование", 
		БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Организация).НаименованиеДляПечатныхФорм);
КонецПроцедуры

#Область РаботаСФормойЭкземпляра

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПриСозданииНаСервере".
//
// Параметры:
//  Объект - СправочникОбъект.ПодключаемоеОборудование - Объект подключаемого оборудования.
//  ЭтаФорма - ФормаКлиентскогоПриложения - Форма настройки оборудования
//  Отказ - Булево - Отказ создания
//  Параметры - Структура - Параметры операции
//  СтандартнаяОбработка - Булево - Стандартная обработка
//
Процедура ЭкземплярОборудованияПриСозданииНаСервере(Объект, ЭтаФорма, Отказ, Параметры, СтандартнаяОбработка) Экспорт
	МенеджерОборудованияБП.ЭкземплярОборудованияПриСозданииНаСервере(Объект, ЭтаФорма, Отказ, Параметры, СтандартнаяОбработка);
КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПриЧтенииНаСервере".
//
// Параметры:
//  ТекущийОбъект - СправочникОбъект.ПодключаемоеОборудование - Объект подключаемого оборудования.
//  ЭтаФорма - ФормаКлиентскогоПриложения - Форма настройки оборудования
//
Процедура ЭкземплярОборудованияПриЧтенииНаСервере(ТекущийОбъект, ЭтаФорма) Экспорт
	МенеджерОборудованияБП.ЭкземплярОборудованияПриЧтенииНаСервере(ТекущийОбъект, ЭтаФорма);
КонецПроцедуры


// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПередЗаписьюНаСервере".
//
// Параметры:
//  Отказ - Булево - Отказ операции
//  ТекущийОбъект - СправочникОбъект.ПодключаемоеОборудование - Объект подключаемого оборудования.
//  ПараметрыЗаписи - Структура - Параметры операции
//
Процедура ЭкземплярОборудованияПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт

КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПриЗаписиНаСервере".
//
// Параметры:
//  Отказ - Булево - Отказ операции
//  ТекущийОбъект - СправочникОбъект.ПодключаемоеОборудование - Объект подключаемого оборудования.
//  ПараметрыЗаписи - Структура - Параметры операции
//
Процедура ЭкземплярОборудованияПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	МенеджерОборудованияБП.ЭкземплярОборудованияПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи);
КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПослеЗаписиНаСервере".
//
// Параметры:
//  ТекущийОбъект - СправочникОбъект.ПодключаемоеОборудование - Объект подключаемого оборудования.
//  ПараметрыЗаписи - Структура - Параметры операции
//
Процедура ЭкземплярОборудованияПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи) Экспорт

КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ОбработкаПроверкиЗаполненияНаСервере".
//
// Параметры:
//  Объект - СправочникОбъект.ПодключаемоеОборудование - Объект подключаемого оборудования.
//  ЭтаФорма - ФормаКлиентскогоПриложения - Форма настройки оборудования
//  Отказ - Булево - Отказ создания
//  ПроверяемыеРеквизиты - Структура - Проверяемые реквизиты
//
Процедура ЭкземплярОборудованияОбработкаПроверкиЗаполненияНаСервере(Объект, ЭтаФорма, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	Если Объект.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ Тогда
		ПараметрыОбъекта = МенеджерОборудованияБП.НовыйПараметрыПроверкиЗаполнения();
		ЗаполнитьЗначенияСвойств(ПараметрыОбъекта, ЭтаФорма);
		МенеджерОборудованияБП.ОбработкаПроверкиЗаполненияПечатьЧека(ПараметрыОбъекта, Ложь, Отказ);
	КонецЕсли; 

КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре Фискальные операции
// при событии "ПриСозданииНаСервере".
//
// Параметры:
//  Запись - РегистрСведенийЗапись.ФискальныеОперации - Запись фискальные операции.
//  ЭтаФорма - ФормаКлиентскогоПриложения - Форма настройки оборудования
//  Отказ - Булево - Отказ создания
//  Параметры - Структура - Параметры операции
//  СтандартнаяОбработка - Булево - Стандартная обработка
//
Процедура ЭкземплярФискальныеОперацииПриСозданииНаСервере(Запись, ЭтаФорма, Отказ, Параметры, СтандартнаяОбработка) Экспорт
	МенеджерОборудованияБП.ЭкземплярФискальныеОперацииПриСозданииНаСервере(Запись, ЭтаФорма, Отказ, Параметры, СтандартнаяОбработка);
КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре Фискальные операции
// при событии "ПриСозданииНаСервере".
//
// Параметры:
//  Запись - РегистрСведенийЗапись.ФискальныеОперации - Запись фискальные операции.
//  ЭтаФорма - ФормаКлиентскогоПриложения - Форма настройки оборудования
//  Отказ - Булево - Отказ создания
//  СтандартнаяОбработка - Булево - Стандартная обработка
//
Процедура ЭкземплярПлатежныеОперацииПриСозданииНаСервере(Запись, ЭтаФорма, Отказ, СтандартнаяОбработка) Экспорт

КонецПроцедуры

#КонецОбласти

#Область РаботаСФормойСписка

// Дополнительные переопределяемые действия с управляемой формой в Список Фискальные операции
// при событии "ПриСозданииНаСервере".
//
// Параметры:
//  ЭтаФорма - ФормаКлиентскогоПриложения - Форма настройки оборудования
//  Отказ - Булево - Отказ создания
//  Параметры - Структура - Параметры операции
//  СтандартнаяОбработка - Булево - Стандартная обработка
//
Процедура СписокФискальныеОперацииПриСозданииНаСервере(ЭтаФорма, Отказ, Параметры, СтандартнаяОбработка) Экспорт

КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Список платежные операции
// при событии "ПриСозданииНаСервере".
//
// Параметры:
//  ЭтаФорма - ФормаКлиентскогоПриложения - Форма настройки оборудования
//  Параметры - Структура - Параметры операции
//  Отказ - Булево - Отказ создания.
//  СтандартнаяОбработка - Булево - Стандартная обработка.
//
Процедура СписокПлатежныеОперацииПриСозданииНаСервере(ЭтаФорма, Отказ, Параметры, СтандартнаяОбработка) Экспорт

КонецПроцедуры

#КонецОбласти 

// Обработчик события заполнения персональных данных.
//
// Параметры:
//  ПерсональныеДанные - Структура - Возвращаемый параметр, персональные данные.
//  СубъектПерсональныхДанных - ОпределяемыйТип.СубъектПерсональныхДанныхБПО - субъект персональных данных. 
//  ТипПерсональныхДанных - ПеречислениеСсылка.ТипыПерсональныхДанныхККТ - Тип персональных данных
//  НаДату - Дата - Дата, на которую необходимо получать персональные данные
//
Процедура ОбработкаЗаполненияПерсональныхДанных(ПерсональныеДанные, СубъектПерсональныхДанных, ТипПерсональныхДанных, НаДату) Экспорт
	МенеджерОборудованияБП.ОбработкаЗаполненияПерсональныхДанных(ПерсональныеДанные, СубъектПерсональныхДанных, ТипПерсональныхДанных, НаДату);
КонецПроцедуры

#Область ПродажаСВыдачейНаличных

// Процедура где требуется проверить достаточность наличных денежных средств в кассовом аппарате
//
// Параметры:
//   ИдентификаторККТ - СправочникСсылка.ПодключаемоеОборудование - ссылка на элемент КТТ
//   Сумма - Число - требуемая сумма для выдачи наличных
//   Отказ - Булево - если установить в Истина, тогда выдача наличных осуществляться не будет
Процедура ПроверитьДостаточностьНаличныхСредств(ИдентификаторККТ, Сумма, Отказ) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСФормойТоваровНСПК

// Процедура, где требуется заполнить дерево товаров по кодам ТРУ.
//
// Параметры:
//   ДеревоСертификатовЗначение - ДеревоЗначений - дерево значений для заполнения
//   КодыТоваровТРУ - ТаблицаЗначений - таблица значений с товарами и кодами ТРУ для поиска сопоставлений
Процедура ЗаполнитьДеревоТоваровПоКодамТРУ(ДеревоСертификатовЗначение, КодыТоваровТРУ) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область УстаревшиеПроцедурыИФункции

#Область ОборудованиеККТ

// Устарела: следует использовать МенеджерОборудованияКлиентПереопределяемый.ДоступноеККТДляФискализации.
// Переопределяет доступное ККТ для фискализации чека.
//
// Параметры:
//  РеквизитыЧека - Структура - реквизиты фискального чека
//  СписокУстройств - Массив - Список доступных ККТ для фискализации
//  ИдентификаторУстройстваККТ - СправочникСсылка.ПодключаемоеОборудование - выбранное ККТ для фискализации
//
Процедура ДоступноеККТДляФискализации(РеквизитыЧека, СписокУстройств, ИдентификаторУстройстваККТ) Экспорт

КонецПроцедуры

#КонецОбласти

#Область РаботаСЭлементомФормы

// Устарела: больше не используется.
// Дополнительные переопределяемые действия с элементом формы 
// служит для учета специфики визуального отображения в зависимости от типа клиента.
//
// Параметры:
//  ЭлементУправления - ЭлементУправленияИнтерфейсом - элемент управления.
//  СтандартнаяОбработка - Булево - Стандартная обработка.
//
Процедура ПодготовитьЭлементУправления(ЭлементУправления, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти