
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДоступенСервис1СКабинетСотрудника = 
		ПравоДоступа("Просмотр", Метаданные.ОбщиеФормы.ИнтеграцияССервисомКабинетСотрудника);
	
	Элементы.Сервис1СКабинетСотрудника.Видимость = ДоступенСервис1СКабинетСотрудника;
	
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура НастройкиЗарплаты(Команда)
	
	ОткрытьФормуВОкнеФормы("ОбщаяФорма.НастройкиЗарплаты");
	
КонецПроцедуры

&НаКлиенте
Процедура ФизическиеЛица(Команда)
	
	ОткрытьФормуВОкнеФормы("Справочник.ФизическиеЛица.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатныеПроекты(Команда)
	
	ОткрытьФормуВОкнеФормы("Справочник.ЗарплатныеПроекты.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура Сервис1СКабинетСотрудника(Команда)
	
	ОткрытьФормуВОкнеФормы("ОбщаяФорма.ИнтеграцияССервисомКабинетСотрудника");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьФормуВОкнеФормы(ИмяФормы)
	
	ОткрытьФорму(ИмяФормы, , ЭтотОбъект, ИмяФормы, Окно);
	
КонецПроцедуры

#КонецОбласти