
#Область ПрограммныйИнтерфейс

// Возвращает текст гиперссылки для открытия формы ПечатьАртикулов обработки ПанелиАдминистрированияБП
//
// Возвращаемое значение
//  Строка - текст гиперссылки
//
Функция ГиперссылкаФормыНастройкиПечатиАртикулов() Экспорт
	
	Возврат "e1cib/data/Обработка.ПанельАдминистрированияБП.Форма.ПечатьАртикулов";
	
КонецФункции

// Проверяет по имени подключаемой команды, что это вызов отчета Реестр документов.
//
// Параметры:
//   ИмяКоманды - Строка - имя подключаемой команды
//
// Возвращаемое значение
//  Булево - результат проверки: Истина - это Реестр документов, Ложь - другая команда.
//
Функция ЭтоИмяКомандыРеестрДокументов(ИмяКоманды) Экспорт
	
	Результат = Ложь;
	
	СоставИнтерфейсаКоманды = СтрРазделить(ИмяКоманды, "_", Ложь);
	Если СоставИнтерфейсаКоманды.Количество() = 2
		И СоставИнтерфейсаКоманды[0] = "ПодменюПечатьОбычное"
		И (СоставИнтерфейсаКоманды[1] = "Реестр"
			Или СтрНачинаетсяС(СоставИнтерфейсаКоманды[1], "РеестрДокументов")) Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
