#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
Процедура ПередЗаписью(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ ИЛИ Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	Для каждого Движение Из ЭтотОбъект Цикл
		Если НЕ ЗначениеЗаполнено(Движение.Сделка)
			И Движение.Сделка <> Неопределено Тогда
			
			Движение.Сделка = Неопределено;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Движение.Партия)
			И Движение.Партия <> Неопределено Тогда
			
			Движение.Партия = Неопределено;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецЕсли