
#Область ПрограммныйИнтерфейс

Процедура ОткрытьФормуПомощникаПоУчетуНДС(ПараметрыОткрытияПомощника) Экспорт
		
КонецПроцедуры

Процедура ДополнительнаяОбработкаОповещения(Документ, ИмяСобытия, Параметр, Источник) Экспорт
	
	
КонецПроцедуры

Процедура ПослеЗаписиДокументаНДС(Форма, ПараметрыЗаписи) Экспорт
	
	Оповестить("СостояниеРегламентнойОперации", 
		?(Форма.Объект.Проведен, ПредопределенноеЗначение("Перечисление.ВидыСостоянийРегламентныхОпераций.Выполнено"), 
			ПредопределенноеЗначение("Перечисление.ВидыСостоянийРегламентныхОпераций.НеВыполнено")));
			
КонецПроцедуры

#КонецОбласти
